<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/comp-theory/22.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x4E0E;CFL&#x7684;&#x8054;&#x5408;&#x4E0E;&#x4EA4;&#x53C9;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5148;&#x51B3;&#x6761;&#x4EF6; -</b> <a href="http://Chomsky Hierarchy" rel="noopener" target="_blank">&#x4E54;&#x59C6;&#x65AF;&#x57FA;&#x7B49;&#x7EA7;</a> &#xFF0C; <a href="https://www.geeksforgeeks.org/regular-expressions-regular-grammar-and-regular-languages/" rel="noopener" target="_blank">&#x5E38;&#x89C4;&#x8BED;&#x8A00;</a></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;<b>&#x6709;&#x9650;&#x81EA;&#x52A8;&#x673A;</b>&#x63A5;&#x53D7;&#x7684;&#x8BED;&#x8A00;&#x88AB;&#x79F0;&#x4E3A;<b>&#x5E38;&#x89C4;</b>&#x8BED;&#x8A00;&#xFF0C;&#x800C;&#x88AB;<b>&#x4E0B;&#x63A8;&#x81EA;&#x52A8;&#x673A;</b>&#x63A5;&#x53D7;&#x7684;&#x8BED;&#x8A00;&#x88AB;&#x79F0;&#x4E3A;&#x65E0;<b>&#x4E0A;&#x4E0B;&#x6587;</b>&#x8BED;&#x8A00;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x8C08;&#x5230;&#x8FD9;&#x4E24;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x8054;&#x5408;&#x6216;&#x4EA4;&#x96C6;&#x65F6;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x53D1;&#x73B0;&#x96BE;&#x4EE5;&#x5206;&#x6790;&#x4EA4;&#x53C9;&#x70B9;&#x662F;&#x5426;&#x5BFC;&#x81F4;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x6216;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x8BED;&#x8A00;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8981;&#x6CE8;&#x610F;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;<b>&#x6BCF;&#x79CD;</b>&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x662F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#xFF0C;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8C03;&#x7528;&#x8BED;&#x8A00;&#x5E38;&#x89C4;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x8BBE;&#x8BA1;&#x5176;&#x7B49;&#x6548;&#x7684;&#x6709;&#x9650;&#x81EA;&#x52A8;&#x673A;&#xFF0C;&#x6216;&#x8005;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x6709;&#x9650;&#x81EA;&#x52A8;&#x673A;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x6709;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x8BE5;&#x8BED;&#x8A00; - &#x5982;&#x679C;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x5219;&#x4E3A;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x8BED;&#x8A00;&#x5B58;&#x5728;&#x89C4;&#x5219;&#x548C;&#x76F8;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x4E3A;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x4E0B;&#x63A8;&#x81EA;&#x52A8;&#x673A;&#xFF0C;&#x7136;&#x540E;&#x53EA;&#x5C06;&#x5176;&#x79F0;&#x4E3A;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x73B0;&#x5728;&#x7528;&#x7B80;&#x5355;&#x7684;&#x5355;&#x8BCD;&#x63A8;&#x4E0B;&#x81EA;&#x52A8;&#x673A;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x9650;&#x7684;&#x81EA;&#x52A8;&#x673A;&#xFF0C;&#x5176;&#x4E2D;<b>&#x5B58;&#x50A8;&#x5668;</b>&#x4F5C;&#x4E3A;<b>&#x65E0;&#x9650;&#x5806;&#x6808;&#x63D0;&#x4F9B;</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x60A8;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x6709;&#x9650;&#x81EA;&#x52A8;&#x673A;&#xFF0C;&#x7136;&#x540E;&#x4E5F;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x5176;&#x7B49;&#x6548;&#x7684;&#x4E0B;&#x63A8;&#x81EA;&#x52A8;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;<b>&#x4E0D;&#x4F7F;&#x7528;</b>&#x5176;&#x4E2D;&#x53EF;&#x7528;&#x7684;&#x65E0;&#x9650;&#x5806;&#x6808;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x89C2;&#x5BDF;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6700;&#x540E;&#x4F60;&#x5F97;&#x5230;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x79CD;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x6709;&#x9650;&#x81EA;&#x52A8;&#x673A;&#xFF0C;&#x4ECE;&#x800C;&#x63A8;&#x52A8;&#x81EA;&#x52A8;&#x673A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6BCF;&#x79CD;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x79F0;&#x4E3A;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6216;&#x8005;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x662F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x8BED;&#x8A00;&#x7684;&#x5B50;&#x96C6;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x4E0E;&#x4E0A;&#x4E0B;&#x6587;&#x65E0;&#x5173;&#x8BED;&#x8A00;&#x7684;&#x8054;&#x5408; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x6240;&#x6709;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x90FD;&#x662F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E24;&#x8005;&#x7684;&#x7ED3;&#x5408;&#x4F1A;&#x4EA7;&#x751F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x8BED;&#x8A00;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x7406;&#x89E3;&#x5B83;&#x603B;&#x662F;&#x597D;&#x7684;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x8BED;&#x8A00;L1 = {0 * 1 *}&#xFF08;&#x5E38;&#x89C4;&#xFF09;&#x548C;L2 = {0 ^ n1 ^ n | n&gt; = 0}&#xFF08;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA9;L = L1 U L2&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x8FD9;&#x4E24;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#xFF1A;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> L = {0 * 1 *}&#x8FD9;&#x662F;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x6BCF;&#x79CD;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x90FD;&#x662F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;&#x4E24;&#x8005;&#x7684;&#x7ED3;&#x5408;&#x603B;&#x662F;&#x5BFC;&#x81F4;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x8BED;&#x8A00;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x4E0E;&#x65E0;&#x8BED;&#x5883;&#x8BED;&#x8A00;&#x7684;&#x4EA4;&#x53C9; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x6240;&#x6709;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x90FD;&#x662F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x6240;&#x4EE5;&#x7406;&#x89E3;&#x4E24;&#x8005;&#x7684;&#x7ED3;&#x5408;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x8BA8;&#x8BBA;&#x4EA4;&#x96C6;&#x65F6;&#xFF0C;&#x7B54;&#x6848;&#x662F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x8BED;&#x8A00;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x662F;&#x7684;&#xFF0C;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x548C;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x8BED;&#x8A00;&#x7684;&#x4EA4;&#x96C6;&#x59CB;&#x7EC8;&#x4F1A;&#x4EA7;&#x751F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x8BED;&#x8A00;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5176;&#x4E2D;L1&#x548C;L2&#x76F8;&#x540C;&#x4F46;&#x73B0;&#x5728;&#x8BA9;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> L =L1&#x2229;L2&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> L = {0 ^ n1 ^ n |</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> n&gt; = 0}&#x8FD9;&#x662F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x60A8;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x66F4;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5E76;&#x9A8C;&#x8BC1;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x548C;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x8BED;&#x8A00;&#x7684;&#x5E76;&#x96C6;&#x548C;&#x4EA4;&#x96C6;&#x603B;&#x662F;&#x4F1A;&#x4EA7;&#x751F;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x8BED;&#x8A00;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9605;&#x8BFB;&#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0; - <a href="https://www.geeksforgeeks.org/theory-of-computation-closure-properties-of-context-free-languages/" rel="noopener" target="_blank">&#x4E0A;&#x4E0B;&#x6587;&#x81EA;&#x7531;&#x8BED;&#x8A00;&#x7684;&#x95ED;&#x5305;&#x5C5E;&#x6027;</a></span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>