<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/13.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;|</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E92;&#x8054;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E92;&#x8054;&#x7F51;&#x7531;2&#x4E2A;&#x5B57;&#x7EC4;&#x6210;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x548C;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x6216;&#x7F51;&#x6BB5;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BE5;&#x8FDE;&#x63A5;&#x533A;&#x57DF;&#x5355;&#x5143;&#x901A;&#x8FC7;&#x7C7B;&#x4F3C;&#x4E8E;&#x8DEF;&#x7531;&#x5668;&#x6216;&#x7F51;&#x5173;&#x7684;&#x4E2D;&#x95F4;&#x8BBE;&#x5907;&#x5EFA;&#x7ACB;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x526F;&#x5B66;&#x58EB;&#x5B66;&#x4F4D;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7B2C;&#x4E00;&#x5B66;&#x671F;&#x662F;catenet&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x79CD;&#x4E92;&#x8FDE;&#x901A;&#x5E38;&#x5728;&#x516C;&#x5171;&#xFF0C;&#x79C1;&#x4EBA;&#xFF0C;&#x5546;&#x4E1A;&#xFF0C;&#x5DE5;&#x4E1A;&#x6216;&#x653F;&#x5E9C;&#x7F51;&#x7EDC;&#x4E4B;&#x95F4;&#x6216;&#x4E4B;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x526F;&#x5B66;&#x4F4D;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x662F;&#x7531;&#x4E2D;&#x95F4;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x8FDE;&#x63A5;&#x7684;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x5145;&#x5F53;&#x4E00;&#x4E2A;&#x5DE8;&#x578B;&#x7F51;&#x7EDC;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#x662F;&#x6307;&#x5E94;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x5236;&#x4F5C;&#x548C;&#x7BA1;&#x7406;&#x6311;&#x6218;&#x7684;&#x884C;&#x4E1A;&#xFF0C;&#x4EA7;&#x54C1;&#x548C;&#x7A0B;&#x5E8F;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x901A;&#x4FE1;&#xFF0C;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x6216;&#x9636;&#x6BB5;&#x90FD;&#x8BBE;&#x8BA1;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x534F;&#x8BAE;&#x6216;&#x901A;&#x4FE1;&#x903B;&#x8F91;&#xFF0C;&#x5373;&#x4F20;&#x8F93;&#x63A7;&#x5236;&#x534F;&#x8BAE;&#xFF08;TCP&#xFF09;&#x6216;&#x56E0;&#x7279;&#x7F51;&#x534F;&#x8BAE;&#xFF08;IP&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x65E6;&#x7F51;&#x7EDC;&#x4E0E;&#x5177;&#x6709;&#x4E0D;&#x65AD;&#x901A;&#x4FE1;&#x7A0B;&#x5E8F;&#x7684;&#x53E6;&#x4E00;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#xFF0C;&#x5B83;&#x5C31;&#x88AB;&#x79F0;&#x4E3A;&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E92;&#x8054;&#x7F51;&#x65E8;&#x5728;&#x89E3;&#x51B3;&#x901A;&#x8FC7;&#x8BB8;&#x591A;&#x94FE;&#x8DEF;&#x63D0;&#x4F9B;&#x4FE1;&#x606F;&#x5305;&#x7684;&#x95EE;&#x9898;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6269;&#x5C55;&#x7F51;&#x7EDC;&#x4E0E;&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7EC6;&#x5FAE;&#x5DEE;&#x522B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4EC5;&#x4EC5;&#x5229;&#x7528;&#x4EA4;&#x6362;&#x673A;&#x6216;&#x96C6;&#x7EBF;&#x5668;&#x6765;&#x8FDE;&#x63A5;2&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#x662F;LAN&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x800C;&#x901A;&#x8FC7;&#x8DEF;&#x7531;&#x5668;&#x8FDE;&#x63A5;&#x5B83;&#x4EEC;&#x662F;&#x56E0;&#x7279;&#x7F51;&#x5DE5;&#x4F5C;&#x7684;&#x76F8;&#x5173;&#x7A0B;&#x5EA6;&#x7684;&#x4F8B;&#x5B50;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;OSI-ISO&#x6A21;&#x578B;&#x7684;&#x7B2C;&#x4E09;&#x5C42;&#xFF08;&#x7F51;&#x7EDC;&#x5C42;&#xFF09;&#x4E2D;&#x5B9E;&#x65BD;&#x7F51;&#x7EDC;&#x4E92;&#x8FDE;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E92;&#x8054;&#x7F51;&#x4E3B;&#x8981;&#x6709;3&#x4E2A;&#x5355;&#x4F4D;&#xFF1A;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5916;&#x8054;&#x7F51;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5185;&#x90E8;&#x7F51;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E92;&#x8054;&#x7F51;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5185;&#x8054;&#x7F51;&#x548C;&#x5916;&#x8054;&#x7F51;&#x53EF;&#x80FD;&#x6709;&#x4E5F;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x6709;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF0C;&#x5219;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x6216;&#x5916;&#x8054;&#x7F51;&#x533A;&#x57DF;&#x5355;&#x5143;&#x901A;&#x5E38;&#x4E0D;&#x53D7;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#xFF08;&#x5982;&#x679C;&#x672A;&#x7ECF;&#x6388;&#x6743;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E0D;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x6216;&#x5916;&#x8054;&#x7F51;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x95E8;&#x6237;&#x7F51;&#x7AD9;&#xFF0C;&#x7528;&#x4E8E;&#x8BBF;&#x95EE;&#x90E8;&#x5206;&#x526F;&#x5B66;&#x58EB;&#x5B66;&#x4F4D;&#x5916;&#x8054;&#x7F51;&#x3002;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5916;&#x8054;&#x7F51; -</b>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x8303;&#x56F4;&#x53D7;&#x9650;&#x4E8E;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x6216;&#x5B9E;&#x4F53;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x65F6;&#x4E5F;&#x9650;&#x5236;&#x4E86;&#x4E0E;&#x4E00;&#x4E2A;&#x6216;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7F51;&#x7EDC;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5FC5;&#x9700;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x662F;&#x6700;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x6781;&#x5176;&#x4E2A;&#x4EBA;&#x5316;&#x7684;&#x533A;&#x57DF;&#x5185;&#x6267;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8F85;&#x52A9;&#x5B66;&#x4F4D;&#x5916;&#x8054;&#x7F51;&#x53EF;&#x4EE5;&#x53E6;&#x5916;&#x88AB;&#x5206;&#x7C7B;&#x4E3A;&#x4EBA;&#xFF0C;WAN&#x6216;&#x4E0D;&#x540C;&#x5F62;&#x5F0F;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#xFF0C;&#x5373;&#x5B83;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x5173;&#x8054;&#x5EA6;&#x5916;&#x90E8;&#x7F51;&#x7EDC;&#x7684;&#x53C2;&#x8003;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5185;&#x8054;&#x7F51; -</b>&#x8BE5;&#x526F;&#x5B66;&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x7EC4;&#x4E92;&#x8FDE;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x5229;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x534F;&#x8BAE;&#x5E76;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x4E8E;Web&#x6D4F;&#x89C8;&#x5668;&#x548C;FTP&#x5DE5;&#x5177;&#x7684;&#x57FA;&#x4E8E;IP&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x4F4D;&#x4E8E;&#x4E00;&#x4E2A;&#x4E3B;&#x4F53;&#x5B9E;&#x4F53;&#x7684;&#x7BA1;&#x7406;&#x4E4B;&#x4E0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BE5;&#x5B9E;&#x4F53;&#x5C06;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x5173;&#x95ED;&#x5230;&#x5730;&#x7403;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4E14;&#x4EC5;&#x5141;&#x8BB8;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6700;&#x5178;&#x578B;&#x7684;&#x662F;&#xFF0C;&#x8BE5;&#x7F51;&#x7EDC;&#x662F;&#x516C;&#x53F8;&#x6216;&#x4E0D;&#x540C;&#x4F01;&#x4E1A;&#x7684;&#x5185;&#x90E8;&#x7F51;&#x7EDC;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8D85;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x53EF;&#x6D4F;&#x89C8;&#x7684;&#x6570;&#x636E;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x4E92;&#x8054;&#x7F51; -</b>&#x9009;&#x62E9;&#x7684;&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#xFF0C;&#x5305;&#x62EC;&#x4E3B;&#x8981;&#x57FA;&#x4E8E;&#x9AD8;&#x7EA7;&#x5206;&#x6790;&#x7684;&#x653F;&#x5E9C;&#xFF0C;&#x5B66;&#x672F;&#xFF0C;&#x516C;&#x5171;&#x548C;&#x4E2A;&#x4EBA;&#x7F51;&#x7EDC;&#x7684;&#x5168;&#x7403;&#x4E92;&#x8054;&#xFF0C;&#x4EE3;&#x7406;&#x7F51;&#x7EDC;&#xFF08;ARPANET&#xFF09;&#x7531;&#x7F8E;&#x56FD;&#x56FD;&#x9632;&#x90E8;&#x7684;ARPA&#x5F00;&#x53D1;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E07;&#x7EF4;&#x7F51;&#xFF08; WWW&#xFF09;&#x5E76;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x4E92;&#x8054;&#x7F51;&#x201D;&#xFF0C;&#x4EE5;&#x533A;&#x522B;&#x4E8E;&#x6240;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x901A;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> Web&#x4E2D;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x6216;&#x5176;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x8005;&#x4F7F;&#x7528;&#x4ECE;&#x7BA1;&#x7406;&#x5206;&#x914D;&#x7684;&#x5730;&#x5740;&#x6CE8;&#x518C;&#x8868;&#x4E2D;&#x83B7;&#x53D6;&#x7684;IP&#x5730;&#x5740;&#x3002;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E92;&#x8054;&#x7F51;&#x5DF2;&#x7ECF;&#x53D1;&#x5C55;&#x6210;&#x4E3A;&#x51E0;&#x4E2A;&#x5173;&#x952E;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#xFF1A;&#x5B64;&#x7ACB;&#x7684;&#x5C40;&#x57DF;&#x7F51;&#xFF0C;&#x8D44;&#x6E90;&#x7684;&#x91CD;&#x590D;&#x4EE5;&#x53CA;&#x7F3A;&#x4E4F;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9694;&#x79BB;&#x7684;LAN&#x5728;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x6216;&#x90E8;&#x95E8;&#x4E4B;&#x95F4;&#x4EA7;&#x751F;&#x4F20;&#x8F93;&#x95EE;&#x9898;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8D44;&#x6E90;&#x7684;&#x91CD;&#x590D;&#x610F;&#x5473;&#x7740;&#x5FC5;&#x987B;&#x4E3A;&#x6BCF;&#x4E2A;&#x5DE5;&#x4F5C;&#x573A;&#x6240;&#x6216;&#x90E8;&#x95E8;&#x63D0;&#x4F9B;&#x4E0D;&#x65AD;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x652F;&#x6301;&#x5458;&#x5DE5;&#x4E00;&#x6837;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F3A;&#x4E4F;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x5B58;&#x5728;&#x7BA1;&#x7406;&#x548C;&#x6392;&#x9664;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x7684;&#x96C6;&#x4E2D;&#x65B9;&#x6CD5;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E92;&#x8FDE;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x901A;&#x5E38;&#x53D1;&#x751F;&#x5728;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x7684;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x4F01;&#x4E1A;&#x4E4B;&#x95F4;&#xFF0C;&#x5373;&#x4F4E;&#x4E8E;TCP / IP&#x903B;&#x8F91;&#x63A5;&#x53E3;&#x6570;&#x91CF;&#x7684;&#x4EE5;&#x786C;&#x4EF6;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x5C42;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x79CD;&#x4E92;&#x8FDE;&#x662F;&#x901A;&#x8FC7;&#x7F51;&#x6865;&#x548C;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;&#x5B8C;&#x6210;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x901A;&#x5E38;&#x88AB;&#x9519;&#x8BEF;&#x5730;&#x79F0;&#x4E3A;&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x968F;&#x540E;&#x7684;&#x7CFB;&#x7EDF;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x5355;&#x4E2A;&#x5B50;&#x7F51;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x9700;&#x8981;&#x7C7B;&#x4F3C;&#x4E8E;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x6765;&#x904D;&#x5386;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x800C;&#xFF0C;&#x4E00;&#x4E2A;&#x7535;&#x5B50;&#x7F51;&#x7EDC;&#x4E5F;&#x901A;&#x8FC7;&#x5C06;&#x7F51;&#x7EDC;&#x5206;&#x6210;&#x51E0;&#x4E2A;&#x9636;&#x6BB5;&#x5E76;&#x5728;&#x903B;&#x8F91;&#x4E0A;&#x5C06;&#x8DEF;&#x6BB5;&#x6D41;&#x91CF;&#x4E0E;&#x8DEF;&#x7531;&#x5668;&#x5206;&#x5F00;&#x6765;&#x91CD;&#x65B0;&#x6210;&#x4E3A;&#x526F;&#x5B66;&#x4F4D;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E92;&#x8054;&#x7F51;&#x534F;&#x8BAE;&#x65E8;&#x5728;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x63D0;&#x4F9B;&#x5173;&#x8054;&#x5EA6;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x5206;&#x7EC4;&#x670D;&#x52A1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BE5;&#x8BBE;&#x8BA1;&#x907F;&#x514D;&#x4E86;&#x4E2D;&#x95F4;&#x7F51;&#x7EDC;&#x7EC4;&#x4EF6;&#x7EF4;&#x62A4;&#x7F51;&#x7EDC;&#x7684;&#x4EFB;&#x4F55;&#x72B6;&#x6001;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x76F8;&#x53CD;&#xFF0C;&#x6B64;&#x4EFB;&#x52A1;&#x88AB;&#x5206;&#x914D;&#x7ED9;&#x6BCF;&#x4E2A;&#x901A;&#x4FE1;&#x4F1A;&#x8BDD;&#x7684;&#x7AEF;&#x70B9;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3A;&#x4E86;&#x6B63;&#x786E;&#x4F20;&#x8F93;&#x4FE1;&#x606F;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x5173;&#x8054;&#x5EA6;&#x53EF;&#x5E94;&#x7528;&#x7684;&#x4F20;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x4F20;&#x8F93;&#x7BA1;&#x7406;&#x534F;&#x8BAE;&#xFF08;TCP&#xFF09;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x53EF;&#x9760;&#x7684;&#x6D41;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x67D0;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x8F83;&#x4E0D;&#x590D;&#x6742;&#x7684;&#x65E0;&#x8FDE;&#x63A5;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF08;&#x7528;&#x6237;&#x6570;&#x636E;&#x62A5;&#x534F;&#x8BAE;&#xFF08;UDP&#xFF09;&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x4E0D;&#x9700;&#x8981;&#x53EF;&#x9760;&#x7684;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x6216;&#x9700;&#x8981;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x670D;&#x52A1;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x89C6;&#x9891;&#x6D41;&#x6216;&#x8BED;&#x97F3;&#x804A;&#x5929;&#x3002;</span> </p><h3 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x5BFB;&#x5740; - </span> </h3><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x5206;&#x522B;&#x5EFA;&#x7ACB;&#x8BBE;&#x5907;&#x6216;&#x6210;&#x4E3A;&#x4E00;&#x7EC4;&#x6210;&#x5458;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BFB;&#x5740;&#x65B9;&#x6848;&#x6839;&#x636E;&#x534F;&#x8BAE;&#x65CF;&#x548C;OSI&#x5C42;&#x800C;&#x4E0D;&#x540C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x4E09;&#x79CD;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x5355;&#x5143;&#xFF1A;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5730;&#x5740;&#xFF0C;&#x5A92;&#x4F53;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF08;MAC&#xFF09;&#x5730;&#x5740;&#x548C;&#x7F51;&#x7EDC;&#x5C42;&#x5730;&#x5740;&#x3002;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5730;&#x5740;&#xFF1A;</b>&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5730;&#x5740;&#x660E;&#x786E;&#x5730;&#x6807;&#x8BC6;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x7684;&#x6BCF;&#x4E2A;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#x5173;&#x8054;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5730;&#x5740;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x7269;&#x7406;&#x6216;&#x786C;&#x4EF6;&#x5730;&#x5740;&#x7684;&#x533A;&#x57DF;&#x5355;&#x5143;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5730;&#x5740;&#x6709;&#x65F6;&#x5B58;&#x5728;&#x4E8E;&#x5E73;&#x5766;&#x5730;&#x5740;&#x533A;&#x57DF;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#x6240;&#x9009;&#x8BBE;&#x5907;&#x5177;&#x6709;&#x9884;&#x5148;&#x5EFA;&#x7ACB;&#x4E14;&#x901A;&#x5E38;&#x7D27;&#x56FA;&#x7684;&#x5173;&#x7CFB;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7EC8;&#x7AEF;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#x5173;&#x8054;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x94FE;&#x63A5;&#x5730;&#x5740;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8DEF;&#x7531;&#x5668;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x7EDC;&#x4E92;&#x8FDE;&#x8BBE;&#x5907;&#x901A;&#x5E38;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x7EC8;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5730;&#x5740;&#x3002;</span> </li><p></p><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>MAC&#x5730;&#x5740;&#xFF1A;</b>&#x5A92;&#x4F53;&#x8BBF;&#x95EE;&#x7BA1;&#x7406;&#xFF08;MAC&#xFF09;&#x5730;&#x5740;&#x5305;&#x542B;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5730;&#x5740;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> MAC&#x5730;&#x5740;&#x5728;LAN&#x4E2D;&#x5EFA;&#x7ACB;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x7684;IEEE MAC&#x5730;&#x5740;&#x7684;&#x7F51;&#x7EDC;&#x5B9E;&#x4F53;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> MAC&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#x63A5;&#x53E3;&#x533A;&#x522B;&#x5730;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x57DF;&#x5355;&#x5143;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> MAC&#x5730;&#x5740;&#x957F;&#x5EA6;&#x4E3A;48&#x4F4D;&#xFF0C;&#x4EE5;&#x5341;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x793A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x5E38;&#x7531;IEEE&#x7BA1;&#x7406;&#x7684;&#x521D;&#x7EA7;&#x534A;&#x6253;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x5EFA;&#x7ACB;&#x5236;&#x9020;&#x5546;&#x6216;&#x5546;&#x5BB6;&#xFF0C;&#x56E0;&#x6B64;&#x5305;&#x62EC;&#x7EC4;&#x7EC7;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7B26;&#xFF08;OUI&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x540E;&#x516D;&#x4E2A;&#x4F4D;&#x7F6E;&#x7B26;&#x53F7;&#x6570;&#x5B57;&#x5305;&#x62EC;&#x754C;&#x9762;&#x5E8F;&#x5217;&#x53D8;&#x4F53;&#x6216;&#x7531;&#x7279;&#x5B9A;&#x5546;&#x5BB6;&#x7BA1;&#x7406;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4EF7;&#x683C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> MAC&#x5730;&#x5740;&#x901A;&#x5E38;&#x662F;&#x7531;&#x4E8E;&#x70E7;&#x5165;&#x53EA;&#x8BFB;&#x5B58;&#x50A8;&#x5668;&#xFF08;ROM&#xFF09;&#x800C;&#x88AB;&#x79F0;&#x4E3A;&#x70E7;&#x5165;&#x5730;&#x5740;&#xFF08;BIA&#xFF09;&#x7684;&#x533A;&#x57DF;&#x5355;&#x5143;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x65E6;&#x63A5;&#x53E3;&#x5361;&#x521D;&#x59CB;&#x5316;&#x5C31;&#x88AB;&#x8DDF;&#x8E2A;&#x5230;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#xFF08;RAM&#xFF09;&#x4E2D;&#x3002;</span> </li><p></p><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x7F51;&#x7EDC;&#x5C42;&#x5730;&#x5740;&#xFF1A;</b>&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x6709;&#x65F6;&#x5B58;&#x5728;&#x4E8E;&#x53EF;&#x5206;&#x7EA7;&#x5730;&#x5740;&#x533A;&#x57DF;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x662F;&#x79F0;&#x4E3A;&#x865A;&#x62DF;&#x6216;&#x903B;&#x8F91;&#x5730;&#x5740;&#x7684;&#x533A;&#x57DF;&#x5355;&#x5143;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x548C;&#x5DE5;&#x5177;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x662F;&#x903B;&#x8F91;&#x548C;&#x4E0D;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x4F9D;&#x8D56;&#x4E8E;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#x7279;&#x5F81;&#x6216;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7269;&#x7406;&#x57FA;&#x7840;&#x7684;&#x5206;&#x7EC4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B8C;&#x6210;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x5C42;&#x5730;&#x5740;&#x7528;&#x4E8E;&#x5B83;&#x4EEC;&#x652F;&#x6301;&#x7684;&#x6BCF;&#x4E2A;&#x7F51;&#x7EDC;&#x5C42;&#x534F;&#x8BAE;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#x4E8E;&#x652F;&#x6301;&#x7684;&#x6BCF;&#x4E2A;&#x7F51;&#x7EDC;&#x5C42;&#x534F;&#x8BAE;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x6BCF;&#x4E2A;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#x5173;&#x8054;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x5C42;&#x5730;&#x5740;&#x3002;</span> </li></ol><h3 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#x7684;&#x6311;&#x6218; - </span> </h3><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B9E;&#x65BD;&#x6709;&#x7528;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x5E76;&#x4E0D;&#x786E;&#x5B9A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6709;&#x51E0;&#x4E2A;&#x5177;&#x6709;&#x6311;&#x6218;&#x6027;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x8FDE;&#x901A;&#x6027;&#xFF0C;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x548C;&#x9002;&#x5E94;&#x6027;&#x65B9;&#x9762;&#xFF0C;&#x6BCF;&#x4E2A;&#x7A7A;&#x95F4;&#x5BF9;&#x4E8E;&#x5EFA;&#x7ACB;&#x526F;&#x5B66;&#x58EB;&#x5B66;&#x4F4D;&#x7ECF;&#x6D4E;&#x548C;&#x6709;&#x6548;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5176;&#x4E2D;&#x5F88;&#x5C11;&#x662F;&#xFF1A; - </span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6700;&#x521D;&#x7684;&#x6311;&#x6218;&#x5728;&#x4E8E;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x8FDE;&#x63A5;&#x4F17;&#x591A;&#x7CFB;&#x7EDF;&#x4EE5;&#x652F;&#x6301;&#x4E0D;&#x540C;&#x6280;&#x672F;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F8B;&#x5982;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x7AD9;&#x70B9;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5A92;&#x4F53;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4EE5;&#x53EF;&#x53D8;&#x901F;&#x5EA6;&#x8FD0;&#x884C;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x5E94;&#x8BE5;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x4E2D;&#x7EF4;&#x62A4;&#x7684;&#x53EF;&#x9760;&#x670D;&#x52A1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E2A;&#x4EBA;&#x7528;&#x6237;&#x548C;&#x6574;&#x4E2A;&#x7EC4;&#x7EC7;&#x4F9D;&#x8D56;&#x4E8E;&#x5BF9;&#x7F51;&#x7EDC;&#x8D44;&#x6E90;&#x7684;&#x4E00;&#x81F4;&#xFF0C;&#x53EF;&#x9760;&#x7684;&#x8BBF;&#x95EE;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5E94;&#x8BE5;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x4E2D;&#x63D0;&#x4F9B;&#x96C6;&#x4E2D;&#x652F;&#x6301;&#x5173;&#x8054;&#x7684;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x6392;&#x9664;&#x529F;&#x80FD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5E94;&#x5145;&#x5206;&#x89E3;&#x51B3;&#x914D;&#x7F6E;&#xFF0C;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x6027;&#x80FD;&#x548C;&#x4E0D;&#x540C;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E92;&#x8054;&#x7F51;&#x5DE5;&#x4F5C;&#x6E38;&#x6CF3;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#xFF0C;&#x5BF9;&#x4E8E;&#x7F51;&#x7EDC;&#x6269;&#x5927;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x56E0;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x65B0;&#x5E94;&#x7528;&#x548C;&#x670D;&#x52A1;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://en.wikipedia.org/wiki/Internetworking" rel="noopener" target="_blank">&#x7F51;&#x7EDC;&#x4E92;&#x8054; - &#x7EF4;&#x57FA;</a></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://userpages.uni-koblenz.de/~ros/Rechnerorganisation/internetworking.pdf" rel="noopener" target="_blank">&#x7F51;&#x7EDC;&#x4E92;&#x8054;&#x7B80;&#x4ECB;</a></span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><hr><hr><!-- .entry-meta --></div></body></html>