<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/139.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F7F;&#x7528;Python&#x7684;&#x7B80;&#x5355;&#x804A;&#x5929;&#x5BA4;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x672C;&#x6587;&#x6F14;&#x793A; - &#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x804A;&#x5929;&#x5BA4;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x811A;&#x672C;&#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BE5;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x5957;&#x63A5;&#x5B57;&#x548C;&#x7EBF;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#x3002;</span> </p><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5957;&#x63A5;&#x5B57;&#x7F16;&#x7A0B;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5957;&#x63A5;&#x5B57;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x53CC;&#x5411;&#x901A;&#x4FE1;&#x4FE1;&#x9053;&#x4E2D;&#x7684;&#x7AEF;&#x70B9;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x670D;&#x52A1;&#x5668;&#x548C;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x901A;&#x4FE1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6BCF;&#x7AEF;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x5141;&#x8BB8;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x5668;&#x4E0E;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x5C06;&#x81EA;&#x8EAB;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x67D0;&#x4E2A;&#x786C;&#x4EF6;&#x7AEF;&#x53E3;&#x5173;&#x8054;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5177;&#x6709;&#x4E0E;&#x540C;&#x4E00;&#x7AEF;&#x53E3;&#x5173;&#x8054;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x7684;&#x4EFB;&#x4F55;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x53EF;&#x4EE5;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x901A;&#x4FE1;&#x3002;</span> </p><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x591A;&#x7EBF;&#x7A0B;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7EBF;&#x7A0B;&#x662F;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B83;&#x5206;&#x522B;&#x8FD0;&#x884C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7684;&#x4E00;&#x7EC4;&#x547D;&#x4EE4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x6B21;&#x7528;&#x6237;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x4E3A;&#x8BE5;&#x7528;&#x6237;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x901A;&#x4FE1;&#x5C06;&#x6839;&#x636E;&#x4E3A;&#x4E86;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8EAB;&#x4EFD;&#x800C;&#x521B;&#x5EFA;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x5BF9;&#x8C61;&#x6CBF;&#x7740;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6211;&#x4EEC;&#x5C06;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x811A;&#x672C;&#x6765;&#x5EFA;&#x7ACB;&#x8FD9;&#x4E2A;&#x804A;&#x5929;&#x5BA4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x4FDD;&#x6301;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x8FD0;&#x884C;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x4EE5;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x811A;&#x672C;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x811A;&#x672C;&#x5C06;&#x5C1D;&#x8BD5;&#x5EFA;&#x7ACB;&#x5957;&#x63A5;&#x5B57;&#x5E76;&#x5C06;&#x5176;&#x7ED1;&#x5B9A;&#x5230;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x7684;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#xFF08;Windows&#x7528;&#x6237;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x5728;&#x5176;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x7F6E;&#x4E2D;&#x5BF9;&#x6307;&#x5B9A;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x8FDB;&#x884C;&#x4F8B;&#x5916;&#x5904;&#x7406;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x7AEF;&#x53E3;&#x662F;&#x5DF2;&#x7ECF;&#x5F00;&#x653E;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x540E;&#xFF0C;&#x811A;&#x672C;&#x5C06;&#x4FDD;&#x6301;&#x6253;&#x5F00;&#x72B6;&#x6001;&#x5E76;&#x63A5;&#x6536;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x5C06;&#x76F8;&#x5E94;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x5BF9;&#x8C61;&#x9644;&#x52A0;&#x5230;&#x5217;&#x8868;&#x4EE5;&#x8DDF;&#x8E2A;&#x6D3B;&#x52A8;&#x8FDE;&#x63A5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6BCF;&#x6B21;&#x7528;&#x6237;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5C06;&#x4E3A;&#x8BE5;&#x7528;&#x6237;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7B49;&#x5F85;&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7ED9;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x804A;&#x5929;&#x7684;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x5728;&#x5C1D;&#x8BD5;&#x4ECE;&#x7279;&#x5B9A;&#x7EBF;&#x7A0B;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x65F6;&#x9047;&#x5230;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x5C06;&#x9000;&#x51FA;&#x8BE5;&#x7EBF;&#x7A0B;&#x3002;</span> </p><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7528;&#x6CD5;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x673A;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8BE5;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4E13;&#x7528;IP&#x5730;&#x5740;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x5668;IP&#x5730;&#x5740;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5C40;&#x57DF;&#x7F51;&#x4E0A;&#x8BBE;&#x7F6E;&#x6B64;&#x670D;&#x52A1;&#x5668;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5C40;&#x57DF;&#x7F51;&#x5177;&#x6709;&#x4E00;&#x7EC4;&#x5206;&#x914D;&#x7684;&#x8303;&#x56F4;&#x4ECE;192.168.1.2&#x5230;192.168.1.100&#x7684;&#x79C1;&#x6709;IP&#x5730;&#x5740;&#xFF0C;&#x5219;&#x6765;&#x81EA;&#x8FD9;99&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x53EF;&#x4EE5;&#x5145;&#x5F53;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5176;&#x4F59;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x65B9;&#x5F0F;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#xFF1A;&#x4F7F;&#x7528;&#x670D;&#x52A1;&#x5668;&#x7684;&#x79C1;&#x6709;IP&#x5730;&#x5740;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5FC5;&#x987B;&#x6CE8;&#x610F;&#x9009;&#x62E9;&#x5F53;&#x524D;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x7AEF;&#x53E3;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F8B;&#x5982;&#xFF0C;&#x7AEF;&#x53E3;22&#x662F;ssh&#x7684;&#x9ED8;&#x8BA4;&#x7AEF;&#x53E3;&#xFF0C;&#x7AEF;&#x53E3;80&#x662F;HTTP&#x534F;&#x8BAE;&#x7684;&#x9ED8;&#x8BA4;&#x7AEF;&#x53E3;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x6216;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x8FD9;&#x4E24;&#x4E2A;&#x7AEF;&#x53E3;&#x4EE5;&#x4F7F;&#x5176;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x4F7F;&#x7528;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5728;&#x672C;&#x5730;&#x7F51;&#x7EDC;&#x4E4B;&#x5916;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x516C;&#x5171;IP&#x5730;&#x5740;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x6765;&#x81EA;&#x672C;&#x5730;&#x7F51;&#x7EDC;&#x7684;&#x8282;&#x70B9;&#xFF08;&#x4E0D;&#x662F;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x8282;&#x70B9;&#xFF09;&#x5E0C;&#x671B;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x7AEF;&#x53E3;&#x8F6C;&#x53D1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6C42;&#x5C06;&#x6765;&#x5230;&#x516C;&#x5171;IP&#x5730;&#x5740;&#x7684;&#x4EFB;&#x4F55;&#x8BF7;&#x6C42;&#x91CD;&#x65B0;&#x8DEF;&#x7531;&#x5230;&#x6211;&#x4EEC;&#x672C;&#x5730;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x79C1;&#x6709;IP&#x5730;&#x5740;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x7AEF;&#x53E3;&#x8F6C;&#x53D1;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6709;&#x5173;&#x7AEF;&#x53E3;&#x8F6C;&#x53D1;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF1A; <a href="https://en.wikipedia.org/wiki/Port_forwarding" target="_blank">&#x94FE;&#x63A5;</a></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8981;&#x8FD0;&#x884C;&#x8BE5;&#x811A;&#x672C;&#xFF0C;&#x53EA;&#x9700;&#x4ECE;&#x5E16;&#x5B50;&#x5E95;&#x90E8;&#x6307;&#x5B9A;&#x7684;GitHub&#x94FE;&#x63A5;&#x4E0B;&#x8F7D;&#x5B83;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4FDD;&#x5B58;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x65B9;&#x4FBF;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</span> </p><pre> <span class="pre-span" style="direction: ltr; text-align: left">/* Both the server and client script can then be run</span>
   <span class="pre-span" style="direction: ltr; text-align: left">from the Command prompt (in Windows) or from bash</span> 
   <span class="pre-span" style="direction: ltr; text-align: left">Terminal (Linux users) by simply typing</span> 
   <span class="pre-span" style="direction: ltr; text-align: left">&quot;python chat_server.py &quot; or &quot;python client.py &quot;.</span> 
   <span class="pre-span" style="direction: ltr; text-align: left">For example, */</span>
<span class="pre-span" style="direction: ltr; text-align: left">python chat_server.py 192.168.55.13 8081</span>
<span class="pre-span" style="direction: ltr; text-align: left">python client.py 192.168.55.13 8081</span> </pre><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E0B;&#x9762;&#x662F;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x811A;&#x672C;&#xFF0C;&#x5FC5;&#x987B;&#x59CB;&#x7EC8;&#x8FD0;&#x884C;&#x4EE5;&#x4FDD;&#x6301;&#x804A;&#x5929;&#x5BA4;&#x8FD0;&#x884C;&#x3002;</span> </p>
<pre class="brush: python; title: ; notranslate" title=""># Python program to implement server side of chat room.
import socket
import select
import sys
from thread import *

&quot;&quot;&quot;The first argument AF_INET is the address domain of the
socket. This is used when we have an Internet Domain with
any two hosts The second argument is the type of socket.
SOCK_STREAM means that data or characters are read in
a continuous flow.&quot;&quot;&quot;
server = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
server.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, 1)

# checks whether sufficient arguments have been provided
if len(sys.argv) != 3:
    print &quot;Correct usage: script, IP address, port number&quot;
    exit()

# takes the first argument from command prompt as IP address
IP_address = str(sys.argv[1])

# takes second argument from command prompt as port number
Port = int(sys.argv[2])

&quot;&quot;&quot;
binds the server to an entered IP address and at the
specified port number.
The client must be aware of these parameters
&quot;&quot;&quot;
server.bind((IP_address, Port))

&quot;&quot;&quot;
listens for 100 active connections. This number can be
increased as per convenience.
&quot;&quot;&quot;
server.listen(100)

list_of_clients = []

def clientthread(conn, addr):

    # sends a message to the client whose user object is conn
    conn.send(&quot;Welcome to this chatroom!&quot;)

    while True:
            try:
                message = conn.recv(2048)
                if message:

                    &quot;&quot;&quot;prints the message and address of the
                    user who just sent the message on the server
                    terminal&quot;&quot;&quot;
                    print &quot;&lt;&quot; + addr[0] + &quot;&gt; &quot; + message

                    # Calls broadcast function to send message to all
                    message_to_send = &quot;&lt;&quot; + addr[0] + &quot;&gt; &quot; + message
                    broadcast(message_to_send, conn)

                else:
                    &quot;&quot;&quot;message may have no content if the connection
                    is broken, in this case we remove the connection&quot;&quot;&quot;
                    remove(conn)

            except:
                continue

&quot;&quot;&quot;Using the below function, we broadcast the message to all
clients who&apos;s object is not the same as the one sending
the message &quot;&quot;&quot;
def broadcast(message, connection):
    for clients in list_of_clients:
        if clients!=connection:
            try:
                clients.send(message)
            except:
                clients.close()

                # if the link is broken, we remove the client
                remove(clients)

&quot;&quot;&quot;The following function simply removes the object
from the list that was created at the beginning of 
the program&quot;&quot;&quot;
def remove(connection):
    if connection in list_of_clients:
        list_of_clients.remove(connection)

while True:

    &quot;&quot;&quot;Accepts a connection request and stores two parameters, 
    conn which is a socket object for that user, and addr 
    which contains the IP address of the client that just 
    connected&quot;&quot;&quot;
    conn, addr = server.accept()

    &quot;&quot;&quot;Maintains a list of clients for ease of broadcasting
    a message to all available people in the chatroom&quot;&quot;&quot;
    list_of_clients.append(conn)

    # prints the address of the user that just connected
    print addr[0] + &quot; connected&quot;

    # creates and individual thread for every user 
    # that connects
    start_new_thread(clientthread,(conn,addr))    

conn.close()
server.close()
</pre><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5BA2;&#x6237;&#x7AEF;&#x811A;&#x672C;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BA2;&#x6237;&#x7AEF;&#x811A;&#x672C;&#x5C06;&#x53EA;&#x662F;&#x5C1D;&#x8BD5;&#x8BBF;&#x95EE;&#x5728;&#x6307;&#x5B9A;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x521B;&#x5EFA;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x65E6;&#x8FDE;&#x63A5;&#xFF0C;&#x5B83;&#x5C06;&#x4E0D;&#x65AD;&#x68C0;&#x67E5;&#x8F93;&#x5165;&#x662F;&#x6765;&#x81EA;&#x670D;&#x52A1;&#x5668;&#x8FD8;&#x662F;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5E76;&#x76F8;&#x5E94;&#x5730;&#x91CD;&#x5B9A;&#x5411;&#x8F93;&#x51FA;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x8F93;&#x5165;&#x6765;&#x81EA;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5B83;&#x5C06;&#x5728;&#x7EC8;&#x7AEF;&#x4E0A;&#x663E;&#x793A;&#x6D88;&#x606F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x8F93;&#x5165;&#x6765;&#x81EA;&#x7528;&#x6237;&#xFF0C;&#x5219;&#x5B83;&#x5C06;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x5176;&#x5E7F;&#x64AD;&#x7ED9;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x811A;&#x672C;&#xFF0C;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x8BE5;&#x811A;&#x672C;&#x624D;&#x80FD;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;</span> </p><pre class="brush: python; title: ; notranslate" title=""># Python program to implement client side of chat room.
import socket
import select
import sys

server = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
if len(sys.argv) != 3:
    print &quot;Correct usage: script, IP address, port number&quot;
    exit()
IP_address = str(sys.argv[1])
Port = int(sys.argv[2])
server.connect((IP_address, Port))

while True:

    # maintains a list of possible input streams
    sockets_list = [sys.stdin, server]

    &quot;&quot;&quot; There are two possible input situations. Either the
    user wants to give  manual input to send to other people,
    or the server is sending a message  to be printed on the
    screen. Select returns from sockets_list, the stream that
    is reader for input. So for example, if the server wants
    to send a message, then the if condition will hold true
    below.If the user wants to send a message, the else
    condition will evaluate as true&quot;&quot;&quot;
    read_sockets,write_socket, error_socket = select.select(sockets_list,[],[])

    for socks in read_sockets:
        if socks == server:
            message = socks.recv(2048)
            print message
        else:
            message = sys.stdin.readline()
            server.send(message)
            sys.stdout.write(&quot;&lt;You&gt;&quot;)
            sys.stdout.write(message)
            sys.stdout.flush()
server.close()
</pre><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8F93;&#x51FA;&#xFF1A;&#x5728;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x7684;&#x56FE;&#x7247;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5DF2;&#x5728;&#x7EC8;&#x7AEF;&#x7684;&#x5DE6;&#x4FA7;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x811A;&#x672C;&#x5728;&#x7EC8;&#x7AEF;&#x7684;&#x53F3;&#x4FA7;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> &#xFF08;&#x4F7F;&#x7528;tmux&#x5B8C;&#x6210;&#x7EC8;&#x7AEF;&#x7684;&#x62C6;&#x5206;&#xFF0C;&apos;sudo apt-get install tmux&apos;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x51FA;&#x4E8E;&#x521D;&#x59CB;&#x5316;&#x76EE;&#x7684;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x7528;&#x6237;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x6D88;&#x606F;&#x4EE5;&#x53CA;IP&#x5730;&#x5740;&#x90FD;&#x663E;&#x793A;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x3002;</span> <br> <a href="http://cdncontribute.geeksforgeeks.org/wp-content/uploads/Screenshot-from-2017-04-18-18-31-03.png"><img class="aligncenter size-full wp-image-173649" src="../../../imgs/net/4ba9bb4a788d9682a947fc71352b16c0.jpg" alt="&#x622A;&#x56FE;2017-04-18 18-31-03" width="1920" height="1080"></a> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E0B;&#x56FE;&#x5728;&#x540C;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x4E86;&#x57FA;&#x672C;&#x5BF9;&#x8BDD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF01;</span> <br> <a href="http://cdncontribute.geeksforgeeks.org/wp-content/uploads/Screenshot-from-2017-04-18-18-31-03.png"><img class="aligncenter size-full wp-image-173649" src="../../../imgs/net/4ba9bb4a788d9682a947fc71352b16c0.jpg" alt="&#x622A;&#x56FE;2017-04-18 18-31-03" width="1920" height="1080"></a> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x94FE;&#x63A5;&#x5230;&#x4E0B;&#x8F7D;&#x811A;&#x672C;&#xFF1A; <a href="https://github.com/dvatsav/Chat-Room-server" target="_blank">&#x94FE;&#x63A5;</a></span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>