<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/157.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#xFF08;&#x96C6;&#x7EBF;&#x5668;&#xFF0C;&#x4E2D;&#x7EE7;&#x5668;&#xFF0C;&#x6865;&#x63A5;&#x5668;&#xFF0C;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x7F51;&#x5173;&#x548C;Brouter&#xFF09;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>1.&#x4E2D;&#x7EE7;&#x5668;</strong> - &#x4E2D;&#x7EE7;&#x5668;&#x5728;&#x7269;&#x7406;&#x5C42;&#x64CD;&#x4F5C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x5728;&#x4FE1;&#x53F7;&#x53D8;&#x5F97;&#x592A;&#x5F31;&#x6216;&#x635F;&#x574F;&#x4E4B;&#x524D;&#x5728;&#x540C;&#x4E00;&#x7F51;&#x7EDC;&#x4E0A;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x4FE1;&#x53F7;&#xFF0C;&#x4EE5;&#x4FBF;&#x5EF6;&#x957F;&#x4FE1;&#x53F7;&#x5728;&#x540C;&#x4E00;&#x7F51;&#x7EDC;&#x4E0A;&#x4F20;&#x8F93;&#x7684;&#x957F;&#x5EA6;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5173;&#x4E8E;&#x4E2D;&#x7EE7;&#x5668;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x653E;&#x5927;&#x4FE1;&#x53F7;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x4FE1;&#x53F7;&#x53D8;&#x5F31;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x9010;&#x4F4D;&#x590D;&#x5236;&#x4FE1;&#x53F7;&#x5E76;&#x4EE5;&#x539F;&#x59CB;&#x5F3A;&#x5EA6;&#x518D;&#x751F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x662F;&#x4E00;&#x4E2A;2&#x7AEF;&#x53E3;&#x8BBE;&#x5907;&#x3002;</span> </p><p></p><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>2.&#x96C6;&#x7EBF;&#x5668;</strong> - &#x96C6;&#x7EBF;&#x5668;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x7AEF;&#x53E3;&#x4E2D;&#x7EE7;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x96C6;&#x7EBF;&#x5668;&#x8FDE;&#x63A5;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x5206;&#x652F;&#x7684;&#x591A;&#x6761;&#x7EBF;&#x8DEF;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x8FDE;&#x63A5;&#x4E0D;&#x540C;&#x7AD9;&#x70B9;&#x7684;&#x661F;&#x5F62;&#x62D3;&#x6251;&#x4E2D;&#x7684;&#x8FDE;&#x63A5;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x96C6;&#x7EBF;&#x5668;&#x65E0;&#x6CD5;&#x8FC7;&#x6EE4;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x5305;&#x5C06;&#x53D1;&#x9001;&#x5230;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x7684;&#x8BBE;&#x5907;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x901A;&#x8FC7;Hub&#x8FDE;&#x63A5;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x673A;&#x7684;<a href="https://en.wikipedia.org/wiki/Collision_domain">&#x51B2;&#x7A81;&#x57DF;</a>&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B64;&#x5916;&#xFF0C;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x667A;&#x80FD;&#x627E;&#x5230;&#x6570;&#x636E;&#x5305;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#xFF0C;&#x5BFC;&#x81F4;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#x548C;&#x6D6A;&#x8D39;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x67A2;&#x7EBD;&#x7684;&#x7C7B;&#x578B;</strong></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>Active Hub&#xFF1A; -</strong>&#x8FD9;&#x4E9B;&#x96C6;&#x7EBF;&#x5668;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x6E90;&#xFF0C;&#x53EF;&#x4EE5;&#x6E05;&#x7406;&#xFF0C;&#x589E;&#x5F3A;&#x548C;&#x4E2D;&#x7EE7;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4FE1;&#x53F7;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x65E2;&#x53EF;&#x4F5C;&#x4E3A;&#x4E2D;&#x7EE7;&#x5668;&#xFF0C;&#x4E5F;&#x53EF;&#x4F5C;&#x4E3A;&#x5E03;&#x7EBF;&#x4E2D;&#x5FC3;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E9B;&#x7528;&#x4E8E;&#x6269;&#x5C55;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6700;&#x5927;&#x8DDD;&#x79BB;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x65E0;&#x6E90;&#x96C6;&#x7EBF;&#x5668;&#xFF1A; -</strong>&#x8FD9;&#x4E9B;&#x96C6;&#x7EBF;&#x5668;&#x6536;&#x96C6;&#x6765;&#x81EA;&#x8282;&#x70B9;&#x7684;&#x7535;&#x7EBF;&#x548C;&#x6765;&#x81EA;&#x6D3B;&#x52A8;&#x96C6;&#x7EBF;&#x5668;&#x7684;&#x7535;&#x6E90;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E9B;&#x96C6;&#x7EBF;&#x5668;&#x5C06;&#x4FE1;&#x53F7;&#x4E2D;&#x7EE7;&#x5230;&#x7F51;&#x7EDC;&#x4E0A;&#xFF0C;&#x65E0;&#x9700;&#x6E05;&#x7406;&#x548C;&#x589E;&#x5F3A;&#x5B83;&#x4EEC;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x6269;&#x5C55;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x3002;</span> </li></ul><p></p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>3.&#x7F51;&#x6865;</strong> - &#x7F51;&#x6865;&#x5728;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x8FD0;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x6865;&#x662F;&#x8F6C;&#x53D1;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x8BFB;&#x53D6;&#x6E90;&#x548C;&#x76EE;&#x6807;&#x7684;MAC&#x5730;&#x5740;&#x6765;&#x6DFB;&#x52A0;&#x8FC7;&#x6EE4;&#x5185;&#x5BB9;&#x7684;&#x529F;&#x80FD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x8FD8;&#x7528;&#x4E8E;&#x4E92;&#x8FDE;&#x4E24;&#x4E2A;&#x5DE5;&#x4F5C;&#x5728;&#x540C;&#x4E00;&#x534F;&#x8BAE;&#x4E0A;&#x7684;LAN&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x5177;&#x6709;&#x5355;&#x8F93;&#x5165;&#x548C;&#x5355;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x53CC;&#x7AEF;&#x53E3;&#x8BBE;&#x5907;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6865;&#x6881;&#x7684;&#x7C7B;&#x578B;</strong></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x900F;&#x660E;&#x6865;&#x6881;&#xFF1A; -</strong>&#x8FD9;&#x4E9B;&#x8F66;&#x7AD9;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x70B9;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x6865;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5373;&#x662F;&#x5426;&#x4ECE;&#x7F51;&#x7EDC;&#x4E2D;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x7F51;&#x6865;&#xFF0C;&#x91CD;&#x65B0;&#x914D;&#x7F6E;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7AD9;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E9B;&#x6865;&#x63A5;&#x5668;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5373;&#x6865;&#x63A5;&#x8F6C;&#x53D1;&#x548C;&#x6865;&#x63A5;&#x5B66;&#x4E60;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6E90;&#x8DEF;&#x7531;&#x6865;&#xFF1A; -</strong>&#x5728;&#x8FD9;&#x4E9B;&#x6865;&#x4E2D;&#xFF0C;&#x8DEF;&#x7531;&#x64CD;&#x4F5C;&#x7531;&#x6E90;&#x7AD9;&#x6267;&#x884C;&#xFF0C;&#x5E27;&#x6307;&#x5B9A;&#x8981;&#x9075;&#x5FAA;&#x7684;&#x8DEF;&#x7531;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x70ED;&#x70B9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x79F0;&#x4E3A;&#x53D1;&#x73B0;&#x5E27;&#x7684;&#x7279;&#x5B9A;&#x5E27;&#x6765;&#x53D1;&#x73B0;&#x5E27;&#xFF0C;&#x8BE5;&#x5E27;&#x4F7F;&#x7528;&#x5230;&#x76EE;&#x7684;&#x5730;&#x7684;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x8DEF;&#x5F84;&#x5728;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x64AD;&#x3002;</span> </li></ul><p></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>4.&#x4EA4;&#x6362;&#x673A;</strong> - &#x4EA4;&#x6362;&#x673A;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x7AEF;&#x53E3;&#x7F51;&#x6865;&#xFF0C;&#x5E26;&#x6709;&#x7F13;&#x51B2;&#x533A;&#x548C;&#x8BBE;&#x8BA1;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF08;&#x5927;&#x91CF;&#x7AEF;&#x53E3;&#x610F;&#x5473;&#x7740;&#x66F4;&#x5C11;&#x7684;&#x6D41;&#x91CF;&#xFF09;&#x548C;&#x6027;&#x80FD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> Switch&#x662F;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x8BBE;&#x5907;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4EA4;&#x6362;&#x673A;&#x53EF;&#x4EE5;&#x5728;&#x8F6C;&#x53D1;&#x6570;&#x636E;&#x4E4B;&#x524D;&#x6267;&#x884C;&#x9519;&#x8BEF;&#x68C0;&#x67E5;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x5B83;&#x975E;&#x5E38;&#x6709;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x8F6C;&#x53D1;&#x6709;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#x5305;&#x5E76;&#x4E14;&#x9009;&#x62E9;&#x6027;&#x5730;&#x5C06;&#x6B63;&#x597D;&#x7684;&#x6570;&#x636E;&#x5305;&#x8F6C;&#x53D1;&#x5230;&#x6B63;&#x786E;&#x7684;&#x7AEF;&#x53E3;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4EA4;&#x6362;&#x673A;&#x5212;&#x5206;&#x4E3B;&#x673A;&#x7684;&#x51B2;&#x7A81;&#x57DF;&#xFF0C;&#x4F46;<a href="https://en.wikipedia.org/wiki/Broadcast_domain">&#x5E7F;&#x64AD;&#x57DF;</a>&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;</span> <br></p><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>5.&#x8DEF;&#x7531;&#x5668;</strong> - &#x8DEF;&#x7531;&#x5668;&#x662F;&#x4E00;&#x79CD;&#x7C7B;&#x4F3C;&#x4EA4;&#x6362;&#x673A;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x5B83;&#x6839;&#x636E;IP&#x5730;&#x5740;&#x8DEF;&#x7531;&#x6570;&#x636E;&#x5305;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8DEF;&#x7531;&#x5668;&#x4E3B;&#x8981;&#x662F;&#x7F51;&#x7EDC;&#x5C42;&#x8BBE;&#x5907;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8DEF;&#x7531;&#x5668;&#x901A;&#x5E38;&#x5C06;LAN&#x548C;WAN&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x5177;&#x6709;&#x52A8;&#x6001;&#x66F4;&#x65B0;&#x7684;&#x8DEF;&#x7531;&#x8868;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x8DEF;&#x7531;&#x8868;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x8DEF;&#x7531;&#x6570;&#x636E;&#x5305;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8DEF;&#x7531;&#x5668;&#x5212;&#x5206;&#x901A;&#x8FC7;&#x5B83;&#x8FDE;&#x63A5;&#x7684;&#x4E3B;&#x673A;&#x7684;&#x5E7F;&#x64AD;&#x57DF;&#x3002;</span> </p><p><img class=" size-full wp-image-18227 aligncenter" src="../../../imgs/net/a7c3289c329a849f49c5b04b10d7d007.jpg" alt="IMG1" width="383" height="260"></p><p></p><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>6.&#x7F51;&#x5173;</strong> - &#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x7F51;&#x5173;&#x662F;&#x5C06;&#x4E24;&#x4E2A;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x4E0A;&#x5DE5;&#x4F5C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x4EEC;&#x57FA;&#x672C;&#x4E0A;&#x7528;&#x4F5C;&#x4FE1;&#x4F7F;&#x4EE3;&#x7406;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x89E3;&#x91CA;&#x5B83;&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x8F93;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x5173;&#x4E5F;&#x79F0;&#x4E3A;&#x534F;&#x8BAE;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x7F51;&#x7EDC;&#x5C42;&#x8FD0;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x5173;&#x901A;&#x5E38;&#x6BD4;&#x4EA4;&#x6362;&#x673A;&#x6216;&#x8DEF;&#x7531;&#x5668;&#x66F4;&#x590D;&#x6742;&#x3002;</span> </p><p></p><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>7. Brouter</strong> - &#x5B83;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x6865;&#x63A5;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x5B83;&#x7ED3;&#x5408;&#x4E86;&#x6865;&#x63A5;&#x5668;&#x548C;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x529F;&#x80FD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x6216;&#x7F51;&#x7EDC;&#x5C42;&#x5DE5;&#x4F5C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F5C;&#x4E3A;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x8DE8;&#x7F51;&#x7EDC;&#x8DEF;&#x7531;&#x6570;&#x636E;&#x5305;&#x5E76;&#x4F5C;&#x4E3A;&#x7F51;&#x6865;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x8FC7;&#x6EE4;&#x5C40;&#x57DF;&#x7F51;&#x6D41;&#x91CF;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x53C2;&#x8003;</strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://en.wikipedia.org/wiki/Gateway_%2528telecommunications%2529">https://en.wikipedia.org/wiki/Gateway_%28telecommunications%29</a></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://en.wikipedia.org/wiki/Router_%2528computing%2529">https://en.wikipedia.org/wiki/Router_%28computing%29</a></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://en.wikipedia.org/wiki/Network_switch">https://en.wikipedia.org/wiki/Network_switch</a></span> </p><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x60A8;&#x53D1;&#x73B0;&#x4EFB;&#x4F55;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6216;&#x8005;&#x60A8;&#x200B;&#x200B;&#x60F3;&#x8981;&#x5206;&#x4EAB;&#x6709;&#x5173;&#x4E0A;&#x8FF0;&#x4E3B;&#x9898;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x64B0;&#x5199;&#x8BC4;&#x8BBA;</span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>