<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/159.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x78B0;&#x649E;&#x57DF;&#x548C;&#x5E7F;&#x64AD;&#x57DF;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5148;&#x51B3;&#x6761;&#x4EF6; -</b> <a href="https://www.geeksforgeeks.org/network-devices-hub-repeater-bridge-switch-router-gateways/">&#x7F51;&#x7EDC;&#x8BBE;&#x5907;</a> &#xFF0C; <a href="https://www.geeksforgeeks.org/transmission-modes-computer-networks/">&#x4F20;&#x8F93;&#x6A21;&#x5F0F;</a></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6700;&#x5E38;&#x7528;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x662F;&#x8DEF;&#x7531;&#x5668;&#x548C;&#x4EA4;&#x6362;&#x673A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x542C;&#x5230;&#x4EBA;&#x4EEC;&#x5728;&#x8C08;&#x8BBA;&#x96C6;&#x7EBF;&#x5668;&#xFF0C;&#x4E2D;&#x7EE7;&#x5668;&#x548C;&#x6865;&#x63A5;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E9B;&#x4EE5;&#x524D;&#x7684;&#x8BBE;&#x5907;&#x6BD4;&#x540E;&#x8005;&#x66F4;&#x53D7;&#x6B22;&#x8FCE;&#xFF1F;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x53EF;&#x80FD;&#x662F;&#xFF1A;&apos;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x66F4;&#x6709;&#x6548;&#x7387;&#x548C;&#x5F3A;&#x5927;&apos;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4ED6;&#x4EEC;&#x6548;&#x7387;&#x80CC;&#x540E;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x5C31;&#x662F;<strong>&#x201C;&#x78B0;&#x649E;&#x57DF;&#x201D;</strong>&#x548C;<strong>&#x201C;&#x5E7F;&#x64AD;&#x57DF;&#x201D;&#x4E4B;</strong>&#x7C7B;&#x7684;&#x672F;&#x8BED;&#x51FA;&#x73B0;&#x7684;&#x60C5;&#x51B5;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x8FDB;&#x4E00;&#x6B65;&#x8BA8;&#x8BBA;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x96C6;&#x7EBF;&#x5668;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x7AEF;&#x53E3;&#x4E2D;&#x7EE7;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x540C;&#x6837;&#xFF0C;&#x4EA4;&#x6362;&#x673A;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x7AEF;&#x53E3;&#x7F51;&#x6865;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x751F;&#x4EA7;&#x7F51;&#x7EDC;&#x4E2D;&#x901A;&#x5E38;&#x4E0D;&#x4F7F;&#x7528;&#x4E2D;&#x7EE7;&#x5668;&#x548C;&#x7F51;&#x6865;&#xFF08;&#x56E0;&#x4E3A;&#x7AEF;&#x53E3;&#x6570;&#x91CF;&#x8F83;&#x5C11;&#xFF09;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x73B0;&#x5728;&#xFF0C;&#x7F29;&#x5C0F;&#x5230;Hubs&#xFF0C;Switch&#x548C;Routers&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x53C2;&#x8003;&#x4E00;&#x4E0B;&#x6253;&#x51FB;&#x57DF;&#x6765;&#x8BA8;&#x8BBA;&#x5B83;&#x4EEC;&#x3002;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x78B0;&#x649E;&#x57DF; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x51B2;&#x7A81;&#x57DF;&#x662F;&#x4E00;&#x79CD;&#x573A;&#x666F;&#xFF0C;&#x5F53;&#x8BBE;&#x5907;&#x5411;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x5305;&#x542B;&#x5728;&#x5176;&#x51B2;&#x7A81;&#x57DF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x8BBE;&#x5907;&#x5FC5;&#x987B;&#x6CE8;&#x610F;&#x5B83;&#xFF0C;&#x65E0;&#x8BBA;&#x5B83;&#x662F;&#x5426;&#x6CE8;&#x5B9A;&#x5B83;&#x4EEC;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4E24;&#x4E2A;&#x8BBE;&#x5907;&#x540C;&#x65F6;&#x53D1;&#x9001;&#x5176;&#x6D88;&#x606F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C06;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#xFF0C;&#x5BFC;&#x81F4;&#x5B83;&#x4EEC;&#x7B49;&#x5F85;&#x5E76;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x4E00;&#x6B21;&#x4E00;&#x4E2A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x4EC5;&#x5728;&#x534A;&#x53CC;&#x5DE5;&#x6A21;&#x5F0F;&#x4E0B;&#x624D;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5E7F;&#x64AD;&#x57DF;&#x540D; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5E7F;&#x64AD;&#x57DF;&#x662F;&#x4E00;&#x79CD;&#x573A;&#x666F;&#xFF0C;&#x5F53;&#x8BBE;&#x5907;&#x53D1;&#x51FA;&#x5E7F;&#x64AD;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x5176;&#x5E7F;&#x64AD;&#x57DF;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x90FD;&#x5FC5;&#x987B;&#x6CE8;&#x610F;&#x5B83;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x62E5;&#x585E;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;LAN&#x62E5;&#x585E;&#xFF0C;&#x8FD9;&#x4F1A;&#x5F71;&#x54CD;&#x8BE5;&#x7F51;&#x7EDC;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x7528;&#x6237;&#x7684;&#x5E26;&#x5BBD;&#x3002;</span> <p></p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x51B2;&#x7A81;&#x57DF;&#x7684;&#x6570;&#x91CF;&#x8D8A;&#x591A;&#xFF0C;&#x5E7F;&#x64AD;&#x57DF;&#x7684;&#x6570;&#x91CF;&#x8D8A;&#x591A;&#xFF0C;&#x7F51;&#x7EDC;&#x4E3A;&#x6240;&#x6709;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x5E26;&#x5BBD;&#x5C31;&#x8D8A;&#x6709;&#x6548;&#x3002;</span> </p></li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x54EA;&#x4E9B;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x6253;&#x7834;&#x4E86;&#x51B2;&#x7A81;&#x57DF;&#xFF0C;&#x54EA;&#x4E9B;&#x7A81;&#x7834;&#x4E86;&#x5E7F;&#x64AD;&#x57DF;&#xFF1F;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>HUB  - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6211;&#x4EEC;&#x4ECE;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x5F00;&#x59CB;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x5FEB;&#x6446;&#x8131;&#x5B83;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5B83;&#x65E2;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x51B2;&#x7A81;&#x57DF;&#x4E5F;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x5E7F;&#x64AD;&#x57DF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FDE;&#x63A5;&#x5230;&#x96C6;&#x7EBF;&#x5668;&#x7684;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x90FD;&#x5904;&#x4E8E;&#x5355;&#x4E2A;&#x51B2;&#x7A81;&#x548C;&#x5355;&#x4E2A;&#x5E7F;&#x64AD;&#x57DF;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x96C6;&#x7EBF;&#x5668;&#x4E0D;&#x4F1A;&#x5BF9;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x5206;&#x6BB5;&#xFF0C;&#x5B83;&#x4EEC;&#x53EA;&#x662F;&#x8FDE;&#x63A5;&#x7F51;&#x6BB5;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5F00;&#x5173; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6765;&#x5230;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x6BD4;&#x96C6;&#x7EBF;&#x5668;&#x6709;&#x4F18;&#x52BF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4EA4;&#x6362;&#x673A;&#x4E0A;&#x7684;&#x6BCF;&#x4E2A;&#x7AEF;&#x53E3;&#x90FD;&#x4F4D;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x51B2;&#x7A81;&#x57DF;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x6765;&#x81EA;&#x8FDE;&#x63A5;&#x5230;&#x4E0D;&#x540C;&#x7AEF;&#x53E3;&#x7684;&#x8BBE;&#x5907;&#x7684;&#x6D88;&#x606F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x5728;&#x8BBE;&#x8BA1;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x4F46;&#x4EA4;&#x6362;&#x673A;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4ED6;&#x4EEC;&#x4ECE;&#x4E0D;&#x7834;&#x574F;&#x5E7F;&#x64AD;&#x57DF;&#x540D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4EA4;&#x6362;&#x673A;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x7AEF;&#x53E3;&#x4ECD;&#x5904;&#x4E8E;&#x5355;&#x4E2A;&#x5E7F;&#x64AD;&#x57DF;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x8BBE;&#x5907;&#x53D1;&#x9001;&#x5E7F;&#x64AD;&#x6D88;&#x606F;&#xFF0C;&#x5B83;&#x4ECD;&#x5C06;&#x5BFC;&#x81F4;&#x62E5;&#x585E;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8DEF;&#x7531;&#x5668; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6700;&#x540E;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x6700;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x6551;&#x4E16;&#x4E3B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8DEF;&#x7531;&#x5668;&#x4E0D;&#x4EC5;&#x4F1A;&#x7834;&#x574F;&#x51B2;&#x7A81;&#x57DF;&#xFF0C;&#x8FD8;&#x4F1A;&#x7834;&#x574F;&#x5E7F;&#x64AD;&#x57DF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8DEF;&#x7531;&#x5668;&#x5728;&#x4E24;&#x4E2A;&#x7F51;&#x7EDC;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x8FDE;&#x63A5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x5E7F;&#x64AD;&#x6D88;&#x606F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5230;&#x8FBE;&#x53E6;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x4E3A;&#x8DEF;&#x7531;&#x5668;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8BA9;&#x5B83;&#x901A;&#x8FC7;&#x3002;</span> </li></ul><p><img src="../../../imgs/net/2cf656adc9baf022eeeb97f10fabd728.jpg" alt="" width="428" height="255" class="aligncenter size-full wp-image-235697"></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B64;&#x5916;&#xFF0C;&#x7531;&#x4E8E;&#x4E2D;&#x7EE7;&#x5668;&#x548C;&#x6865;&#x63A5;&#x5668;&#x4EC5;&#x5728;&#x7AEF;&#x53E3;&#x6570;&#x91CF;&#x65B9;&#x9762;&#x4E0D;&#x540C;&#x4E8E;&#x96C6;&#x7EBF;&#x5668;&#x548C;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x56E0;&#x6B64;&#x4E2D;&#x7EE7;&#x5668;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x51B2;&#x7A81;&#x548C;&#x5E7F;&#x64AD;&#x57DF;&#xFF0C;&#x800C;&#x6865;&#x63A5;&#x5668;&#x4EC5;&#x65AD;&#x5F00;&#x51B2;&#x7A81;&#x57DF;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x53C2;&#x8003;&#x6587;&#x732E; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="http://www.innos.in/downloads/CISCO%2520-%2520640-802-ccna.pdf">CCNA&#xFF0C;Todd Lammle</a></span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>