<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/162.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6D0B;&#x8471;&#x8DEF;&#x7531;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x662F;&#x4E00;&#x79CD;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x533F;&#x540D;&#x901A;&#x4FE1;&#x7684;&#x6280;&#x672F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6D0B;&#x8471;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6D88;&#x606F;&#x88AB;&#x5C01;&#x88C5;&#x5728;&#x52A0;&#x5BC6;&#x5C42;&#x4E2D;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x6D0B;&#x8471;&#x5C42;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6709;&#x5927;&#x91CF;&#x7684;&#x9884;&#x9632;&#x63AA;&#x65BD;&#x548C;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x4F7F;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x66F4;&#x5B89;&#x5168;&#xFF0C;&#x66F4;&#x5B89;&#x5168;&#x5730;&#x8FDB;&#x884C;&#x7F51;&#x9875;&#x6D4F;&#x89C8;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5047;&#x8BBE;&#x60A8;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;HTTP&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x4EBA;&#x622A;&#x83B7;&#x8BE5;&#x8BF7;&#x6C42;&#xFF0C;&#x4F46;&#x8BE5;&#x4EBA;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x8BE5;&#x6D88;&#x606F;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5DF2;&#x52A0;&#x5BC6;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#x4F60;&#x4ECD;&#x7136;&#x4E0D;&#x6EE1;&#x610F;&#x8FD9;&#x79CD;&#x5B89;&#x5168;&#x7EA7;&#x522B;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x5C06;&#x5176;&#x63D0;&#x5347;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x5373;&#x4F60;&#x751A;&#x81F3;&#x4E0D;&#x5E0C;&#x671B;&#x4EFB;&#x4F55;&#x4EBA;&#x5728;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x4E0A;&#x55C5;&#x63A2;&#x4F60;&#x77E5;&#x9053;&#x4F60;&#x6B63;&#x5728;&#x8054;&#x7CFB;&#x54EA;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x4F60;&#x662F;&#x5426;&#x63D0;&#x51FA;&#x4EFB;&#x4F55;&#x8981;&#x6C42;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x662F;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x7684;&#x6765;&#x6E90;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;<a href="https://en.wikipedia.org/wiki/Onion_routing">&#x6B64;</a>&#x56FE;</span> </p><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF1F;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x60A8;&#x5728;&#x666E;&#x901A;&#x7684;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#xFF08;&#x5982;chrome&#xFF0C;firefox&#x7B49;&#xFF09;&#x4E0A;&#x6D4F;&#x89C8;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x7B80;&#x5355;&#x7684;GET&#x8BF7;&#x6C42;&#x800C;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x4E2D;&#x4ECB;&#x6765;&#x8BF7;&#x6C42;&#x7F51;&#x9875;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x53EA;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5355;&#x4E00;&#x8FDE;&#x63A5;&#xFF0C;&#x6709;&#x4EBA;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x55C5;&#x63A2;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x60A8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6B63;&#x5728;&#x8054;&#x7CFB;&#x54EA;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x3002;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6D0B;&#x8471;&#x8DEF;&#x7EBF;&#x7684;&#x505A;&#x6CD5;&#x4E0D;&#x540C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x4E2D;&#xFF0C;&#x8FDE;&#x63A5;&#x5728;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x4FDD;&#x6301;&#xFF0C;&#x5373;&#x8FDE;&#x63A5;&#x4ECE;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x8DF3;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5F53;&#x5B83;&#x5230;&#x8FBE;&#x8BE5;&#x7535;&#x8DEF;&#x4E0A;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x65F6;&#xFF0C;&#x5B83;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x8054;&#x7CFB;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5B83;&#x5C06;&#x5904;&#x7406;&#x6211;&#x4EEC;&#x7684;&#x8BF7;&#x6C42;&#x5E76;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x6240;&#x9700;&#x7684;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x8282;&#x70B9;&#x7F51;&#x7EDC;&#x53D1;&#x56DE;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x9875;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x73B0;&#x5728;&#x4F60;&#x5FC5;&#x987B;&#x4E3A;&#x4EC0;&#x4E48;&#x79F0;&#x5B83;&#x4E3A;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x548C;&#x6211;&#x4EEC;&#x6536;&#x5230;&#x7684;&#x54CD;&#x5E94;&#x662F;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8DF3;&#x6216;&#x670D;&#x52A1;&#x5668;&#x8BBF;&#x95EE;&#x90FD;&#x6709;&#x552F;&#x4E00;&#x7684;&#x52A0;&#x5BC6;&#x5BC6;&#x94A5;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x5BC6;&#x94A5;&#xFF0C;&#x4F46;&#x670D;&#x52A1;&#x5668;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x7279;&#x5B9A;&#x4E8E;&#x52A0;&#x5BC6;/&#x89E3;&#x5BC6;&#x5230;&#x8BE5;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5BC6;&#x94A5;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;<strong>&#x5C06;&#x4F60;&#x7684;&#x6D88;&#x606F;&#x5305;&#x88C5;&#x5728;&#x52A0;&#x5BC6;&#x5C42;&#x4E4B;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x52A0;&#x5BC6;&#x5C42;</strong>&#x5FC5;&#x987B;&#x5728;&#x6BCF;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8DF3;&#x8DC3;&#x5904;&#x5265;&#x79BB;&#xFF0C;&#x5C31;&#x50CF;&#x6D0B;&#x8471;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x88AB;&#x79F0;&#x4E3A;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x5668;&#x3002;</span> </li></ul><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x4E86;&#x89E3;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x6982;&#x5FF5;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x60A8;&#x6B63;&#x5728;&#x4F7F;&#x7528;Tor&#xFF08;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x5668;&#xFF09;&#x6D4F;&#x89C8;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x60A8;&#x4F7F;&#x7528;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x60A8;&#x60F3;&#x8BBF;&#x95EE;YouTube&#xFF0C;&#x4F46;&#x60A8;&#x5C45;&#x4F4F;&#x5728;&#x4E2D;&#x56FD;&#xFF0C;&#x56E0;&#x4E3A;YouTube&#x5728;&#x4E2D;&#x56FD;&#x88AB;&#x7981;&#x6B62;&#xFF0C;&#x60A8;&#x4E0D;&#x5E0C;&#x671B;&#x60A8;&#x7684;&#x653F;&#x5E9C;&#x77E5;&#x9053;&#x60A8;&#x6B63;&#x5728;&#x8BBF;&#x95EE;YouTube&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;Tor&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x60A8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x9700;&#x8981;&#x8054;&#x7CFB;&#x7279;&#x5B9A;&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x83B7;&#x53D6;YouTube&#x7684;&#x4E3B;&#x9875;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x76F4;&#x63A5;&#x4E0E;&#x8BE5;&#x670D;&#x52A1;&#x5668;&#x8054;&#x7CFB;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x901A;&#x8FC7;3&#x4E2A;&#x8282;&#x70B9;/&#x670D;&#x52A1;&#x5668;/&#x8DEF;&#x7531;&#x5668;&#xFF08;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x5668;&#x7531;&#x5FD7;&#x613F;&#x8005;&#x5728;&#x4E16;&#x754C;&#x5404;&#x5730;&#x7EF4;&#x62A4;&#xFF09;&#x5728;&#x8BE5;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x524D;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x60A8;&#x4E0E;&#x8BE5;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5BF9;&#x8BDD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3A;&#x4E86;&#x4F7F;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x4E86;3&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4F46;&#x771F;&#x6B63;&#x7684;Tor&#x7F51;&#x7EDC;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x6709;&#x6570;&#x767E;&#x4E2A;&#x8282;&#x70B9;&#x3002;</span> <br></p><div id="attachment_203117" style="width: 1411px" class="wp-caption aligncenter"><img src="../../../imgs/net/1f37f17baa39b5d0022aeeb0b1d23a99.jpg" alt="" width="1401" height="687" class="size-full wp-image-203117"><p class="wp-caption-text"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x7535;&#x8DEF;&#xFF08;&#x4F7F;&#x7528;lucidchart&#x5236;&#x4F5C;&#xFF09;</span> </p></div><p></p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x52A0;&#x5BC6;&#x5BC6;&#x94A5;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5373;<strong>&#x5BC6;&#x94A5;1&#xFF0C;&#x5BC6;&#x94A5;2&#x548C;&#x5BC6;&#x94A5;3&#xFF0C;</strong>&#x5C06;&#x6D88;&#x606F;&#xFF08;&#x83B7;&#x53D6;&#x8BF7;&#x6C42;&#xFF09;&#x52A0;&#x5BC6;&#x4E09;&#x6B21;&#xFF0C;&#x5C06;&#x5176;&#x5305;&#x88F9;&#x5728;3&#x5C42;&#xFF0C;&#x5982;&#x6D0B;&#x8471;&#xFF0C;&#x6BCF;&#x6B21;&#x5FC5;&#x987B;&#x5265;&#x79BB;&#x4E00;&#x4E2A;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x540E;&#x5C06;&#x8BE5;<strong>&#x4E09;&#x91CD;&#x52A0;&#x5BC6;&#x6D88;&#x606F;</strong>&#x53D1;&#x9001;&#x5230;&#x7B2C;&#x4E00;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5373;<strong>&#x8282;&#x70B9;1&#xFF08;&#x8F93;&#x5165;&#x8282;&#x70B9;&#xFF09;&#x3002;</strong></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8282;&#x70B9;1</strong>&#x4EC5;&#x5177;&#x6709;<strong>&#x8282;&#x70B9;2</strong>&#x548C;<strong>&#x5BC6;&#x94A5;1</strong>&#x7684;&#x5730;&#x5740;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6240;&#x4EE5;&#x5B83;&#x4F7F;&#x7528;<strong>&#x5BC6;&#x94A5;1</strong> <strong>&#x89E3;&#x5BC6;</strong>&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x610F;&#x8BC6;&#x5230;&#x5B83;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4ECD;&#x7136;&#x6709;2&#x5C42;&#x52A0;&#x5BC6;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5C06;&#x5B83;&#x4F20;&#x9012;&#x7ED9;<strong>&#x8282;&#x70B9;2</strong></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8282;&#x70B9;2</strong>&#x5177;&#x6709;<strong>&#x5BC6;&#x94A5;2</strong>&#x4EE5;&#x53CA;<strong>&#x8F93;&#x5165;&#x548C;&#x9000;&#x51FA;&#x8282;&#x70B9;</strong>&#x7684;&#x5730;&#x5740;<strong>&#x3002;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;<strong>&#x5BC6;&#x94A5;2</strong> <strong>&#x89E3;&#x5BC6;</strong>&#x6D88;&#x606F;&#xFF0C;&#x610F;&#x8BC6;&#x5230;&#x5B83;&#x4ECD;&#x7136;&#x88AB;<strong>&#x52A0;&#x5BC6;</strong>&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x5230;<strong>&#x51FA;&#x53E3;&#x8282;&#x70B9;</strong></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8282;&#x70B9;3&#xFF08;&#x9000;&#x51FA;&#x8282;&#x70B9;&#xFF09;</strong>&#x5265;&#x79BB;&#x6700;&#x540E;&#x4E00;&#x5C42;&#x52A0;&#x5BC6;&#x5E76;&#x627E;&#x5230;youtube.com&#x7684;<strong>GET&#x8BF7;&#x6C42;</strong>&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x5230;<strong>&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;</strong></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x5E76;&#x63D0;&#x4F9B;&#x6240;&#x9700;&#x7684;&#x7F51;&#x9875;&#x4F5C;&#x4E3A;<strong>&#x54CD;&#x5E94;&#x3002;</strong></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x54CD;&#x5E94;&#x4EE5;&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x5411;&#x901A;&#x8FC7;&#x76F8;&#x540C;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4F7F;&#x7528;&#x5176;&#x7279;&#x5B9A;&#x7684;&#x5BC6;&#x94A5;<strong>&#x52A0;&#x5BC6;&#x4E00;&#x5C42;&#x52A0;&#x5BC6;</strong></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x6700;&#x7EC8;&#x4EE5;<strong>&#x4E09;&#x91CD;&#x52A0;&#x5BC6;</strong>&#x54CD;&#x5E94;&#x7684;&#x5F62;&#x5F0F;&#x5230;&#x8FBE;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x53EF;&#x4EE5;&#x89E3;&#x5BC6;&#xFF0C;&#x56E0;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x5BC6;&#x94A5;</span> </li></ol><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5B83;&#x5982;&#x4F55;&#x63D0;&#x4F9B;&#x533F;&#x540D;&#x6027;&#xFF1F;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#xFF08;&#x5BA2;&#x6237;&#x7AEF; - &#x8F93;&#x5165;&#x8282;&#x70B9;&#xFF09;&#x4E0A;&#x6709;&#x55C5;&#x63A2;&#x5668;&#x76D1;&#x542C;&#xFF0C; <strong>&#x5B83;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x8F93;&#x5165;&#x8282;&#x70B9;&#x7684;&#x5730;&#x5740;&#x548C;</strong>&#x6CA1;&#x6709;&#x610F;&#x4E49;<strong>&#x7684;&#x4E09;&#x6B21;&#x52A0;&#x5BC6;&#x6D88;&#x606F;</strong> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6240;&#x4EE5;&#x653B;&#x51FB;&#x8005;/&#x55C5;&#x63A2;&#x8005;&#x90FD;&#x77E5;&#x9053;&#x4F60;&#x6B63;&#x5728;&#x6D4F;&#x89C8;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x51FA;&#x53E3;&#x8282;&#x70B9;&#x5904;&#x5F00;&#x59CB;&#x55C5;&#x63A2;&#xFF0C;&#x5219;&#x6240;&#x6709;&#x55C5;&#x63A2;&#x5668;&#x770B;&#x5230;&#x7684;&#x662F;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x8054;&#x7CFB;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F46;&#x5B83;&#x65E0;&#x6CD5;&#x8DDF;&#x8E2A;&#x5BA2;&#x6237;&#x7AEF;&#x6216;&#x751F;&#x6210;&#x7684;&#x8BF7;&#x6C42;&#x7684;&#x6765;&#x6E90;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x73B0;&#x5728;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4EBA;&#x6B63;&#x5728;&#x4FA6;&#x542C;&#x8282;&#x70B9;2&#xFF0C;&#x5219;&#x4F1A;&#x77E5;&#x9053;&#x8F93;&#x5165;&#x548C;&#x9000;&#x51FA;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8DDF;&#x8E2A;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x7B80;&#x5355;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x6709;&#x6570;&#x767E;&#x4E2A;&#x5E76;&#x53D1;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x4E14;&#x77E5;&#x9053;&#x54EA;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x5230;&#x6B63;&#x786E;&#x7684;&#x6E90;&#x548C;&#x76EE;&#x6807;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7535;&#x8DEF;&#x4E2D;&#xFF0C;&#x8282;&#x70B9;2&#x662F;&#x4E2D;&#x95F4;&#x8282;&#x70B9;&#xFF0C;&#x4F46;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x4E0D;&#x540C;&#x8FDE;&#x63A5;&#x4E0A;&#x7684;&#x53E6;&#x4E00;&#x7535;&#x8DEF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5176;&#x4E2D;&#x5B83;&#x5145;&#x5F53;&#x63A5;&#x6536;&#x8BF7;&#x6C42;&#x7684;&#x8F93;&#x5165;&#x8282;&#x70B9;&#x6216;&#x4ECE;&#x5404;&#x79CD;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x7F51;&#x9875;&#x7684;&#x51FA;&#x53E3;&#x8282;&#x70B9;&#x3002;</span> </p><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x4E2D;&#x7684;&#x6F0F;&#x6D1E;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x4E2D;&#x552F;&#x4E00;&#x7684;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x540C;&#x65F6;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x76D1;&#x542C;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x957F;&#x5EA6;&#x548C;&#x9891;&#x7387;&#xFF0C;&#x5C06;&#x76EE;&#x7684;&#x5730;&#x7684;&#x8BF7;&#x6C42;&#x4E0E;&#x7F51;&#x7EDC;&#x53E6;&#x4E00;&#x7AEF;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5339;&#x914D;&#x5728;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x622A;&#x83B7;&#x7684;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x4E2D;&#x627E;&#x5230;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x7684;&#x76F8;&#x540C;&#x8BF7;&#x6C42;&#x5339;&#x914D;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#xFF08;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x4E5F;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x63A8;&#x65AD;&#xFF09;&#x7136;&#x540E;&#x8DDF;&#x8E2A;&#x4ED6;&#x4EEC;&#x5E76;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x7684;&#x5728;&#x7EBF;&#x6D3B;&#x52A8;&#x5E76;&#x6253;&#x7834;&#x533F;&#x540D;&#x7684;&#x60F3;&#x6CD5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x5F88;&#x96BE;&#x505A;&#x5230;&#x4F46;&#x5E76;&#x975E;&#x4E0D;&#x53EF;&#x80FD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#x4ECE;Tor&#x4E2D;&#x5220;&#x9664;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</strong> <a href="https://www.youtube.com/user/Computerphile" target="_blank">Computerphile</a></span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>