<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/169.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56FE;&#x50CF;&#x9690;&#x5199;&#x672F;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>Steganography</b>&#x8FD9;&#x4E2A;&#x8BCD;&#x6E90;&#x4E8E;&#x4E24;&#x4E2A;&#x5E0C;&#x814A;&#x8BCD; - &#x201C;stegos&#x201D;&#x610F;&#x601D;&#x662F;&#x201C;&#x8986;&#x76D6;&#x201D;&#x548C;&#x201C;&#x7070;&#x8272;&#x201D;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x201C;&#x5199;&#x4F5C;&#x201D;&#xFF0C;&#x56E0;&#x6B64;&#x8F6C;&#x5316;&#x4E3A;&#x201C;&#x8986;&#x76D6;&#x7684;&#x5199;&#x4F5C;&#x201D;&#x6216;&#x201C;&#x9690;&#x85CF;&#x7684;&#x5199;&#x4F5C;&#x201D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x9690;&#x5199;&#x672F;</b>&#x662F;&#x4E00;&#x79CD;&#x9690;&#x85CF;&#x79D8;&#x5BC6;&#x6570;&#x636E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x5176;&#x5D4C;&#x5165;&#x97F3;&#x9891;&#xFF0C;&#x89C6;&#x9891;&#xFF0C;&#x56FE;&#x50CF;&#x6216;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x662F;&#x7528;&#x4E8E;&#x4FDD;&#x62A4;&#x79D8;&#x5BC6;&#x6216;&#x654F;&#x611F;&#x6570;&#x636E;&#x514D;&#x53D7;&#x6076;&#x610F;&#x653B;&#x51FB;&#x7684;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5B83;&#x4E0E;&#x5BC6;&#x7801;&#x5B66;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF1F;</b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BC6;&#x7801;&#x5B66;&#x548C;&#x9690;&#x5199;&#x672F;&#x90FD;&#x662F;&#x7528;&#x4E8E;&#x9690;&#x85CF;&#x6216;&#x4FDD;&#x62A4;&#x79D8;&#x5BC6;&#x6570;&#x636E;&#x7684;&#x65B9;&#x6CD5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x5BC6;&#x7801;&#x5B66;&#x4F7F;&#x6570;&#x636E;&#x4E0D;&#x53EF;&#x8BFB;&#x6216;&#x9690;&#x85CF;&#x6570;&#x636E;<i>&#x542B;&#x4E49;</i>&#x65B9;&#x9762;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#xFF0C;&#x800C;&#x9690;&#x5199;&#x672F;&#x9690;&#x85CF;&#x4E86;&#x6570;&#x636E;&#x7684;<i>&#x5B58;&#x5728;</i> &#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x4FD7;&#x5730;&#x8BF4;&#xFF0C;&#x5BC6;&#x7801;&#x5B66;&#x7C7B;&#x4F3C;&#x4E8E;&#x7528;&#x79D8;&#x5BC6;&#x8BED;&#x8A00;&#x5199;&#x4E00;&#x5C01;&#x4FE1;&#xFF1A;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x9605;&#x8BFB;&#x5B83;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x7406;&#x89E3;&#x5B83;&#x7684;&#x542B;&#x4E49;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x770B;&#x5230;&#x8FD9;&#x5C01;&#x4FE1;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x79D8;&#x5BC6;&#x7684;&#xFF09;&#x4FE1;&#x606F;&#x7684;&#x5B58;&#x5728;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x77E5;&#x9053;&#x6216;&#x627E;&#x51FA;&#x60A8;&#x7684;&#x79D8;&#x5BC6;&#x8BED;&#x8A00;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x7684;&#x4FE1;&#x606F;&#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x9605;&#x8BFB;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x4F60;&#x5728;&#x76F8;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;<i>&#x9690;&#x5199;&#x672F;</i> &#xFF0C;&#x4F60;&#x4F1A;&#x5C06;&#x8FD9;&#x5C01;&#x4FE1;&#x9690;&#x85CF;&#x5728;&#x4E00;&#x53CC;&#x889C;&#x5B50;&#x91CC;&#x9762;&#xFF0C;&#x4F60;&#x4F1A;&#x7ED9;&#x8FD9;&#x5C01;&#x4FE1;&#x7684;&#x9884;&#x5B9A;&#x6536;&#x4EF6;&#x4EBA;&#x9001;&#x793C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x4E0D;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x4F60;&#x7684;&#x793C;&#x7269;&#x6CA1;&#x6709;&#x889C;&#x5B50;&#x4E86;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#x9884;&#x671F;&#x7684;&#x6536;&#x4EF6;&#x4EBA;&#x77E5;&#x9053;&#x8981;&#x67E5;&#x627E;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x67E5;&#x627E;&#x9690;&#x85CF;&#x5728;&#x5176;&#x4E2D;&#x7684;&#x90AE;&#x4EF6;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x4EA4;&#x6362;&#x5A92;&#x4F53;&#x6587;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x786E;&#x5B9A;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x662F;&#x5426;&#x5305;&#x542B;&#x9690;&#x85CF;&#x6D88;&#x606F;&#x5C06;&#x6BD4;&#x4F7F;&#x7528;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x66F4;&#x56F0;&#x96BE;&#x3002;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> Crpytography&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x8865;&#x5145;&#x9690;&#x5199;&#x672F;&#x63D0;&#x4F9B;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BC6;&#x7801;&#x7B97;&#x6CD5;&#x7528;&#x4E8E;&#x5728;&#x5C06;&#x79D8;&#x5BC6;&#x6570;&#x636E;&#x5D4C;&#x5165;&#x5C01;&#x9762;&#x6587;&#x4EF6;&#x4E4B;&#x524D;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x56FE;&#x50CF;&#x9690;&#x5199;&#x672F; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;Image Steganography&#x662F;&#x6307;&#x5728;&#x56FE;&#x50CF;&#x6587;&#x4EF6;&#x4E2D;&#x9690;&#x85CF;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3A;&#x6B64;&#x76EE;&#x7684;&#x9009;&#x62E9;&#x7684;&#x56FE;&#x50CF;&#x79F0;&#x4E3A;<b>&#x5C01;&#x9762;&#x56FE;&#x50CF;</b> &#xFF0C;&#x9690;&#x5199;&#x672F;&#x540E;&#x83B7;&#x5F97;&#x7684;&#x56FE;&#x50CF;&#x79F0;&#x4E3A;<b>&#x9690;&#x79D8;&#x56FE;&#x50CF;</b> &#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x600E;&#x4E48;&#x505A;&#xFF1F;</b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56FE;&#x50CF;&#x5728;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x8868;&#x793A;&#x4E3A;N * M&#xFF08;&#x5728;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;&#x6216;N * M * 3&#xFF08;&#x5728;&#x5F69;&#x8272;&#x56FE;&#x50CF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;&#x77E9;&#x9635;&#xFF0C;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x8868;&#x793A;&#x50CF;&#x7D20;&#x7684;&#x5F3A;&#x5EA6;&#x503C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x56FE;&#x50CF;&#x9690;&#x5199;&#x672F;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x7531;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x9009;&#x62E9;&#x7684;&#x4E00;&#x4E9B;&#x50CF;&#x7D20;&#x7684;&#x503C;&#x5C06;&#x6D88;&#x606F;&#x5D4C;&#x5165;&#x5230;&#x56FE;&#x50CF;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56FE;&#x50CF;&#x7684;&#x63A5;&#x6536;&#x8005;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x76F8;&#x540C;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x77E5;&#x9053;&#x4ED6;&#x6216;&#x5979;&#x5FC5;&#x987B;&#x9009;&#x62E9;&#x54EA;&#x4E9B;&#x50CF;&#x7D20;&#x6765;&#x63D0;&#x53D6;&#x6D88;&#x606F;&#x3002;</span> </p><p><img src="../../../imgs/net/dcf998ee5105702c594531e2c690b235.jpg" alt="" width="381" height="300" class="aligncenter size-full wp-image-377640"><br></p><center> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x56FE; -</b>&#x56FE;&#x50CF;Stegaography&#x7684;&#x8FC7;&#x7A0B;</span> </center><p></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8986;&#x76D6;&#x56FE;&#x50CF;&#x5185;&#x7684;&#x6D88;&#x606F;&#x68C0;&#x6D4B;&#x662F;&#x901A;&#x8FC7;<b>&#x9690;&#x5199;&#x5206;&#x6790;</b>&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0E;&#x5C01;&#x9762;&#x56FE;&#x50CF;&#xFF0C;&#x76F4;&#x65B9;&#x56FE;&#x7ED8;&#x5236;&#x6216;&#x566A;&#x58F0;&#x68C0;&#x6D4B;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x6765;&#x5B8C;&#x6210;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x867D;&#x7136;&#x6B63;&#x5728;&#x52AA;&#x529B;&#x5F00;&#x53D1;&#x5177;&#x6709;&#x66F4;&#x9AD8;&#x7A0B;&#x5EA6;&#x7684;&#x514D;&#x75AB;&#x529B;&#x4EE5;&#x62B5;&#x5FA1;&#x6B64;&#x7C7B;&#x653B;&#x51FB;&#x7684;&#x65B0;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x8FD8;&#x81F4;&#x529B;&#x4E8E;&#x6539;&#x8FDB;&#x73B0;&#x6709;&#x7684;&#x9690;&#x5199;&#x5206;&#x6790;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x68C0;&#x6D4B;&#x6050;&#x6016;&#x5206;&#x5B50;&#x6216;&#x72AF;&#x7F6A;&#x5206;&#x5B50;&#x4E4B;&#x95F4;&#x7684;&#x79D8;&#x5BC6;&#x4FE1;&#x606F;&#x4EA4;&#x6362;&#x3002;</span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><hr><hr><!-- .entry-meta --></div></body></html>