<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/170.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x6027;|</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6240;&#x6709;&#x4F60;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x7684;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6211;&#x4EEC;&#x90FD;&#x5FC5;&#x987B;&#x542C;&#x8FC7;&#x201C; <strong>&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;</strong> &#x201D;&#x4E00;&#x8BCD;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E2D;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x4EBA;&#x4F1A;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x6211;&#x4EEC;&#x4E0A;&#x7EBF;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x8FDE;&#x63A5;&#x5230;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x7F51;&#x7AD9;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x4E0D;&#x4F1A;&#x5F04;&#x4E71;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5C06;&#x6211;&#x4EEC;&#x8FDE;&#x63A5;&#x5230;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x7684;&#x6240;&#x6709;&#x7F51;&#x7AD9;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x5185;&#x5BB9;&#x3002;</span> </p><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x4EC0;&#x4E48;&#x662F;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#xFF1F;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x9A6C;&#x514B;&#x624E;&#x514B;&#x4F2F;&#x683C;&#x521B;&#x5EFA;Facebook&#x65F6;&#xFF0C;&#x4ED6;&#x4E0D;&#x9700;&#x8981;&#x8BA9;&#x4EFB;&#x4F55;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x5C06;&#x8BE5;&#x7F51;&#x7AD9;&#x6DFB;&#x52A0;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4ED6;&#x4E5F;&#x6CA1;&#x6709;&#x5411;&#x8FD9;&#x4E9B;&#x516C;&#x53F8;&#x652F;&#x4ED8;&#x989D;&#x5916;&#x8D39;&#x7528;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;Facebook&#x80FD;&#x591F;&#x50CF;&#x6210;&#x719F;&#x516C;&#x53F8;&#x7684;&#x7F51;&#x7AD9;&#x4E00;&#x6837;&#x8FD0;&#x4F5C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x76F8;&#x53CD;&#xFF0C;&#x4E00;&#x65E6;&#x4ED6;&#x521B;&#x5EFA;&#x4E86;Facebook&#x7F51;&#x7AD9;&#xFF0C;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x4E16;&#x754C;&#x4E0A;&#x4EFB;&#x4F55;&#x8FDE;&#x63A5;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x81EA;&#x52A8;&#x83B7;&#x5F97;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x662F;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x6027;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x6027;&#x6216;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x6027;&#x662F;&#x963B;&#x788D;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x5E72;&#x6270;&#x901F;&#x5EA6;&#x6216;&#x963B;&#x6B62;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x6216;&#x7F51;&#x7AD9;&#x7684;&#x5173;&#x952E;&#x6807;&#x51C6;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x610F;&#x5473;&#x7740;ISP&#x5E94;&#x8BE5;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x5F00;&#x653E;&#x5F0F;&#x7F51;&#x7EDC;&#xFF0C;&#x4E0D;&#x5E94;&#x963B;&#x6B62;&#x6216;&#x533A;&#x5206;&#x5728;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x7684;&#x7535;&#x8BDD;&#x516C;&#x53F8;&#x4E0D;&#x5E94;&#x8BE5;&#x51B3;&#x5B9A;&#x6211;&#x4EEC;&#x6253;&#x7535;&#x8BDD;&#x7ED9;&#x8C01;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x5728;&#x7535;&#x8BDD;&#x4F1A;&#x8BAE;&#x4E0A;&#x8BF4;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x7684;ISP&#x4E0D;&#x5E94;&#x8BE5;&#x5E72;&#x6270;&#x6211;&#x4EEC;&#x67E5;&#x770B;&#x6216;&#x5728;&#x7EBF;&#x53D1;&#x5E03;&#x7684;&#x5185;&#x5BB9;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x63D0;&#x4F9B;&#x5546;&#x53EF;&#x4EE5;&#x5C06;&#x4E92;&#x8054;&#x7F51;&#x5206;&#x89E3;&#x4E3A;&#x5FEB;&#x901F;&#x548C;&#x6162;&#x901F;&#x901A;&#x9053;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> ISP&#x53EF;&#x4EE5;&#x653E;&#x6162;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x963B;&#x6B62;&#x5B83;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F88;&#x5C11;&#x6709;&#x80FD;&#x591F;&#x652F;&#x4ED8;&#x7279;&#x6B8A;&#x5F85;&#x9047;&#x7684;&#x5185;&#x5BB9;&#x516C;&#x53F8;&#x5411;ISP&#x652F;&#x4ED8;&#x989D;&#x5916;&#x8D39;&#x7528;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x4EBA;&#x8F6C;&#x79FB;&#x5230;&#x8F83;&#x6162;&#x7684;&#x670D;&#x52A1;&#x5C42;&#xFF0C;&#x8FD9;&#x5C06;&#x7834;&#x574F;&#x5F00;&#x653E;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x3002;</span> </p><p align="center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x7684;&#x7406;&#x7531;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</strong></span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x652F;&#x6301;&#x8005;&#x8868;&#x793A;&#xFF0C;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x6027;&#xFF0C;&#x8FC7;&#x53BB;&#x4E8C;&#x5341;&#x5E74;&#x6765;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x6709;&#x5982;&#x6B64;&#x591A;&#x7684;&#x521B;&#x65B0;&#xFF0C;&#x81EA;&#x7531;&#x5141;&#x8BB8;&#x521B;&#x5EFA;&#x6570;&#x5341;&#x79CD;&#x521B;&#x65B0;&#x7684;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#xFF0C;&#x5982;&#x8C37;&#x6B4C;&#xFF0C;Twitter&#xFF0C;Netflix&#xFF0C;&#x4E9A;&#x9A6C;&#x900A;&#xFF0C;Skype&#x7B49;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x4E3A;&#x65B0;&#x7F51;&#x7AD9;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4E86;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E2D;&#x5EFA;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x5E73;&#x7B49;&#x673A;&#x4F1A;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4ED6;&#x4EEC;&#x62C5;&#x5FC3;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x6027;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x5C06;&#x53D8;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x9002;&#x5408;&#x65B0;&#x516C;&#x53F8;&#x548C;&#x521B;&#x65B0;&#x7406;&#x5FF5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5927;&#x578B;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x5F00;&#x59CB;&#x4ECE;&#x89C6;&#x9891;&#x6D41;&#x5A92;&#x4F53;&#x7F51;&#x7AD9;&#x6536;&#x53D6;&#x989D;&#x5916;&#x8D39;&#x7528;&#x4EE5;&#x5411;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#xFF0C;&#x90A3;&#x4E48;&#x4E0E;&#x4E0B;&#x51E0;&#x4E2A;YouTube&#x7684;&#x6570;&#x5341;&#x4E2A;&#x7F51;&#x7EDC;&#x6240;&#x6709;&#x8005;&#x534F;&#x5546;&#x4EA4;&#x6613;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> 2015&#x5E74;2&#x6708;&#xFF0C; <strong>&#x8054;&#x90A6;&#x901A;&#x4FE1;&#x59D4;&#x5458;&#x4F1A;</strong> &#xFF08;FCC&#xFF09;&#x6279;&#x51C6;&#x4E86;&#x65B0;&#x7684;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x53EF;&#x4EE5;&#x50CF;&#x516C;&#x5171;&#x4E8B;&#x4E1A;&#x4E00;&#x6837;&#x89C4;&#x8303;&#x4E92;&#x8054;&#x7F51;&#x63A5;&#x5165;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x652F;&#x6301;&#x8005;&#x5BF9;&#x6B64;&#x63D0;&#x8BAE;&#x8868;&#x793A;&#x6B22;&#x8FCE;&#xFF0C;&#x4F46;&#x53CD;&#x5BF9;&#x8005;&#x79F0;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8FC7;&#x5EA6;&#x76D1;&#x7BA1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6CD5;&#x89C4;&#x4E5F;&#x9762;&#x4E34;&#x6CD5;&#x9662;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x56E0;&#x4E3A;&#x591A;&#x4E2A;&#x7535;&#x4FE1;&#x884C;&#x4E1A;&#x96C6;&#x56E2;&#x5DF2;&#x8D77;&#x8BC9;&#x505C;&#x6B62;&#x65B0;&#x89C4;&#x5219;&#xFF0C;&#x8BA4;&#x4E3A;&#x5B83;&#x4EEC;&#x8D85;&#x51FA;&#x4E86;FCC&#x7684;&#x6743;&#x5A01;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6211;&#x4EEC;&#x90FD;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C06;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x89C6;&#x4E3A;&#x76F8;&#x540C;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x56E0;&#x7528;&#x6237;&#xFF0C;&#x7F51;&#x7AD9;&#xFF0C;&#x5E73;&#x53F0;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x800C;&#x533A;&#x5206;&#x6216;&#x6536;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x8D39;&#x7528;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x65E0;&#x6CD5;&#x5E72;&#x6270;&#x7279;&#x5B9A;&#x7F51;&#x7AD9;&#x548C;&#x5728;&#x7EBF;&#x5185;&#x5BB9;&#x7684;&#x901F;&#x5EA6;&#x6216;&#x6536;&#x8D39;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> PS&#x6240;&#x63D0;&#x53CA;&#x7684;&#x6709;&#x5229;&#x4E8E;&#x7F51;&#x7EDC;&#x4E2D;&#x7ACB;&#x7684;&#x89C2;&#x70B9;&#x5B8C;&#x5168;&#x662F;&#x6211;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x56E0;&#x4E2A;&#x4EBA;&#x800C;&#x5F02;&#x3002;</span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><hr><hr><!-- .entry-meta --></div></body></html>