<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/23.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x865A;&#x62DF;&#x7535;&#x8DEF;&#x548C;&#x6570;&#x636E;&#x62A5;&#x7F51;&#x7EDC;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x63D0;&#x4F9B;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x670D;&#x52A1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x79F0;&#x4E3A;&#x865A;&#x62DF;&#x7535;&#x8DEF;&#xFF0C;&#x800C;&#x63D0;&#x4F9B;&#x65E0;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x79F0;&#x4E3A;&#x6570;&#x636E;&#x62A5;&#x7F51;&#x7EDC;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#x4E8E;&#x5148;&#x524D;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x56E0;&#x7279;&#x7F51;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x57FA;&#x4E8E;&#x7F51;&#x7EDC;&#x7EA7;&#x7684;&#x6570;&#x636E;&#x62A5;&#x7F51;&#x7EDC;&#xFF08;&#x65E0;&#x8FDE;&#x63A5;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x6E90;&#x5230;&#x76EE;&#x7684;&#x5730;&#x7684;&#x6240;&#x6709;&#x5206;&#x7EC4;&#x90FD;&#x4E0D;&#x9075;&#x5FAA;&#x76F8;&#x540C;&#x7684;&#x8DEF;&#x5F84;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FD9;&#x4E24;&#x4E2A;&#x6FC0;&#x70C8;&#x4E89;&#x8BBA;&#x7684;&#x4E3B;&#x9898;&#x4E4B;&#x95F4;&#x7684;&#x7A81;&#x51FA;&#x5DEE;&#x5F02;&#x662F;&#x4EC0;&#x4E48;&#xFF1A;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x865A;&#x62DF;&#x7535;&#x8DEF; - </strong></span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x662F;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B58;&#x5728;&#x7F13;&#x51B2;&#x533A;&#xFF0C;CPU&#xFF0C;&#x5E26;&#x5BBD;&#x7B49;&#x8D44;&#x6E90;&#x7684;&#x9884;&#x7559;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#x4E8E;&#x65B0;&#x8BBE;&#x7F6E;&#x7684;VC&#x5C06;&#x7531;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x4F1A;&#x8BDD;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x95F4;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x8FDB;&#x5165;&#x5E76;&#x4E3A;&#x540E;&#x7EED;&#x6570;&#x636E;&#x5305;&#x4FDD;&#x7559;&#x8D44;&#x6E90;&#xFF0C;&#x56E0;&#x6B64;&#x6574;&#x4E2A;&#x8FDE;&#x63A5;&#x65F6;&#x95F4;&#x9075;&#x5FAA;&#x76F8;&#x540C;&#x7684;&#x8DEF;&#x5F84;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x6240;&#x6709;&#x6570;&#x636E;&#x5305;&#x90FD;&#x5C06;&#x9075;&#x5FAA;&#x76F8;&#x540C;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x56E0;&#x6B64;&#x4EC5;&#x5BF9;&#x8FDE;&#x63A5;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x9700;&#x8981;&#x5168;&#x5C40;&#x6807;&#x5934;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5305;&#x901A;&#x5E38;&#x4E0D;&#x9700;&#x8981;&#x5168;&#x5C40;&#x6807;&#x5934;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x6570;&#x636E;&#x9075;&#x5FAA;&#x7279;&#x5B9A;&#x7684;&#x4E13;&#x7528;&#x8DEF;&#x5F84;&#xFF0C;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x5305;&#x4F1A;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4ECE;&#x4EE5;&#x4E0A;&#x51E0;&#x70B9;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;&#x865A;&#x62DF;&#x7535;&#x8DEF;&#x662F;&#x9AD8;&#x5EA6;&#x53EF;&#x9760;&#x7684;&#x4F20;&#x8F93;&#x624B;&#x6BB5;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x6BCF;&#x6B21;&#x5FC5;&#x987B;&#x5728;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x9884;&#x7559;&#x8D44;&#x6E90;&#x548C;&#x989D;&#x5916;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x6765;&#x8BBE;&#x7F6E;&#x65B0;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x5B9E;&#x73B0;&#x865A;&#x62DF;&#x7535;&#x8DEF;&#x7684;&#x6210;&#x672C;&#x975E;&#x5E38;&#x9AD8;&#x3002;</span> </li></ol><p> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6570;&#x636E;&#x62A5;&#x7F51;&#x7EDC;&#xFF1A;</strong></span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x662F;&#x65E0;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x4F1A;&#x8BDD;&#x7684;&#x4E13;&#x7528;&#x8DEF;&#x5F84;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;&#x9884;&#x7559;&#x8D44;&#x6E90;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6240;&#x6709;&#x6570;&#x636E;&#x5305;&#x90FD;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x8F6C;&#x5230;&#x4EFB;&#x4F55;&#x4E2D;&#x95F4;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x7684;&#x4EFB;&#x4F55;&#x8DEF;&#x5F84;&#xFF0C;&#x8BE5;&#x8DEF;&#x7531;&#x5668;&#x901A;&#x8FC7;&#x52A8;&#x6001;&#x66F4;&#x6539;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x7684;&#x8DEF;&#x7531;&#x8868;&#x6765;&#x51B3;&#x5B9A;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x90FD;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x9009;&#x62E9;&#x4EFB;&#x4F55;&#x8DEF;&#x5F84;&#xFF0C;&#x56E0;&#x6B64;&#x6240;&#x6709;&#x6570;&#x636E;&#x5305;&#x5FC5;&#x987B;&#x4E0E;&#x5177;&#x6709;&#x5173;&#x4E8E;&#x6E90;&#x548C;&#x4E0A;&#x5C42;&#x6570;&#x636E;&#x7684;&#x9002;&#x5F53;&#x4FE1;&#x606F;&#x7684;&#x62A5;&#x5934;&#x76F8;&#x5173;&#x8054;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x65E0;&#x8FDE;&#x63A5;&#x5C5E;&#x6027;&#x4F7F;&#x6570;&#x636E;&#x5305;&#x4EE5;&#x4EFB;&#x4F55;&#x987A;&#x5E8F;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x65E0;&#x9700;&#x6309;&#x7167;&#x53D1;&#x9001;&#x987A;&#x5E8F;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6570;&#x636E;&#x62A5;&#x7F51;&#x7EDC;&#x4F5C;&#x4E3A;&#x865A;&#x62DF;&#x7535;&#x8DEF;&#x4E0D;&#x53EF;&#x9760;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x62A5;&#x7F51;&#x7EDC;&#x603B;&#x662F;&#x5BB9;&#x6613;&#x4E14;&#x6210;&#x672C;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x65F6;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x9884;&#x7559;&#x8D44;&#x6E90;&#x548C;&#x4E13;&#x7528;&#x3002;</span> </li></ol><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>