<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/60.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8DEF;&#x7531;&#x7B97;&#x6CD5;&#x7684;&#x5206;&#x7C7B;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5148;&#x51B3;&#x6761;&#x4EF6; - <a href="https://www.geeksforgeeks.org/computer-network-fixed-flooding-routing-algorithms/" rel="noopener" target="_blank">&#x56FA;&#x5B9A;&#x548C;&#x6CDB;&#x6D2A;&#x8DEF;&#x7531;&#x7B97;&#x6CD5;</a></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8DEF;&#x7531;</strong>&#x662F;&#x5EFA;&#x7ACB;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x5FC5;&#x987B;&#x9075;&#x5FAA;&#x7684;<strong>&#x8DEF;&#x7531;</strong>&#x7684;&#x8FC7;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x8DEF;&#x7531;&#x8868;&#x8868;&#xFF0C;&#x5176;&#x5305;&#x542B;&#x5173;&#x4E8E;&#x6570;&#x636E;&#x5206;&#x7EC4;&#x9075;&#x5FAA;&#x7684;&#x8DEF;&#x7531;&#x7684;&#x4FE1;&#x606F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5404;&#x79CD;&#x8DEF;&#x7531;&#x7B97;&#x6CD5;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x9700;&#x8981;&#x5C06;&#x4F20;&#x5165;&#x6570;&#x636E;&#x5206;&#x7EC4;&#x4F20;&#x8F93;&#x5230;&#x54EA;&#x4E2A;&#x8DEF;&#x7531;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x8DEF;&#x7531;&#x7B97;&#x6CD5;&#x7684;&#x5206;&#x7C7B;&#xFF1A;</b>&#x8DEF;&#x7531;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5206;&#x7C7B;&#x5982;&#x4E0B;&#xFF1A;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>1.&#x81EA;&#x9002;&#x5E94;&#x7B97;&#x6CD5; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E9B;&#x662F;&#x5728;&#x7F51;&#x7EDC;&#x62D3;&#x6251;&#x6216;&#x6D41;&#x91CF;&#x8D1F;&#x8F7D;&#x53D8;&#x5316;&#x65F6;&#x66F4;&#x6539;&#x5176;&#x8DEF;&#x7531;&#x51B3;&#x7B56;&#x7684;&#x7B97;&#x6CD5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8DEF;&#x7531;&#x51B3;&#x7B56;&#x7684;&#x53D8;&#x5316;&#x53CD;&#x6620;&#x5728;&#x62D3;&#x6251;&#x4EE5;&#x53CA;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E5F;&#x79F0;&#x4E3A;&#x52A8;&#x6001;&#x8DEF;&#x7531;&#xFF0C;&#x5B83;&#x4EEC;&#x5229;&#x7528;&#x52A8;&#x6001;&#x4FE1;&#x606F;&#xFF08;&#x5982;&#x5F53;&#x524D;&#x62D3;&#x6251;&#xFF0C;&#x8D1F;&#x8F7D;&#xFF0C;&#x5EF6;&#x8FDF;&#x7B49;&#xFF09;&#x6765;&#x9009;&#x62E9;&#x8DEF;&#x7531;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F18;&#x5316;&#x53C2;&#x6570;&#x662F;&#x8DDD;&#x79BB;&#xFF0C;&#x8DF3;&#x6570;&#x548C;&#x4F30;&#x8BA1;&#x7684;&#x4F20;&#x8F93;&#x65F6;&#x95F4;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E9B;&#x5206;&#x7C7B;&#x5982;&#x4E0B;&#xFF1A;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;a&#xFF09;&#x9694;&#x79BB; -</strong>&#x5728;&#x6B64;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4F7F;&#x7528;&#x5176;&#x62E5;&#x6709;&#x7684;&#x4FE1;&#x606F;&#x505A;&#x51FA;&#x8DEF;&#x7531;&#x51B3;&#x7B56;&#xFF0C;&#x800C;&#x4E0D;&#x4ECE;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53D1;&#x9001;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x5173;&#x4E8E;&#x7279;&#x5B9A;&#x94FE;&#x8DEF;&#x72B6;&#x6001;&#x7684;&#x4FE1;&#x606F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F3A;&#x70B9;&#x662F;&#x5206;&#x7EC4;&#x53EF;&#x80FD;&#x901A;&#x8FC7;&#x62E5;&#x585E;&#x7684;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5EF6;&#x8FDF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x793A;&#x4F8B;&#xFF1A;&#x70ED;&#x571F;&#x8C46;&#x8DEF;&#x7531;&#xFF0C;&#x5411;&#x540E;&#x5B66;&#x4E60;&#x3002;</span> </li><p></p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;b&#xFF09;&#x96C6;&#x4E2D;&#x5F0F; -</strong>&#x5728;&#x6B64;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x96C6;&#x4E2D;&#x5F0F;&#x8282;&#x70B9;&#x5177;&#x6709;&#x5173;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x5168;&#x90E8;&#x4FE1;&#x606F;&#x5E76;&#x505A;&#x51FA;&#x6240;&#x6709;&#x8DEF;&#x7531;&#x51B3;&#x7B56;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6765;&#x4FDD;&#x6301;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x7F3A;&#x70B9;&#x662F;&#x5982;&#x679C;&#x4E2D;&#x592E;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x3002;</span> </li><p></p><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;c&#xFF09;&#x5206;&#x5E03;&#x5F0F; -</strong>&#x5728;&#x6B64;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x8282;&#x70B9;&#x4ECE;&#x5176;&#x90BB;&#x5C45;&#x63A5;&#x6536;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x51B3;&#x5B9A;&#x8DEF;&#x7531;&#x6570;&#x636E;&#x5305;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F3A;&#x70B9;&#x662F;&#x5982;&#x679C;&#x5728;&#x63A5;&#x6536;&#x4FE1;&#x606F;&#x548C;&#x53D1;&#x9001;&#x5206;&#x7EC4;&#x7684;&#x95F4;&#x9694;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x5219;&#x5206;&#x7EC4;&#x53EF;&#x80FD;&#x88AB;&#x5EF6;&#x8FDF;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>2.&#x975E;&#x81EA;&#x9002;&#x5E94;&#x7B97;&#x6CD5; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x4E00;&#x65E6;&#x88AB;&#x9009;&#x4E2D;&#x5C31;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x5B83;&#x4EEC;&#x7684;&#x8DEF;&#x7531;&#x51B3;&#x7B56;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E5F;&#x79F0;&#x4E3A;&#x9759;&#x6001;&#x8DEF;&#x7531;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x8DEF;&#x7531;&#x5668;&#x542F;&#x52A8;&#x65F6;&#x9884;&#x5148;&#x8BA1;&#x7B97;&#x8981;&#x91C7;&#x7528;&#x7684;&#x8DEF;&#x7531;&#x5E76;&#x4E0B;&#x8F7D;&#x5230;&#x8DEF;&#x7531;&#x5668;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E9B;&#x5206;&#x7C7B;&#x5982;&#x4E0B;&#xFF1A;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;a&#xFF09;&#x6CDB;&#x6D2A; -</strong>&#x8FD9;&#x9002;&#x7528;&#x4E8E;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x6570;&#x636E;&#x5305;&#x5728;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x7EBF;&#x8DEF;&#x4E0A;&#x53D1;&#x9001;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x9664;&#x4E86;&#x5B83;&#x5230;&#x8FBE;&#x4E4B;&#x5916;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E0E;&#x6B64;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5206;&#x7EC4;&#x53EF;&#x80FD;&#x8FDB;&#x5165;&#x5FAA;&#x73AF;&#xFF0C;&#x5E76;&#x4E14;&#x56E0;&#x6B64;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x91CD;&#x590D;&#x7684;&#x5206;&#x7EC4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x501F;&#x52A9;&#x5E8F;&#x5217;&#x53F7;&#xFF0C;&#x8DF3;&#x6570;&#x548C;&#x751F;&#x6210;&#x6811;&#x53EF;&#x4EE5;&#x514B;&#x670D;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;</span> </li><p></p><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;b&#xFF09;&#x968F;&#x673A;&#x6E38;&#x8D70; -</strong>&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x7531;&#x4E3B;&#x673A;&#x6216;&#x8282;&#x70B9;&#x9010;&#x4E2A;&#x4E3B;&#x673A;&#x5730;&#x53D1;&#x9001;&#x5230;&#x5176;&#x90BB;&#x5C45;&#x4E4B;&#x4E00;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x5065;&#x58EE;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x5C06;&#x6570;&#x636E;&#x5305;&#x53D1;&#x9001;&#x5230;&#x6700;&#x5C11;&#x6392;&#x961F;&#x7684;&#x94FE;&#x8DEF;&#x6765;&#x5B9E;&#x73B0;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x8DEF;&#x7531;v / s&#x6CDB;&#x6EE5;&#xFF1A;</b></span> </p><p><img src="../../../imgs/net/2ea80d169fcec5149ae032325254d97e.jpg" alt="" width="641" height="257" class="aligncenter size-full wp-image-401700"></p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><hr><hr><!-- .entry-meta --></div></body></html>