<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/net/95.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x804C;&#x8D23;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5148;&#x51B3;&#x6761;&#x4EF6; - <a href="https://www.geeksforgeeks.org/layers-osi-model/" rel="noopener" target="_blank">OSI&#x6A21;&#x578B;&#x5C42;</a></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x662F;TCP / IP&#x6A21;&#x578B;&#x7684;&#x7B2C;&#x56DB;&#x5C42;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x662F;&#x7528;&#x4E8E;&#x5411;&#x4E3B;&#x673A;&#x4F20;&#x9012;&#x6D88;&#x606F;<b>&#x7684;&#x7AEF;&#x5230;&#x7AEF;</b>&#x5C42;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x88AB;&#x79F0;&#x4E3A;&#x7AEF;&#x5230;&#x7AEF;&#x5C42;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x6E90;&#x4E3B;&#x673A;&#x548C;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x4E4B;&#x95F4;&#x63D0;&#x4F9B;&#x70B9;&#x5BF9;&#x70B9;&#x8FDE;&#x63A5;<b>&#x800C;&#x4E0D;&#x662F;</b>&#x8DF3;&#x5230;&#x8DF3;&#xFF0C;&#x4EE5;&#x53EF;&#x9760;&#x5730;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5C01;&#x88C5;&#x5355;&#x4F4D;&#x662F;&#x4E00;&#x4E2A;&#x6BB5;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x7528;&#x4E8E;&#x589E;&#x5F3A;&#x5176;&#x529F;&#x80FD;&#x7684;&#x6807;&#x51C6;&#x534F;&#x8BAE;&#x662F;&#xFF1A;TCP&#xFF08;&#x4F20;&#x8F93;&#x63A7;&#x5236;&#x534F;&#x8BAE;&#xFF09;&#xFF0C;UDP&#xFF08;&#x7528;&#x6237;&#x6570;&#x636E;&#x62A5;&#x534F;&#x8BAE;&#xFF09;&#xFF0C;DCCP&#xFF08;&#x6570;&#x636E;&#x62A5;&#x62E5;&#x585E;&#x63A7;&#x5236;&#x534F;&#x8BAE;&#xFF09;&#x7B49;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x7684;&#x5404;&#x79CD;&#x804C;&#x8D23; - </span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x6D41;&#x7A0B;&#x4EA4;&#x4ED8;&#x6D41;&#x7A0B; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x867D;&#x7136;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x8981;&#x6C42;&#x6E90; - &#x76EE;&#x6807;&#x4E3B;&#x673A;&#x7684;MAC&#x5730;&#x5740;&#xFF08;&#x6BCF;&#x53F0;&#x4E3B;&#x673A;&#x7684;&#x7F51;&#x7EDC;&#x63A5;&#x53E3;&#x5361;&#x4E2D;&#x5305;&#x542B;&#x7684;48&#x4F4D;&#x5730;&#x5740;&#xFF09;&#x6B63;&#x786E;&#x4F20;&#x9001;&#x5E27;&#xFF0C;&#x4F46;&#x7F51;&#x7EDC;&#x5C42;&#x9700;&#x8981;IP&#x5730;&#x5740;&#x4EE5;&#x4FBF;&#x4EE5;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x6570;&#x636E;&#x5305;&#x8DEF;&#x7531;&#x4F20;&#x8F93;&#x5C42;&#x9700;&#x8981;&#x7AEF;&#x53E3;&#x53F7;&#x624D;&#x80FD;&#x5728;&#x7279;&#x5B9A;&#x4E3B;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x6B63;&#x786E;&#x5730;&#x5C06;&#x6570;&#x636E;&#x6BB5;&#x4F20;&#x9012;&#x7ED9;&#x6B63;&#x786E;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x7AEF;&#x53E3;&#x53F7;</b>&#x662F;&#x4E00;&#x4E2A;16&#x4F4D;&#x5730;&#x5740;&#xFF0C;&#x7528;&#x4E8E;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4EFB;&#x4F55;&#x5BA2;&#x6237;&#x7AEF; - &#x670D;&#x52A1;&#x5668;&#x7A0B;&#x5E8F;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x4E3B;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x7AEF;&#x5230;&#x7AEF;&#x8FDE;&#x63A5; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x8FD8;&#x8D1F;&#x8D23;&#x5728;&#x4E3B;&#x673A;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x4E3B;&#x8981;&#x4F7F;&#x7528;TCP&#x548C;UDP&#x7684;&#x7AEF;&#x5230;&#x7AEF;&#x8FDE;&#x63A5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> TCP&#x662F;&#x4E00;&#x79CD;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x63E1;&#x624B;&#x534F;&#x8BAE;&#x5728;&#x4E24;&#x4E2A;&#x7EC8;&#x7AEF;&#x4E3B;&#x673A;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x7A33;&#x5065;&#x7684;&#x8FDE;&#x63A5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> TCP&#x786E;&#x4FDD;&#x53EF;&#x9760;&#x7684;&#x6D88;&#x606F;&#x4F20;&#x9012;&#xFF0C;&#x5E76;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;UDP&#x662F;&#x4E00;&#x79CD;&#x65E0;&#x72B6;&#x6001;&#x4E14;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x53EF;&#x786E;&#x4FDD;&#x5C3D;&#x529B;&#x4EA4;&#x4ED8;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x9002;&#x7528;&#x4E8E;&#x51E0;&#x4E4E;&#x4E0D;&#x5173;&#x5FC3;&#x6D41;&#x91CF;&#x6216;&#x9519;&#x8BEF;&#x63A7;&#x5236;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x53D1;&#x9001;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x89C6;&#x9891;&#x4F1A;&#x8BAE;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x7ECF;&#x5E38;&#x7528;&#x4E8E;&#x591A;&#x64AD;&#x534F;&#x8BAE;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x591A;&#x8DEF;&#x590D;&#x7528;&#x548C;&#x591A;&#x8DEF;&#x5206;&#x89E3; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x8DEF;&#x590D;&#x7528;&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x5728;&#x4E3B;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x7F51;&#x7EDC;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x540C;&#x65F6;&#x4ECE;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D1;&#x9001;&#x6570;&#x636E;&#x5305;&#x6D41;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x63A5;&#x53D7;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x8FDB;&#x7A0B;&#x7684;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x7531;&#x7AEF;&#x53E3;&#x53F7;&#x533A;&#x5206;&#xFF0C;&#x5E76;&#x5728;&#x6DFB;&#x52A0;&#x9002;&#x5F53;&#x7684;&#x5934;&#x540E;&#x5C06;&#x5B83;&#x4EEC;&#x4F20;&#x9012;&#x5230;&#x7F51;&#x7EDC;&#x5C42;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5728;&#x63A5;&#x6536;&#x5668;&#x4FA7;&#x9700;&#x8981;&#x89E3;&#x590D;&#x7528;&#x4EE5;&#x83B7;&#x5F97;&#x6765;&#x81EA;&#x5404;&#x79CD;&#x8FC7;&#x7A0B;&#x7684;&#x6570;&#x636E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x4ECE;&#x7F51;&#x7EDC;&#x5C42;&#x63A5;&#x6536;&#x6570;&#x636E;&#x6BB5;&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x5230;&#x5728;&#x63A5;&#x6536;&#x8005;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x9002;&#x5F53;&#x8FDB;&#x7A0B;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x62E5;&#x585E;&#x63A7;&#x5236; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x62E5;&#x585E;&#x662F;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5176;&#x4E2D;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x592A;&#x591A;&#x6E90;&#x5C1D;&#x8BD5;&#x53D1;&#x9001;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x8DEF;&#x7531;&#x5668;&#x7F13;&#x51B2;&#x533A;&#x7531;&#x4E8E;&#x53D1;&#x751F;&#x4E22;&#x5305;&#x800C;&#x5F00;&#x59CB;&#x6EA2;&#x51FA;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7ED3;&#x679C;&#xFF0C;&#x6765;&#x81EA;&#x6E90;&#x7684;&#x5206;&#x7EC4;&#x7684;&#x91CD;&#x4F20;&#x8FDB;&#x4E00;&#x6B65;&#x589E;&#x52A0;&#x4E86;&#x62E5;&#x585E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F20;&#x8F93;&#x5C42;&#x4EE5;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;&#x62E5;&#x585E;&#x63A7;&#x5236;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x4F7F;&#x7528;<b>&#x5F00;&#x73AF;</b>&#x62E5;&#x585E;&#x63A7;&#x5236;&#x6765;&#x9632;&#x6B62;&#x62E5;&#x585E;&#x548C;<b>&#x95ED;&#x73AF;</b>&#x62E5;&#x585E;&#x63A7;&#x5236;&#xFF0C;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x53D1;&#x751F;&#x65F6;&#x6D88;&#x9664;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x62E5;&#x585E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> TCP&#x63D0;&#x4F9B;AIMD-&#x52A0;&#x6CD5;&#x589E;&#x52A0;&#x4E58;&#x6CD5;&#x51CF;&#x5C11;&#xFF0C;&#x6F0F;&#x6876;&#x6280;&#x672F;&#x7528;&#x4E8E;&#x62E5;&#x585E;&#x63A7;&#x5236;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x7EA0;&#x9519; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x4F7F;&#x7528;&#x9519;&#x8BEF;&#x68C0;&#x6D4B;&#x4EE3;&#x7801;&#x68C0;&#x67E5;&#x6765;&#x81EA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C42;&#x7684;&#x6D88;&#x606F;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x8BA1;&#x7B97;&#x6821;&#x9A8C;&#x548C;&#xFF0C;&#x68C0;&#x67E5;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x5426;&#x672A;&#x635F;&#x574F;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;ACK&#x548C;NACK&#x670D;&#x52A1;&#x901A;&#x77E5;&#x53D1;&#x9001;&#x65B9;&#x6570;&#x636E;&#x662F;&#x5426;&#x5230;&#x8FBE;&#x5E76;&#x68C0;&#x67E5;&#x4E3A;&#x4E86;&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x6D41;&#x91CF;&#x63A7;&#x5236; -</b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F20;&#x8F93;&#x5C42;&#x5728;TCP / IP&#x6A21;&#x578B;&#x7684;&#x76F8;&#x90BB;&#x5C42;&#x4E4B;&#x95F4;&#x63D0;&#x4F9B;&#x6D41;&#x63A7;&#x5236;&#x673A;&#x5236;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> TCP&#x8FD8;&#x901A;&#x8FC7;&#x5F3A;&#x52A0;&#x4E00;&#x4E9B;&#x6D41;&#x63A7;&#x5236;&#x6280;&#x672F;&#x6765;&#x9632;&#x6B62;&#x7531;&#x4E8E;&#x5FEB;&#x901F;&#x53D1;&#x9001;&#x5668;&#x548C;&#x6162;&#x901F;&#x63A5;&#x6536;&#x5668;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x6570;&#x636E;&#x4E22;&#x5931;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x4F7F;&#x7528;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x534F;&#x8BAE;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x7531;&#x63A5;&#x6536;&#x5668;&#x901A;&#x8FC7;&#x5411;&#x53D1;&#x9001;&#x5668;&#x53D1;&#x56DE;&#x7A97;&#x53E3;&#x6765;&#x901A;&#x77E5;&#x5B83;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x7684;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x6765;&#x5B8C;&#x6210;&#x3002;</span> </li></ul><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><div></div><!-- .entry-meta --></div></body></html>