<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/arch/23.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5B58;&#x50A8;&#x5668;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p style="text-align: justify"></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;CPU&#x5FC5;&#x987B;&#x6839;&#x636E;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x63D0;&#x53D6;&#x901F;&#x5EA6;&#x4ECE;CPU&#x7684;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x901F;&#x5EA6;&#x83B7;&#x53D6;&#x6307;&#x4EE4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> CPU&#x5305;&#x542B;&#x5177;&#x6709;&#x6700;&#x5FEB;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7684;&#x6570;&#x91CF;&#x6709;&#x9650;&#x4E14;&#x6210;&#x672C;&#x9AD8;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F13;&#x5B58;&#x66F4;&#x4FBF;&#x5B9C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7F13;&#x5B58;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x9AD8;&#x901F;&#x7684;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x4F4D;&#x4E8E;CPU&#x548C;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E4B;&#x95F4;&#xFF0C;&#x4EE5;CPU&#x7684;&#x901F;&#x5EA6;&#x8FD0;&#x884C;&#x3002;</span> </p><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x7528;&#x4E8E;&#x51CF;&#x5C11;&#x4ECE;<a href="https://en.wikipedia.org/wiki/Main_memory">&#x4E3B;&#x5B58;&#x50A8;&#x5668;</a>&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x7684;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x662F;&#x66F4;&#x5C0F;&#x66F4;&#x5FEB;&#x7684;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x5176;&#x5B58;&#x50A8;&#x6765;&#x81EA;&#x5E38;&#x7528;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x636E;&#x7684;&#x526F;&#x672C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5927;&#x591A;&#x6570;CPU&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x72EC;&#x7ACB;&#x7F13;&#x5B58;&#xFF0C;&#x5305;&#x62EC;&#x6307;&#x4EE4;&#x548C;&#x6570;&#x636E;&#x3002;</span> </p><p> <a href="https://cdncontribute.geeksforgeeks.org/wp-content/uploads/cache.png"><img class="aligncenter size-full wp-image-21606" src="../../../imgs/arch/3b07bc19e74773a700358b0240c8167f.jpg" alt="CM1" width="763" height="270"></a> </p><h4 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BB0;&#x5FC6;&#x6C34;&#x5E73; - </span> </h4><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x7EA7;&#x522B;1&#x6216;&#x5BC4;&#x5B58;&#x5668; -</b>&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5B58;&#x50A8;&#x548C;&#x63A5;&#x53D7;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x5B83;&#x4EEC;&#x7ACB;&#x5373;&#x5B58;&#x50A8;&#x5728;CPU&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6700;&#x5E38;&#x7528;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x662F;&#x7D2F;&#x52A0;&#x5668;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x5730;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x7B49;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x7EA7;&#x522B;2&#x6216;&#x9AD8;&#x901F;&#x7F13;&#x5B58; -</b>&#x8FD9;&#x662F;&#x6700;&#x5FEB;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x5177;&#x6709;&#x66F4;&#x5FEB;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#xFF0C;&#x4E34;&#x65F6;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x4EE5;&#x4FBF;&#x66F4;&#x5FEB;&#x5730;&#x8BBF;&#x95EE;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>3&#x7EA7;&#x6216;&#x4E3B;&#x5185;&#x5B58; -</b>&#x5B83;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x5F88;&#x5C0F;&#xFF0C;&#x4E00;&#x65E6;&#x7535;&#x6E90;&#x5173;&#x95ED;&#xFF0C;&#x6570;&#x636E;&#x4E0D;&#x518D;&#x4FDD;&#x7559;&#x5728;&#x6B64;&#x5185;&#x5B58;&#x4E2D;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>4&#x7EA7;&#x6216;&#x6B21;&#x7EA7;&#x5B58;&#x50A8;&#x5668; -</b>&#x5916;&#x90E8;&#x5B58;&#x50A8;&#x5668;&#x4E0D;&#x5982;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x5FEB;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x6C38;&#x4E45;&#x4FDD;&#x7559;&#x5728;&#x8BE5;&#x5B58;&#x50A8;&#x5668;&#x4E2D;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7F13;&#x5B58;&#x6027;&#x80FD;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x5904;&#x7406;&#x5668;&#x9700;&#x8981;&#x5728;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x4F4D;&#x7F6E;&#x65F6;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x76F8;&#x5E94;&#x6761;&#x76EE;&#x3002;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x5904;&#x7406;&#x5668;&#x53D1;&#x73B0;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x5219;&#x53D1;&#x751F;<strong>&#x7F13;&#x5B58;&#x547D;&#x4E2D;</strong>&#x5E76;&#x4ECE;chache&#x8BFB;&#x53D6;&#x6570;&#x636E;</span> </li><li style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x5904;&#x7406;&#x5668;<strong>&#x672A;</strong>&#x5728;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x627E;&#x5230;&#x5B58;&#x50A8;&#x5668;&#x4F4D;&#x7F6E;&#xFF0C;&#x5219;&#x53D1;&#x751F;<strong>&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x672A;&#x547D;&#x4E2D;</strong> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#x4E8E;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x672A;&#x547D;&#x4E2D;&#xFF0C;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5206;&#x914D;&#x65B0;&#x6761;&#x76EE;&#x5E76;&#x4ECE;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x590D;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x5185;&#x5BB9;&#x6EE1;&#x8DB3;&#x8BE5;&#x8BF7;&#x6C42;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9AD8;&#x901F;&#x7F13;&#x51B2;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x6027;&#x80FD;&#x901A;&#x5E38;&#x6839;&#x636E;&#x79F0;&#x4E3A;<strong>&#x547D;&#x4E2D;&#x7387;</strong>&#x7684;&#x91CF;&#x6765;&#x6D4B;&#x91CF;<strong>&#x3002;</strong></span> </p><pre> <span class="pre-span" style="direction: ltr; text-align: left">Hit ratio = hit / (hit + miss) = no.</span> <span class="pre-span" style="direction: ltr; text-align: left">of hits/total accesses</span> </pre><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x66F4;&#x9AD8;&#x7684;&#x7F13;&#x5B58;&#x5757;&#x5927;&#x5C0F;&#xFF0C;&#x66F4;&#x9AD8;&#x7684;&#x5173;&#x8054;&#x6027;&#xFF0C;&#x964D;&#x4F4E;&#x9519;&#x5931;&#x7387;&#xFF0C;&#x51CF;&#x5C11;&#x9519;&#x5931;&#x60E9;&#x7F5A;&#x4EE5;&#x53CA;&#x51CF;&#x5C11;&#x51CF;&#x5C11;&#x7F13;&#x5B58;&#x547D;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x63D0;&#x9AD8;&#x7F13;&#x5B58;&#x6027;&#x80FD;&#x3002;</span> </p><h4 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F13;&#x5B58;&#x6620;&#x5C04;</span> </h4><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7528;&#x4E8E;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6620;&#x5C04;&#x5982;&#x4E0B;&#xFF0C;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x76F4;&#x63A5;&#x6620;&#x5C04;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5173;&#x8054;&#x6620;&#x5C04;&#xFF0C;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x96C6;&#x5173;&#x8054;&#x6620;&#x5C04;&#x3002;</span> </li></ul><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x76F4;&#x63A5;&#x6620;&#x5C04;</strong> &#xFF1A;&#x5728;&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x4E2D;&#x5C06;&#x6BCF;&#x4E2A;&#x5185;&#x5B58;&#x5757;&#x5206;&#x914D;&#x7ED9;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x7279;&#x5B9A;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x5728;&#x9700;&#x8981;&#x52A0;&#x8F7D;&#x65B0;&#x5757;&#x65F6;&#x5148;&#x524D;&#x7531;&#x5185;&#x5B58;&#x5757;&#x5360;&#x7528;&#x4E86;&#x4E00;&#x884C;&#xFF0C;&#x5219;&#x65E7;&#x5757;&#x5C06;&#x88AB;&#x5220;&#x9664;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x5206;&#x4E3A;&#x7D22;&#x5F15;&#x5B57;&#x6BB5;&#x548C;&#x6807;&#x8BB0;&#x5B57;&#x6BB5;&#x4E24;&#x90E8;&#x5206;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F13;&#x5B58;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x6807;&#x8BB0;&#x5B57;&#x6BB5;&#xFF0C;&#x800C;&#x5176;&#x4F59;&#x7F13;&#x5B58;&#x5B58;&#x50A8;&#x5728;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x7684;&#x6027;&#x80FD;&#x4E0E;&#x547D;&#x4E2D;&#x7387;&#x6210;&#x6B63;&#x6BD4;&#x3002;</span> <strong><br><img class="aligncenter size-full wp-image-21607" src="../../../imgs/arch/d1ce9120b4dd6b8ca637d0f986488853.jpg" alt="&#x5E73;&#x65B9;&#x5398;&#x7C73;" width="568" height="382"></strong> </p><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5173;&#x8054;&#x6620;&#x5C04;</strong> &#xFF1A;&#x5728;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6620;&#x5C04;&#x4E2D;&#xFF0C;&#x5173;&#x8054;&#x5B58;&#x50A8;&#x5668;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#x5E76;&#x5BFB;&#x5740;&#x5B58;&#x50A8;&#x5668;&#x5B57;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4EFB;&#x4F55;&#x5757;&#x90FD;&#x53EF;&#x4EE5;&#x8FDB;&#x5165;&#x7F13;&#x5B58;&#x7684;&#x4EFB;&#x4F55;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5355;&#x8BCD;id&#x4F4D;&#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x5757;&#x4E2D;&#x9700;&#x8981;&#x54EA;&#x4E2A;&#x5B57;&#xFF0C;&#x4F46;&#x6807;&#x8BB0;&#x53D8;&#x4E3A;&#x6240;&#x6709;&#x5269;&#x4F59;&#x4F4D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x5355;&#x8BCD;&#x90FD;&#x53EF;&#x4EE5;&#x653E;&#x7F6E;&#x5728;&#x9AD8;&#x901F;&#x7F13;&#x51B2;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4F4D;&#x7F6E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6700;&#x5FEB;&#xFF0C;&#x6700;&#x7075;&#x6D3B;&#x7684;&#x6620;&#x5C04;&#x5F62;&#x5F0F;&#x3002;</span> </p><p><img class="aligncenter size-full wp-image-21608" src="../../../imgs/arch/eae08e9ef2d82c6d3f6337d4a2348113.jpg" alt="&#x7ACB;&#x65B9;&#x5398;&#x7C73;" width="465" height="393"></p><p style="text-align: justify"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x96C6;&#x5173;&#x8054;&#x6620;&#x5C04;</strong> &#xFF1A;&#x8FD9;&#x79CD;&#x6620;&#x5C04;&#x5F62;&#x5F0F;&#x662F;&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x7684;&#x589E;&#x5F3A;&#x5F62;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;&#x5220;&#x9664;&#x4E86;&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x7684;&#x7F3A;&#x70B9;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BBE;&#x7F6E;&#x5173;&#x8054;&#x89E3;&#x51B3;&#x4E86;&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x65B9;&#x6CD5;&#x4E2D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x98A0;&#x7C38;&#x7684;&#x95EE;&#x9898;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x53EA;&#x6709;&#x4E00;&#x884C;&#x53EF;&#x4EE5;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x51E0;&#x884C;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<strong><em>&#x96C6;&#x5408;</em></strong> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x540E;&#xFF0C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5757;&#x53EF;&#x4EE5;&#x6620;&#x5C04;&#x5230;&#x7279;&#x5B9A;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x884C;&#x3002;&#x96C6;&#x5408;&#x5173;&#x8054;&#x6620;&#x5C04;&#x5141;&#x8BB8;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x5728;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x53EF;&#x4EE5;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x4E2A;&#x5355;&#x8BCD;&#x7528;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x7D22;&#x5F15;&#x5730;&#x5740;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x96C6;&#x5408;&#x5173;&#x8054;&#x7F13;&#x5B58;&#x6620;&#x5C04;&#x7ED3;&#x5408;&#x4E86;&#x6700;&#x4F73;&#x7684;&#x76F4;&#x63A5;&#x7F13;&#x5B58;&#x6620;&#x5C04;&#x6280;&#x672F;&#x548C;&#x5173;&#x8054;&#x7F13;&#x5B58;&#x6620;&#x5C04;&#x6280;&#x672F;</span> <img class="aligncenter size-full wp-image-21609" src="../../../imgs/arch/1b5b0919f6edcaa5ec9a15e950b81ca9.jpg" alt="CM4" width="669" height="382"></p><p style="text-align: center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x793A;&#x4F8B;GATE&#x95EE;&#x9898;</strong></span> </p><h4 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F13;&#x5B58;&#x7684;&#x4F7F;&#x7528;</span> </h4><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x5E38;&#xFF0C;&#x9AD8;&#x901F;&#x7F13;&#x51B2;&#x5B58;&#x50A8;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x5B58;&#x50A8;&#x5408;&#x7406;&#x6570;&#x91CF;&#x7684;&#x5757;&#xFF0C;&#x4F46;&#x662F;&#x4E0E;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7684;&#x5757;&#x603B;&#x6570;&#x76F8;&#x6BD4;&#xFF0C;&#x8BE5;&#x6570;&#x91CF;&#x8F83;&#x5C0F;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x5757;&#x548C;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x90A3;&#x4E9B;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x7531;&#x6620;&#x5C04;&#x51FD;&#x6570;&#x6307;&#x5B9A;&#x3002;</span> </li></ol><h4 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F13;&#x5B58;&#x7C7B;&#x578B;</span> </h4><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x4E3B;&#x7F13;&#x5B58; -</b>&#x4E3B;&#x7F13;&#x5B58;&#x59CB;&#x7EC8;&#x4F4D;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x82AF;&#x7247;&#x4E0A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B64;&#x7F13;&#x5B58;&#x5F88;&#x5C0F;&#xFF0C;&#x5176;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x4E0E;&#x5904;&#x7406;&#x5668;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x76F8;&#x5F53;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x8F85;&#x52A9;&#x7F13;&#x5B58; -</b>&#x8F85;&#x52A9;&#x7F13;&#x5B58;&#x4F4D;&#x4E8E;&#x4E3B;&#x7F13;&#x5B58;&#x548C;&#x5185;&#x5B58;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E4B;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x88AB;&#x79F0;&#x4E3A;2&#x7EA7;&#xFF08;L2&#xFF09;&#x7F13;&#x5B58;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x5E38;&#xFF0C;2&#x7EA7;&#x7F13;&#x5B58;&#x4E5F;&#x4F4D;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x82AF;&#x7247;&#x4E0A;&#x3002;</span> </li><h4 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53C2;&#x8003;&#x5730;&#x70B9;</span> </h4><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x4E0E;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x76F8;&#x6BD4;&#xFF0C;&#x9AD8;&#x901F;&#x7F13;&#x51B2;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x5927;&#x5C0F;&#x8F83;&#x5C0F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x8981;&#x68C0;&#x67E5;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x54EA;&#x4E2A;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x88AB;&#x8D4B;&#x4E88;&#x4F18;&#x5148;&#x7EA7;&#x5E76;&#x4E14;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x52A0;&#x8F7D;&#x662F;&#x57FA;&#x4E8E;&#x5F15;&#x7528;&#x7684;&#x5C40;&#x90E8;&#x6027;&#x6765;&#x786E;&#x5B9A;&#x7684;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x53C2;&#x8003;&#x5730;&#x70B9;&#x7684;&#x7C7B;&#x578B;</b></span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7A7A;&#x95F4;&#x53C2;&#x8003;&#x7684;&#x5C40;&#x90E8;&#x6027;</strong> - &#x8FD9;&#x8868;&#x793A;&#x5143;&#x7D20;&#x6709;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E8E;&#x9760;&#x8FD1;&#x53C2;&#x8003;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E0B;&#x6B21;&#x5982;&#x679C;&#x518D;&#x6B21;&#x641C;&#x7D22;&#x5219;&#x66F4;&#x63A5;&#x8FD1;&#x53C2;&#x8003;&#x70B9;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x53C2;&#x8003;&#x7684;&#x65F6;&#x95F4;&#x5C40;&#x90E8;&#x6027;</strong> - &#x5728;&#x6B64;&#x81F3;&#x5C11;&#x4F7F;&#x7528;&#x6700;&#x8FD1;&#x4F7F;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53EA;&#x8981;&#x5728;&#x5355;&#x8BCD;&#x5185;&#x53D1;&#x751F;&#x9875;&#x9762;&#x9519;&#x8BEF;&#xFF0C;&#x4E0D;&#x4EC5;&#x4F1A;&#x5728;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x52A0;&#x8F7D;&#x5355;&#x8BCD;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x52A0;&#x8F7D;&#x5B8C;&#x6574;&#x7684;&#x9875;&#x9762;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x53C2;&#x8003;&#x89C4;&#x5219;&#x7684;&#x7A7A;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x8868;&#x660E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6307;&#x7684;&#x662F;&#x4EFB;&#x4F55;&#x5355;&#x8BCD;&#xFF0C;&#x4E0B;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x5C06;&#x5728;&#x5176;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x88AB;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x7684;&#x539F;&#x56E0;&#x9875;&#x9762;&#x8868;&#x5C06;&#x52A0;&#x8F7D;&#x5B8C;&#x6574;&#x7684;&#x5757;&#x3002;</span> </li></ol><h4 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x76F8;&#x5173;&#x95EE;&#x9898; - </span> </h4><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>1.&#x8BA1;&#x7B97;&#x673A;&#x5177;&#x6709;256 KB&#xFF0C;4&#x8DEF;&#x7EC4;&#x5173;&#x8054;&#xFF0C;&#x5199;&#x56DE;&#x6570;&#x636E;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF0C;&#x5757;&#x5927;&#x5C0F;&#x4E3A;32&#x5B57;&#x8282;&#x3002;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5904;&#x7406;&#x5668;&#x5C06;32&#x4F4D;&#x5730;&#x5740;&#x53D1;&#x9001;&#x5230;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x63A7;&#x5236;&#x5668;&#x3002;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x9664;&#x4E86;&#x5730;&#x5740;&#x6807;&#x8BB0;&#x4E4B;&#x5916;&#xFF0C;&#x6BCF;&#x4E2A;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x6807;&#x8BB0;&#x76EE;&#x5F55;&#x6761;&#x76EE;&#x8FD8;&#x5305;&#x542B;2&#x4E2A;&#x6709;&#x6548;&#x4F4D;&#xFF0C;1&#x4E2A;&#x4FEE;&#x6539;&#x4F4D;&#x548C;1&#x4E2A;&#x66FF;&#x6362;&#x4F4D;&#x3002;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5730;&#x5740;&#x7684;&#x6807;&#x8BB0;&#x5B57;&#x6BB5;&#x4E2D;&#x7684;&#x4F4D;&#x6570;&#x662F;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;A&#xFF09;11</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;B&#xFF09;14</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;C&#xFF09;16</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;D&#xFF09;27</strong></span> <strong><br></strong> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7B54;&#x6848;&#xFF1A;&#xFF08;C&#xFF09;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BF4;&#x660E;&#xFF1A; <a href="https://www.geeksforgeeks.org/gate-gate-cs-2012-question-54/" target="_blank">https</a> &#xFF1A; <a href="https://www.geeksforgeeks.org/gate-gate-cs-2012-question-54/" target="_blank">//www.geeksforgeeks.org/gate-gate-cs-2012-question-54/</a></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>2.&#x8003;&#x8651;&#x524D;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x6570;&#x636E;&#x3002;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7F13;&#x5B58;&#x6807;&#x8BB0;&#x76EE;&#x5F55;&#x7684;&#x5927;&#x5C0F;&#x662F;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;A&#xFF09;160 Kbits</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;B&#xFF09;136&#x4F4D;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;C&#xFF09;40 Kbits</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;D&#xFF09;32&#x4F4D;</strong></span> <strong><br></strong> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7B54;&#x6848;&#xFF1A;&#xFF08;A&#xFF09;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BF4;&#x660E;&#xFF1A; <a href="https://www.geeksforgeeks.org/gate-gate-cs-2012-question-55/" target="_blank">https</a> &#xFF1A; <a href="https://www.geeksforgeeks.org/gate-gate-cs-2012-question-55/" target="_blank">//www.geeksforgeeks.org/gate-gate-cs-2012-question-55/</a></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>3.&#x4E00;&#x4E2A;8KB&#x7684;&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x56DE;&#x5199;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x88AB;&#x7EC4;&#x7EC7;&#x6210;&#x591A;&#x4E2A;&#x5757;&#xFF0C;&#x6BCF;&#x4E2A;&#x5757;&#x5927;&#x5C0F;&#x4E3A;32&#x5B57;&#x8282;&#x3002;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5904;&#x7406;&#x5668;&#x751F;&#x6210;32&#x4F4D;&#x5730;&#x5740;&#x3002;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x63A7;&#x5236;&#x5668;&#x7EF4;&#x62A4;&#x6BCF;&#x4E2A;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5757;&#x7684;&#x6807;&#x7B7E;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x3002;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>1&#x6709;&#x6548;&#x4F4D;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>1&#x4FEE;&#x6539;&#x4F4D;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4F4D;&#x6765;&#x8BC6;&#x522B;&#x6620;&#x5C04;&#x5728;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x5757;&#x6240;&#x9700;&#x7684;&#x6700;&#x5C0F;&#x4F4D;&#x3002;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7F13;&#x5B58;&#x63A7;&#x5236;&#x5668;&#x4E3A;&#x7F13;&#x5B58;&#x5B58;&#x50A8;&#x5143;&#x6570;&#x636E;&#xFF08;&#x6807;&#x8BB0;&#xFF09;&#x6240;&#x9700;&#x7684;&#x5185;&#x5B58;&#x603B;&#x5927;&#x5C0F;&#x662F;&#x591A;&#x5C11;&#xFF1F;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;A&#xFF09;4864&#x4F4D;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;B&#xFF09;6144&#x4F4D;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;C&#xFF09;6656&#x4F4D;</strong></span> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#xFF08;D&#xFF09;5376&#x4F4D;</strong></span> <strong><br></strong> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7B54;&#x6848;&#xFF1A;&#xFF08;D&#xFF09;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BF4;&#x660E;&#xFF1A; <a href="https://www.geeksforgeeks.org/gate-gate-cs-2011-question-43/" target="_blank">https</a> &#xFF1A; <a href="https://www.geeksforgeeks.org/gate-gate-cs-2011-question-43/" target="_blank">//www.geeksforgeeks.org/gate-gate-cs-2011-question-43/</a></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6587;&#x7AE0;&#x4F9B;&#x7A3F;&#x4EBA;&#xFF1A; <strong>Pooja Taneja&#x548C;Vaishali Bhatia</strong> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x60A8;&#x53D1;&#x73B0;&#x4EFB;&#x4F55;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6216;&#x8005;&#x60A8;&#x200B;&#x200B;&#x60F3;&#x8981;&#x5206;&#x4EAB;&#x6709;&#x5173;&#x4E0A;&#x8FF0;&#x4E3B;&#x9898;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x64B0;&#x5199;&#x8BC4;&#x8BBA;&#x3002;</span> </p><p></p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></ul></div></body></html>