<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/arch/38.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA1;&#x7B97;&#x673A;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x96C6;&#x7FA4;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <em>&#x7FA4;&#x96C6;</em>&#x662F;&#x4E00;&#x7EC4;&#x677E;&#x6563;&#x6216;&#x7D27;&#x5BC6;&#x8FDE;&#x63A5;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x7EDF;&#x4E00;&#x7684;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x7684;&#x9519;&#x89C9;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA1;&#x7B97;&#x673A;&#x96C6;&#x7FA4;&#x5C06;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x8BBE;&#x7F6E;&#x4E3A;&#x6267;&#x884C;&#x7531;&#x8F6F;&#x4EF6;&#x63A7;&#x5236;&#x548C;&#x751F;&#x6210;&#x7684;&#x76F8;&#x540C;&#x4EFB;&#x52A1;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <em>&#x7FA4;&#x96C6;</em>&#x7684;<em>&#x7EC4;&#x4EF6;</em>&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x5FEB;&#x901F;&#x533A;&#x57DF;&#x7F51;&#x7EDC;&#x5F7C;&#x6B64;&#x8FDE;&#x63A5;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x8FD0;&#x884C;&#x5176;&#x81EA;&#x5DF1;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5B9E;&#x4F8B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x8282;&#x70B9;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x67D0;&#x4E9B;&#x8BBE;&#x7F6E;&#x4E2D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#x6216;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</span> </p><p><img src="../../../imgs/arch/77e57aa5a39776274922ae1b1a478dfb.jpg" alt=""></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x96C6;&#x7FA4;&#x7C7B;&#x578B; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <em>&#x8BA1;&#x7B97;&#x673A;&#x96C6;&#x7FA4;</em>&#x4EE5;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x6392;&#x5217;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x4FBF;&#x652F;&#x6301;&#x4ECE;&#x8BF8;&#x5982;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x652F;&#x6301;&#x7684;&#x901A;&#x7528;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x5230;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x7684;&#x4E0D;&#x540C;&#x76EE;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x57FA;&#x672C;&#x4E0A;&#x6709;&#x4E09;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#xFF1A;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x7FA4;&#x96C6;</strong> - &#x7FA4;&#x96C6;&#x9700;&#x8981;&#x6709;&#x6548;&#x7684;&#x529F;&#x80FD;&#x6765;&#x5E73;&#x8861;&#x53EF;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x8D1F;&#x8F7D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6B64;&#xFF0C;&#x7FA4;&#x96C6;&#x8282;&#x70B9;&#x5171;&#x4EAB;&#x8BA1;&#x7B97;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x4EE5;&#x4FBF;&#x63D0;&#x9AD8;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x4E8E;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x7684;&#x9AD8;&#x6027;&#x80FD;&#x96C6;&#x7FA4;&#x5C06;&#x5E73;&#x8861;&#x6765;&#x81EA;Web&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x7684;&#x4E0D;&#x540C;&#x7B97;&#x6CD5;&#x7684;&#x8D1F;&#x8F7D;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x6BCF;&#x4E2A;&#x65B0;&#x8BF7;&#x6C42;&#x5206;&#x914D;&#x7ED9;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x6765;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x65B9;&#x6CD5;&#x3002;&#x4F7F;&#x7528;&#x6B64;&#x7C7B;&#x578B;&#x7684;&#x96C6;&#x7FA4;&#x5728;Web&#x670D;&#x52A1;&#x5668;&#x7684;&#x519C;&#x573A;&#xFF08;Web&#x573A;&#xFF09;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6545;&#x969C;</strong>&#x8F6C;&#x79FB;<strong>&#x7FA4;&#x96C6;</strong> - &#x5C06;&#x6545;&#x969C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x6570;&#x636E;&#x8D44;&#x6E90;&#x5207;&#x6362;&#x5230;&#x7FA4;&#x96C6;&#x4E2D;&#x7684;&#x5907;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x79F0;&#x4E3A;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7528;&#x4E8E;&#x96C6;&#x7FA4;&#x5173;&#x952E;&#x4EFB;&#x52A1;&#xFF0C;&#x90AE;&#x4EF6;&#xFF0C;&#x6587;&#x4EF6;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6570;&#x636E;&#x5E93;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x96C6;&#x7FA4;</strong> - &#x8FD9;&#x4E9B;<strong>&#x96C6;&#x7FA4;</strong>&#x4E5F;&#x79F0;&#x4E3A;&#x201C;HA&#x96C6;&#x7FA4;&#x201D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x4EEC;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x90FD;&#x5728;&#x670D;&#x52A1;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x786E;&#x5B9E;&#x53D1;&#x751F;&#x4E86;&#x6545;&#x969C;&#xFF0C;&#x4F8B;&#x5982;&#x7CFB;&#x7EDF;&#x53D1;&#x751F;&#x6545;&#x969C;&#x6216;&#x78C1;&#x76D8;&#x5377;&#x4E22;&#x5931;&#xFF0C;&#x5219;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x67E5;&#x8BE2;&#x5C06;&#x4E22;&#x5931;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4EFB;&#x4F55;&#x4E22;&#x5931;&#x7684;&#x67E5;&#x8BE2;&#xFF08;&#x5982;&#x679C;&#x91CD;&#x8BD5;&#xFF09;&#x5C06;&#x7531;&#x7FA4;&#x96C6;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x8BA1;&#x7B97;&#x673A;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x7FA4;&#x96C6;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;Web&#xFF0C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x65B0;&#x95FB;&#x6216;FTP&#x670D;&#x52A1;&#x5668;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x597D;&#x5904; - </strong></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7EDD;&#x5BF9;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;</strong> - &#x6709;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x96C6;&#x7FA4;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x6700;&#x5927;&#x7684;&#x72EC;&#x7ACB;&#x673A;&#x5668;&#x4E5F;&#x80FD;&#x80DC;&#x4EFB;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x53EF;&#x4EE5;&#x6709;&#x51E0;&#x5341;&#x53F0;<em>&#x591A;&#x5904;&#x7406;&#x5668;&#x673A;&#x5668;&#x3002;</em></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x989D;&#x5916;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;</strong> - &#x7FA4;&#x96C6;&#x7684;&#x914D;&#x7F6E;&#x65B9;&#x5F0F;&#x4F7F;&#x5F97;&#x53EF;&#x4EE5;&#x4EE5;&#x8F83;&#x5C0F;&#x7684;&#x589E;&#x91CF;&#x5411;&#x7FA4;&#x96C6;&#x6DFB;&#x52A0;&#x65B0;&#x7CFB;&#x7EDF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x96C6;&#x7FA4;&#x53EF;&#x4EE5;&#x6C34;&#x5E73;&#x6DFB;&#x52A0;&#x7CFB;&#x7EDF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x5411;&#x7FA4;&#x96C6;&#x4E2D;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x5176;&#x6027;&#x80FD;&#xFF0C;&#x5197;&#x4F59;&#x548C;&#x5BB9;&#x9519;&#x80FD;&#x529B;&#xFF08;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x8282;&#x70B9;&#x6545;&#x969C;&#xFF09;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x9AD8;&#x53EF;&#x7528;&#x6027;</strong> - &#x6211;&#x4EEC;&#x77E5;&#x9053;&#x7FA4;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x72EC;&#x7ACB;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6545;&#x969C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x670D;&#x52A1;&#x4E22;&#x5931;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53EF;&#x4EE5;&#x53D6;&#x6D88;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x7EF4;&#x62A4;&#xFF0C;&#x800C;&#x5176;&#x4F59;&#x7684;&#x96C6;&#x7FA4;&#x5219;&#x627F;&#x62C5;&#x8BE5;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x8D1F;&#x8F7D;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x4F18;&#x60E0;&#x7684;&#x6027;&#x4EF7;&#x6BD4;</strong> - &#x901A;&#x5E38;&#x8BBE;&#x7F6E;&#x96C6;&#x7FA4;&#x4EE5;&#x63D0;&#x9AD8;&#x5355;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6027;&#x80FD;&#x548C;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x901A;&#x5E38;&#x6BD4;&#x5177;&#x6709;&#x53EF;&#x6BD4;&#x901F;&#x5EA6;&#x6216;&#x53EF;&#x7528;&#x6027;&#x7684;&#x5355;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x66F4;&#x5177;&#x6210;&#x672C;&#x6548;&#x76CA;&#x3002;</span> </li></ul><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><hr><hr><!-- .entry-meta --></div></body></html>