<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/arch/39.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x7B80;&#x4ECB;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x7535;&#x5B50;&#x5143;&#x4EF6;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x65E5;&#x76CA;&#x53D8;&#x5C0F;&#x548C;&#x53D8;&#x5FEB;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5373;&#x5C06;&#x8FBE;&#x5230;&#x5176;&#x7269;&#x7406;&#x6781;&#x9650;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7535;&#x662F;&#x7535;&#x5B50;&#x7684;&#x6D41;&#x52A8;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x6676;&#x4F53;&#x7BA1;&#x7684;&#x5C3A;&#x5BF8;&#x7F29;&#x5C0F;&#x5230;&#x51E0;&#x4E2A;&#x539F;&#x5B50;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x6676;&#x4F53;&#x7BA1;&#x4E0D;&#x80FD;&#x7528;&#x4F5C;&#x5F00;&#x5173;&#xFF0C;&#x56E0;&#x4E3A;&#x7535;&#x5B50;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x79F0;&#x4E3A;&#x91CF;&#x5B50;&#x96A7;&#x7A7F;&#x7684;&#x8FC7;&#x7A0B;&#x5C06;&#x81EA;&#x8EAB;&#x8F6C;&#x79FB;&#x5230;&#x963B;&#x585E;&#x901A;&#x9053;&#x7684;&#x53E6;&#x4E00;&#x4FA7;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x91CF;&#x5B50;&#x529B;&#x5B66;</b>&#x662F;&#x7269;&#x7406;&#x5B66;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#xFF0C;&#x5B83;&#x5728;&#x6700;&#x57FA;&#x7840;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#x63A2;&#x7D22;&#x7269;&#x7406;&#x4E16;&#x754C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x8FD9;&#x4E2A;&#x7EA7;&#x522B;&#xFF0C;&#x7C92;&#x5B50;&#x7684;&#x884C;&#x4E3A;&#x4E0E;&#x7ECF;&#x5178;&#x4E16;&#x754C;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x540C;&#x65F6;&#x5904;&#x4E8E;&#x591A;&#x4E2A;&#x72B6;&#x6001;&#x5E76;&#x4E0E;&#x975E;&#x5E38;&#x8FDC;&#x7684;&#x5176;&#x4ED6;&#x7C92;&#x5B50;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x50CF;&#x53E0;&#x52A0;&#x548C;&#x7EA0;&#x7F20;&#x7684;&#x73B0;&#x8C61;&#x53D1;&#x751F;&#x3002;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x53E0;&#x52A0; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x4E2D;&#xFF0C;&#x6BD4;&#x7279;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x72B6;&#x6001;&#xFF0C; <b>&#x5373;&#x96F6;&#x6216;&#x4E00;</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x4E2D;&#xFF0C;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#xFF08;&#x201C;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x201D;&#x7684;&#x7F29;&#x5199;&#xFF09;&#x662F;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#x7684;&#x5355;&#x4F4D; - &#x4E0E;&#x7ECF;&#x5178;&#x6BD4;&#x7279;&#x7684;&#x91CF;&#x5B50;&#x6A21;&#x62DF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> Qubits&#x5177;&#x6709;&#x7279;&#x6B8A;&#x5C5E;&#x6027;&#xFF0C;&#x53EF;&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x6BD4;&#x4F20;&#x7EDF;&#x4F4D;&#x66F4;&#x5FEB;&#x5730;&#x89E3;&#x51B3;&#x590D;&#x6742;&#x95EE;&#x9898;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x4E4B;&#x4E00;&#x662F;<b>&#x53E0;&#x52A0;</b> &#xFF0C;&#x5176;&#x8868;&#x793A;&#x4E0D;&#x662F;&#x50CF;&#x7ECF;&#x5178;&#x4F4D;&#x90A3;&#x6837;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x503C;&#xFF08;&#x201C;0&#x201D;&#x6216;&#x201C;1&#x201D;&#xFF09;&#xFF0C;&#x800C;&#x662F;<i>&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x201C;0&#x201D;&#x548C;&#x201C;1&#x201D;&#x7684;&#x7EC4;&#x5408;</i> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> Qubits&#x6709;&#x4E24;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x7ED3;&#x679C;&#x4E3A;&#x96F6;&#x6216;&#x4E00;&#x4E2A;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#x662F;&#x96F6;&#x548C;&#x4E00;&#x7684;&#x53E0;&#x52A0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x91CF;&#x5B50;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x4E0D;&#x5FC5;&#x5904;&#x4E8E;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x72B6;&#x6001;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x8FD9;&#x4E9B;&#x5DDE;&#x7684;&#x4EFB;&#x4F55;&#x6BD4;&#x4F8B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x6D4B;&#x91CF;&#x5176;&#x4EF7;&#x503C;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x51B3;&#x5B9A;&#x5B83;&#x662F;&#x96F6;&#x8FD8;&#x662F;&#x4E00;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x79F0;&#x4E3A;&#x53E0;&#x52A0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#x540C;&#x65F6;&#x5904;&#x4E8E;&#x591A;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x80FD;&#x529B;&#x3002;</span> <p></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x4E2D;&#xFF0C;&#x6709;4&#x4E2A;&#x5B57;&#x8282;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> 4&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x7EC4;&#x5408;&#x53EF;&#x4EE5;&#x603B;&#x5171;&#x8868;&#x793A;2 ^ 4 = 16&#x4E2A;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x7ED9;&#x5B9A;&#x65F6;&#x523B;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x503C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x5728;4&#x4E2A;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x7684;&#x7EC4;&#x5408;&#x4E2D;&#xFF0C;&#x6240;&#x6709;16&#x4E2A;&#x7EC4;&#x5408;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x3002;</span> </p></li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x7EA0;&#x7F20; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7EA0;&#x7F20;&#x662F;&#x91CF;&#x5B50;&#x7C92;&#x5B50;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7684;&#x6781;&#x5176;&#x5F3A;&#x70C8;&#x7684;&#x76F8;&#x5173;&#x6027; - &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x91CF;&#x5B50;&#x7C92;&#x5B50;&#x53EF;&#x4EE5;&#x5B8C;&#x7F8E;&#x5730;&#x4E00;&#x81F4;&#x5730;&#x8FDE;&#x63A5;&#xFF0C;&#x5373;&#x4F7F;&#x88AB;&#x8FDC;&#x8DDD;&#x79BB;&#x5206;&#x5F00;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5373;&#x4F7F;&#x8FDC;&#x8DDD;&#x79BB;&#x5206;&#x79BB;&#xFF0C;&#x7C92;&#x5B50;&#x4ECD;&#x4FDD;&#x6301;&#x5B8C;&#x5168;&#x76F8;&#x5173;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E24;&#x4E2A;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x901A;&#x8FC7;&#x6FC0;&#x5149;&#x7684;&#x4F5C;&#x7528;&#x7EA0;&#x7F20;&#x5728;&#x4E00;&#x8D77;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x65E6;&#x4ED6;&#x4EEC;&#x7EA0;&#x7F20;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4ED6;&#x4EEC;&#x5904;&#x4E8E;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x540E;&#xFF0C;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x53EF;&#x4EE5;&#x88AB;&#x4EFB;&#x4F55;&#x8DDD;&#x79BB;&#x5206;&#x5F00;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x4FDD;&#x6301;&#x94FE;&#x63A5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x88AB;&#x64CD;&#x7EB5;&#x65F6;&#xFF0C;&#x64CD;&#x7EB5;&#x4E5F;&#x4F1A;&#x7ACB;&#x5373;&#x53D1;&#x751F;&#x5728;&#x5176;&#x7EA0;&#x7F20;&#x7684;&#x53CC;&#x80DE;&#x80CE;&#x4E2D;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;</b></span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x5728;&#x6781;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x8F7B;&#x677E;&#x7834;&#x89E3;&#x5F53;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x4ECA;&#x5929;&#x53EF;&#x7528;&#x7684;&#x6700;&#x4F73;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x9700;&#x8981;&#x6570;&#x5341;&#x4EBF;&#x5E74;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5373;&#x4F7F;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x591F;&#x7834;&#x89E3;&#x5F53;&#x4ECA;&#x7684;&#x8BB8;&#x591A;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#xFF0C;&#x4F46;&#x9884;&#x6D4B;&#x4ED6;&#x4EEC;&#x4F1A;&#x521B;&#x5EFA;&#x9632;&#x9ED1;&#x5BA2;&#x66FF;&#x4EE3;&#x54C1;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x975E;&#x5E38;&#x9002;&#x5408;&#x89E3;&#x51B3;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x3002;</span> </li></ol><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><hr><hr><!-- .entry-meta --></div></body></html>