<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF; - &#x7B80;&#x4ECB;|</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BBE;&#x7F6E;1</span> </h1></header><!-- .entry-header --><div class="entry-content"><p style="text-align: center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x91CD;&#x8981;&#x672F;&#x8BED;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6570;&#x636E;&#x5E93;&#xFF1A;</strong>&#x6570;&#x636E;&#x5E93;&#x662F;&#x76F8;&#x4E92;&#x5173;&#x8054;&#x6570;&#x636E;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6709;&#x6548;&#x5730;&#x68C0;&#x7D22;&#xFF0C;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4EE5;&#x8868;&#x683C;&#xFF0C;&#x89C6;&#x56FE;&#xFF0C;&#x6A21;&#x5F0F;&#xFF0C;&#x62A5;&#x544A;&#x7B49;&#x5F62;&#x5F0F;&#x7EC4;&#x7EC7;&#x6570;&#x636E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5927;&#x5B66;&#x6570;&#x636E;&#x5E93;&#x7EC4;&#x7EC7;&#x6709;&#x5173;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x5B66;&#x751F;&#xFF0C;&#x6559;&#x5E08;&#x548C;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x7B49;&#x6709;&#x52A9;&#x4E8E;&#x4ECE;&#x4E2D;&#x6709;&#x6548;&#x5730;&#x68C0;&#x7D22;&#xFF0C;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x6570;&#x636E;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF1A;</strong>&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8F6F;&#x4EF6;&#x79F0;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF08;DBMS&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F8B;&#x5982;&#xFF0C;MySQL&#xFF0C;Oracle&#x7B49;&#x662F;&#x5728;&#x4E0D;&#x540C;&#x5E94;&#x7528;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6D41;&#x884C;&#x7684;&#x5546;&#x4E1A;DBMS&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> DBMS&#x5141;&#x8BB8;&#x7528;&#x6237;&#x6267;&#x884C;&#x4EE5;&#x4E0B;&#x4EFB;&#x52A1;&#xFF1A;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6570;&#x636E;&#x5B9A;&#x4E49;&#xFF1A;</strong>&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x521B;&#x5EFA;&#xFF0C;&#x4FEE;&#x6539;&#x548C;&#x5220;&#x9664;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6570;&#x636E;&#x7EC4;&#x7EC7;&#x7684;&#x5B9A;&#x4E49;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6570;&#x636E;&#x66F4;&#x65B0;&#xFF1A;</strong>&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x63D2;&#x5165;&#xFF0C;&#x4FEE;&#x6539;&#x548C;&#x5220;&#x9664;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x3002;</span> </p><br><!-- post_top_responsive --><br><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6570;&#x636E;&#x68C0;&#x7D22;&#xFF1A;</strong>&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x68C0;&#x7D22;&#x6570;&#x636E;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x76EE;&#x7684;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7528;&#x6237;&#x7BA1;&#x7406;&#xFF1A;</strong>&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x6CE8;&#x518C;&#x548C;&#x76D1;&#x89C6;&#x7528;&#x6237;&#xFF0C;&#x5B9E;&#x65BD;&#x6570;&#x636E;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x76D1;&#x89C6;&#x6027;&#x80FD;&#xFF0C;&#x7EF4;&#x62A4;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x5904;&#x7406;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x4EE5;&#x53CA;&#x6062;&#x590D;&#x56E0;&#x610F;&#x5916;&#x6545;&#x969C;&#x800C;&#x635F;&#x574F;&#x7684;&#x4FE1;&#x606F;&#x3002;</span> </p><p style="text-align: center"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8303;&#x5F0F;&#x4ECE;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8F6C;&#x79FB;&#x5230;DBMS</strong></span> </p><p><strong>&#xA0;</strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x786C;&#x76D8;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5141;&#x8BB8;&#x7528;&#x6237;&#x6839;&#x636E;&#x9700;&#x8981;&#x521B;&#x5EFA;&#xFF0C;&#x5220;&#x9664;&#x548C;&#x66F4;&#x65B0;&#x6587;&#x4EF6;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x57FA;&#x4E8E;&#x6587;&#x4EF6;&#x7684;&#x5927;&#x5B66;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x4F8B;&#x5B50;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B66;&#x751F;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4F9B;&#x5404;&#x81EA;&#x7684;&#x90E8;&#x95E8;&#xFF0C;&#x5B66;&#x672F;&#x90E8;&#x95E8;&#xFF0C;&#x7ED3;&#x679C;&#x90E8;&#x95E8;&#xFF0C;&#x4F1A;&#x8BA1;&#x90E8;&#x95E8;&#xFF0C;&#x5BBF;&#x820D;&#x529E;&#x516C;&#x5BA4;&#x7B49;&#x4F7F;&#x7528;&#x3002;&#x6709;&#x4E9B;&#x6570;&#x636E;&#x5728;&#x6240;&#x6709;&#x90E8;&#x5206;&#x90FD;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x4F8B;&#x5982;&#x5B66;&#x751F;&#x540D;&#x5355;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x5730;&#x5740;&#x548C;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x6570;&#x636E;&#x4EC5;&#x9650;&#x4E8E;&#x65C5;&#x9986;&#x529E;&#x516C;&#x5BA4;&#x7684;&#x5BBF;&#x820D;&#x5206;&#x914D;&#x53F7;&#x7801;&#x7684;&#x7279;&#x5B9A;&#x90E8;&#x5206;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA9;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#xFF1A;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6570;&#x636E;</strong>&#x5197;&#x4F59;&#xFF1A;&#x5982;&#x679C;&#x5728;&#x8BB8;&#x591A;&#x5730;&#x65B9;&#x590D;&#x5236;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x79F0;&#x6570;&#x636E;&#x662F;&#x5197;&#x4F59;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x5B66;&#x751F;&#x60F3;&#x8981;&#x66F4;&#x6539;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#xFF0C;&#x4ED6;&#x5FC5;&#x987B;&#x5728;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x66F4;&#x65B0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x540C;&#x6837;&#xFF0C;&#x5FC5;&#x987B;&#x4ECE;&#x4EE3;&#x8868;&#x8BE5;&#x5B66;&#x751F;&#x7684;&#x6240;&#x6709;&#x90E8;&#x5206;&#x5220;&#x9664;&#x65E7;&#x8BB0;&#x5F55;&#x3002;</span> </li></ul><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6570;&#x636E;</strong>&#x4E0D;&#x4E00;&#x81F4;&#xFF1A;&#x5982;&#x679C;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x5F7C;&#x6B64;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x79F0;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x201C;&#x5E10;&#x6237;&#x201D;&#x90E8;&#x5206;&#x548C;&#x201C;&#x5B66;&#x672F;&#x90E8;&#x5206;&#x201D;&#x4E2D;&#x7684;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x4E0D;&#x540C;&#xFF0C;&#x5219;&#x5B83;&#x5C06;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E0D;&#x4E00;&#x81F4;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x952E;&#x5165;&#x9519;&#x8BEF;&#x6216;&#x672A;&#x66F4;&#x65B0;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x526F;&#x672C;&#x3002;</span> </li></ul><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x56F0;&#x96BE;&#x7684;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#xFF1A;</strong>&#x7528;&#x6237;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x786E;&#x5207;&#x4F4D;&#x7F6E;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x8FC7;&#x7A0B;&#x975E;&#x5E38;&#x7E41;&#x7410;&#x4E14;&#x4E4F;&#x5473;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x7528;&#x6237;&#x60F3;&#x8981;&#x4ECE;10000&#x4E2A;&#x672A;&#x5206;&#x7C7B;&#x5B66;&#x751F;&#x7684;&#x8BB0;&#x5F55;&#x4E2D;&#x641C;&#x7D22;&#x5B66;&#x751F;&#x5BBF;&#x820D;&#x5206;&#x914D;&#x7F16;&#x53F7;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x6709;&#x591A;&#x96BE;&#x3002;</span> </li></ul><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x672A;&#x7ECF;&#x6388;&#x6743;&#x7684;&#x8BBF;&#x95EE;&#xFF1A;</strong>&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x672A;&#x7ECF;&#x6388;&#x6743;&#x7684;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x5B66;&#x751F;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5E26;&#x6709;&#x4ED6;&#x7684;&#x6807;&#x8BB0;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x4EE5;&#x672A;&#x7ECF;&#x6388;&#x6743;&#x7684;&#x65B9;&#x5F0F;&#x66F4;&#x6539;&#x5B83;&#x3002;</span> </li></ul><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x65E0;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#xFF1A;</strong>&#x591A;&#x4E2A;&#x7528;&#x6237;<strong>&#x540C;&#x65F6;&#x8BBF;&#x95EE;</strong>&#x76F8;&#x540C;&#x6570;&#x636E;&#x79F0;&#x4E3A;&#x5E76;&#x53D1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0D;&#x5141;&#x8BB8;&#x5E76;&#x53D1;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x7531;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x3002;</span> </li></ul><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x65E0;&#x5907;&#x4EFD;&#x548C;&#x6062;&#x590D;&#xFF1A;</strong>&#x5982;&#x679C;&#x6587;&#x4EF6;&#x4E22;&#x5931;&#x6216;&#x635F;&#x574F;&#xFF0C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0D;&#x4F1A;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x5907;&#x4EFD;&#x548C;&#x6062;&#x590D;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E9B;&#x662F;&#x4ECE;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8F6C;&#x79FB;&#x5230;DBMS&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53E6;&#x89C1;</span> </p><ul><li class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="http://quiz.geeksforgeeks.org/database-management-system-introduction-set-2/">&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF; - &#x7B80;&#x4ECB;|</a></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="http://quiz.geeksforgeeks.org/database-management-system-introduction-set-2/">&#x8BBE;&#x7F6E;2</a></span> </li><li class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="http://quiz.geeksforgeeks.org/category/articles/dbms-articles/">&#x6240;&#x6709;DBMS&#x6587;&#x7AE0;</a></span> </li><li class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="http://quiz.geeksforgeeks.org/quiz-corner/">DBMS&#x6D4B;&#x9A8C;</a></span> </li></ul><br><!-- post_bottom_responsive --><br><br><!-- .entry-meta --></div></body></html>