<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6570;&#x636E;&#x5E93;&#x6062;&#x590D;&#x6280;&#x672F;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E0E;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#xFF0C; <b>&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;</b>&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x4F46;&#x5B58;&#x50A8;&#x5728;&#x5176;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x5728;&#x9700;&#x8981;&#x65F6;&#x53EF;&#x7528;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x6570;&#x636E;&#x5E93;&#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x5FEB;&#x901F;&#x6062;&#x590D;&#x7684;&#x529F;&#x80FD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x8FD8;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x5373;&#x4E8B;&#x52A1;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x5E76;&#x63D0;&#x4EA4;&#xFF08;&#x6548;&#x679C;&#x6C38;&#x4E45;&#x8BB0;&#x5F55;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x4E8B;&#x52A1;&#x5E94;&#x8BE5;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E24;&#x8005;&#x90FD;&#x6709;&#x81EA;&#x52A8;&#x548C;&#x975E;&#x81EA;&#x52A8;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5907;&#x4EFD;&#x6570;&#x636E;&#x548C;&#x4ECE;&#x4EFB;&#x4F55;&#x6545;&#x969C;&#x60C5;&#x51B5;&#x4E2D;&#x6062;&#x590D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7528;&#x4E8E;&#x6062;&#x590D;&#x7531;&#x4E8E;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#xFF0C;&#x4E8B;&#x52A1;&#x9519;&#x8BEF;&#xFF0C;&#x75C5;&#x6BD2;&#xFF0C;&#x707E;&#x96BE;&#x6027;&#x6545;&#x969C;&#xFF0C;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x7B49;&#x800C;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x7684;&#x6280;&#x672F;&#x662F;&#x6570;&#x636E;&#x5E93;&#x6062;&#x590D;&#x6280;&#x672F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x57FA;&#x4E8E;&#x5EF6;&#x8FDF;&#x66F4;&#x65B0;&#x548C;&#x7ACB;&#x5373;&#x66F4;&#x65B0;&#x6216;&#x5907;&#x4EFD;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x4E22;&#x5931;&#x6062;&#x590D;&#x6280;&#x672F;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6062;&#x590D;&#x6280;&#x672F;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53D6;&#x51B3;&#x4E8E;&#x662F;&#x5426;&#x5B58;&#x5728;&#x79F0;&#x4E3A;<b>&#x7CFB;&#x7EDF;&#x65E5;&#x5FD7;</b>&#x7684;&#x7279;&#x6B8A;&#x6587;&#x4EF6;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x5305;&#x542B;&#x6709;&#x5173;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x4EE5;&#x53CA;&#x4E8B;&#x52A1;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x4EFB;&#x4F55;&#x66F4;&#x65B0;&#x7684;&#x4FE1;&#x606F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x65E5;&#x5FD7;&#x4F1A;&#x8DDF;&#x8E2A;&#x5F71;&#x54CD;&#x6570;&#x636E;&#x5E93;&#x9879;&#x503C;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x64CD;&#x4F5C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9700;&#x8981;&#x6B64;&#x4FE1;&#x606F;&#x624D;&#x80FD;&#x4ECE;&#x4E8B;&#x52A1;&#x5931;&#x8D25;&#x4E2D;&#x6062;&#x590D;&#x3002;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x65E5;&#x5FD7;&#x4FDD;&#x5B58;&#x5728;&#x78C1;&#x76D8;start_transaction&#xFF08;T&#xFF09;&#x4E0A;&#xFF1A;&#x6B64;&#x65E5;&#x5FD7;&#x6761;&#x76EE;&#x8BB0;&#x5F55;&#x4E8B;&#x52A1;T&#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> read_item&#xFF08;T&#xFF0C;X&#xFF09;&#xFF1A;&#x6B64;&#x65E5;&#x5FD7;&#x6761;&#x76EE;&#x8BB0;&#x5F55;&#x4E8B;&#x52A1;T&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E93;&#x9879;X&#x7684;&#x503C;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> write_item&#xFF08;T&#xFF0C;X&#xFF0C;old_value&#xFF0C;new_value&#xFF09;&#xFF1A;&#x6B64;&#x65E5;&#x5FD7;&#x6761;&#x76EE;&#x8BB0;&#x5F55;&#x4E8B;&#x52A1;T&#x5C06;&#x6570;&#x636E;&#x5E93;&#x9879;X&#x7684;&#x503C;&#x4ECE;old_value&#x66F4;&#x6539;&#x4E3A;new_value&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x65E7;&#x503C;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;X&#x7684;&#x56FE;&#x50CF;&#x4E4B;&#x524D;&#xFF0C;&#x65B0;&#x503C;&#x88AB;&#x79F0;&#x4E3A;X&#x7684;&#x4F59;&#x50CF;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> commit&#xFF08;T&#xFF09;&#xFF1A;&#x6B64;&#x65E5;&#x5FD7;&#x6761;&#x76EE;&#x8BB0;&#x5F55;&#x4E8B;&#x52A1;T&#x5DF2;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6240;&#x6709;&#x8BBF;&#x95EE;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x6548;&#x679C;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#xFF08;&#x6C38;&#x4E45;&#x8BB0;&#x5F55;&#xFF09;&#x5230;&#x6570;&#x636E;&#x5E93;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> abort&#xFF08;T&#xFF09;&#xFF1A;&#x8BB0;&#x5F55;&#x4E8B;&#x52A1;T&#x5DF2;&#x4E2D;&#x6B62;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x68C0;&#x67E5;&#x70B9;&#xFF1A;&#x68C0;&#x67E5;&#x70B9;&#x662F;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x5148;&#x524D;&#x7684;&#x65E5;&#x5FD7;&#x90FD;&#x4ECE;&#x7CFB;&#x7EDF;&#x4E2D;&#x5220;&#x9664;&#x5E76;&#x6C38;&#x4E45;&#x5B58;&#x50A8;&#x5728;&#x5B58;&#x50A8;&#x78C1;&#x76D8;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> Checkpoint&#x58F0;&#x660E;&#x4E86;DBMS&#x5904;&#x4E8E;&#x4E00;&#x81F4;&#x72B6;&#x6001;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x90FD;&#x5DF2;&#x63D0;&#x4EA4;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x4E8B;&#x52A1;T&#x5728;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x90FD;&#x5DF2;&#x6210;&#x529F;&#x6267;&#x884C;&#x65F6;&#x5230;&#x8FBE;&#x5176;<b>&#x63D0;&#x4EA4;</b>&#x70B9;&#xFF0C;&#x5373;&#x4E8B;&#x52A1;&#x5DF2;&#x8FBE;&#x5230;&#x4E0D;&#x4F1A;<b>&#x4E2D;&#x6B62;</b>&#x7684;&#x70B9;&#xFF08;&#x7EC8;&#x6B62;&#x800C;&#x672A;&#x5B8C;&#x6210;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x63D0;&#x4EA4;&#x540E;&#xFF0C;&#x4E8B;&#x52A1;&#x5C06;&#x6C38;&#x4E45;&#x8BB0;&#x5F55;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x627F;&#x8BFA;&#x59CB;&#x7EC8;&#x6D89;&#x53CA;&#x5C06;&#x63D0;&#x4EA4;&#x6761;&#x76EE;&#x5199;&#x5165;&#x65E5;&#x5FD7;&#x5E76;&#x5C06;&#x65E5;&#x5FD7;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x65F6;&#xFF0C;&#x5728;&#x65E5;&#x5FD7;&#x4E2D;&#x641C;&#x7D22;&#x9879;&#x76EE;&#xFF0C;&#x4EE5;&#x67E5;&#x627E;&#x5DF2;&#x5C06;start_transaction&#xFF08;T&#xFF09;&#x6761;&#x76EE;&#x5199;&#x5165;&#x65E5;&#x5FD7;&#x4F46;&#x5C1A;&#x672A;&#x5199;&#x5165;commit&#xFF08;T&#xFF09;&#x6761;&#x76EE;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x52A1;T.</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6062;&#x590D;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x56DE;&#x6EDA;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x4EE5;&#x64A4;&#x6D88;&#x5176;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5F71;&#x54CD;</span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x64A4;&#x6D88; -</b>&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x5D29;&#x6E83;&#xFF0C;&#x5219;&#x6062;&#x590D;&#x7BA1;&#x7406;&#x5668;&#x53EF;&#x4EE5;&#x64A4;&#x6D88;&#x4E8B;&#x52A1;&#xFF0C;&#x5373;&#x64A4;&#x6D88;&#x4E8B;&#x52A1;&#x7684;&#x64CD;&#x4F5C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x6D89;&#x53CA;&#x68C0;&#x67E5;&#x65E5;&#x5FD7;&#x6761;&#x76EE;write_item&#xFF08;T&#xFF0C;x&#xFF0C;old_value&#xFF0C;new_value&#xFF09;&#x7684;&#x4E8B;&#x52A1;&#x4EE5;&#x53CA;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x9879;x&#x7684;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A;&#x65E7;&#x503C;&#x3002;&#x4ECE;&#x975E;&#x707E;&#x96BE;&#x6027;&#x4E8B;&#x52A1;&#x6545;&#x969C;&#x4E2D;&#x6062;&#x590D;&#x6709;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x6280;&#x672F;&#xFF1A;&#x5EF6;&#x8FDF;&#x66F4;&#x65B0;&#x5E76;&#x7ACB;&#x5373;&#x66F4;&#x65B0;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5EF6;&#x8FDF;&#x66F4;&#x65B0; -</b>&#x5728;&#x4E8B;&#x52A1;&#x5230;&#x8FBE;&#x5176;&#x63D0;&#x4EA4;&#x70B9;&#x4E4B;&#x524D;&#xFF0C;&#x6B64;&#x6280;&#x672F;&#x4E0D;&#x4F1A;&#x7269;&#x7406;&#x66F4;&#x65B0;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x5230;&#x8FBE;&#x63D0;&#x4EA4;&#x4E4B;&#x524D;&#xFF0C;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x90FD;&#x8BB0;&#x5F55;&#x5728;&#x672C;&#x5730;&#x4E8B;&#x52A1;&#x5DE5;&#x4F5C;&#x7A7A;&#x95F4;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x5728;&#x5230;&#x8FBE;&#x5176;&#x63D0;&#x4EA4;&#x70B9;&#x4E4B;&#x524D;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x5B83;&#x4E0D;&#x4F1A;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x66F4;&#x6539;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;UNDO&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53EF;&#x80FD;&#x6709;&#x5FC5;&#x8981;&#x91CD;&#x505A;&#x8BB0;&#x5F55;&#x5728;&#x672C;&#x5730;&#x4E8B;&#x52A1;&#x5DE5;&#x4F5C;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x5F71;&#x54CD;&#x53EF;&#x80FD;&#x5C1A;&#x672A;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x5EF6;&#x8FDF;&#x66F4;&#x65B0;&#x4E5F;&#x79F0;&#x4E3A;<b>&#x65E0;&#x64A4;&#x6D88;/&#x91CD;&#x505A;&#x7B97;&#x6CD5;</b></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x7ACB;&#x5373;&#x66F4;&#x65B0; -</b>&#x5728;&#x7ACB;&#x5373;&#x66F4;&#x65B0;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E8B;&#x52A1;&#x5230;&#x8FBE;&#x5176;&#x63D0;&#x4EA4;&#x70B9;&#x4E4B;&#x524D;&#x7531;&#x4E8B;&#x52A1;&#x7684;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x5E93;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x5728;&#x5E94;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x524D;&#x8BB0;&#x5F55;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6062;&#x590D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x5230;&#x8FBE;&#x5176;&#x63D0;&#x4EA4;&#x70B9;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x64A4;&#x6D88;&#x5176;&#x64CD;&#x4F5C;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5373;&#x5FC5;&#x987B;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x64A4;&#x6D88;&#x548C;&#x91CD;&#x505A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x79F0;&#x4E3A;<b>&#x64A4;&#x6D88;/&#x91CD;&#x505A;&#x7B97;&#x6CD5;&#x3002;</b></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x7F13;&#x5B58;/&#x7F13;&#x51B2; -</b>&#x5728;&#x8FD9;&#x4E2A;&#x5305;&#x542B;&#x8981;&#x66F4;&#x65B0;&#x7684;&#x6570;&#x636E;&#x9879;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x78C1;&#x76D8;&#x9875;&#x9762;&#x4E2D;&#x7F13;&#x5B58;&#x5230;&#x4E3B;&#x5185;&#x5B58;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5199;&#x56DE;&#x78C1;&#x76D8;&#x4E4B;&#x524D;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x66F4;&#x65B0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;DBMS&#x7F13;&#x5B58;&#x7684;&#x5185;&#x5B58;&#x7F13;&#x51B2;&#x533A;&#x96C6;&#x5408;&#x7531;DBMS&#x63A7;&#x5236;&#xFF0C;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x8FD9;&#x4E9B;&#x7F13;&#x51B2;&#x533A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x76EE;&#x5F55;&#x7528;&#x4E8E;&#x8DDF;&#x8E2A;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5E93;&#x9879;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x810F;&#x4F4D;&#x4E0E;&#x6BCF;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x5982;&#x679C;&#x672A;&#x4FEE;&#x6539;&#x7F13;&#x51B2;&#x533A;&#x5219;&#x4E3A;0&#xFF0C;&#x5426;&#x5219;&#x4E3A;1&#xFF08;&#x5982;&#x679C;&#x5DF2;&#x4FEE;&#x6539;&#xFF09;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x9634;&#x5F71;&#x5206;&#x9875; -</b>&#x5B83;&#x63D0;&#x4F9B;&#x539F;&#x5B50;&#x6027;&#x548C;&#x6301;&#x4E45;&#x6027;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6784;&#x9020;&#x5177;&#x6709;n&#x4E2A;&#x6761;&#x76EE;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;i&#x4E2A;&#x6761;&#x76EE;&#x6307;&#x5411;&#x94FE;&#x63A5;&#x4E0A;&#x7684;&#x7B2C;i&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x9875;&#x9762;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x88AB;&#x590D;&#x5236;&#x5230;&#x5F71;&#x5B50;&#x76EE;&#x5F55;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x8981;&#x4FEE;&#x6539;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x5C06;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x5F71;&#x5B50;&#x9875;&#x9762;&#xFF0C;&#x5728;&#x8BE5;&#x5F71;&#x5B50;&#x9875;&#x9762;&#x4E2D;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x5B83;&#x51C6;&#x5907;&#x597D;&#x53D8;&#x5F97;&#x8010;&#x7528;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x5F15;&#x7528;&#x539F;&#x59CB;&#x9875;&#x9762;&#x7684;&#x9875;&#x9762;&#x90FD;&#x4F1A;&#x66F4;&#x65B0;&#x4EE5;&#x5F15;&#x7528;&#x65B0;&#x7684;&#x66FF;&#x6362;&#x9875;&#x9762;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x4E9B;&#x5907;&#x4EFD;&#x6280;&#x672F;&#x5982;&#x4E0B;&#xFF1A;</span> </p><br><!-- post_top_responsive --><br><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5B8C;&#x6574;&#x6570;&#x636E;&#x5E93;&#x5907;&#x4EFD; -</b>&#x5728;&#x5305;&#x542B;&#x6570;&#x636E;&#x548C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B8C;&#x6574;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x8FD8;&#x539F;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x6240;&#x9700;&#x7684;&#x5143;&#x4FE1;&#x606F;&#xFF08;&#x5305;&#x62EC;&#x5168;&#x6587;&#x76EE;&#x5F55;&#xFF09;&#x4EE5;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x8FDB;&#x884C;&#x5907;&#x4EFD;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5DEE;&#x5F02;&#x5907;&#x4EFD; -</b>&#x4EC5;&#x5B58;&#x50A8;&#x81EA;&#x4E0A;&#x6B21;&#x5B8C;&#x5168;&#x6570;&#x636E;&#x5E93;&#x5907;&#x4EFD;&#x4EE5;&#x6765;&#x53D1;&#x751F;&#x7684;&#x6570;&#x636E;&#x66F4;&#x6539;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x81EA;&#x4E0A;&#x6B21;&#x5B8C;&#x6574;&#x6570;&#x636E;&#x5E93;&#x5907;&#x4EFD;&#x4EE5;&#x6765;&#x76F8;&#x540C;&#x6570;&#x636E;&#x53D1;&#x751F;&#x591A;&#x6B21;&#x66F4;&#x6539;&#x65F6;&#xFF0C;&#x5DEE;&#x5F02;&#x5907;&#x4EFD;&#x4F1A;&#x5B58;&#x50A8;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5DF2;&#x66F4;&#x6539;&#x6570;&#x636E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6062;&#x590D;&#x5B8C;&#x6574;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5907;&#x4EFD;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x5907;&#x4EFD; -</b>&#x5728;&#x6B64;&#xFF0C; <b>&#x5907;&#x4EFD;</b>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x4EF6;&#xFF0C;&#x5982;&#x6BCF;&#x4E2A;&#x6267;&#x884C;&#x7684;&#x8BED;&#x53E5;&#x7684;&#x8BB0;&#x5F55;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x662F;&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x6761;&#x76EE;&#x7684;&#x5907;&#x4EFD;&#xFF0C;&#x5305;&#x542B;&#x53D1;&#x751F;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x88AB;&#x7834;&#x574F;&#x5E76;&#x4E14;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x4E22;&#x5931;&#x5355;&#x4E2A;&#x5DF2;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x4ECE;&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x6267;&#x884C;&#x5907;&#x4EFD;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x53C2;&#x8003; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://www.cs.uct.ac.za/mit_notes/database/htmls/chp14.html" target="_blank">&#x5907;&#x4EFD;&#x548C;&#x6062;&#x590D; -  cs.uct.ac.za/mit_notes</a></span> </p><br><!-- post_bottom_responsive --><br><br><!-- .entry-meta --></div></body></html>