<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;</b>&#x662F;&#x76F8;&#x4E92;&#x5173;&#x8054;&#x7684;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5176;&#x5305;&#x62EC;&#x6587;&#x672C;&#xFF0C;&#x56FE;&#x5F62;&#xFF08;&#x8349;&#x56FE;&#xFF0C;&#x7ED8;&#x56FE;&#xFF09;&#xFF0C;&#x56FE;&#x50CF;&#xFF0C;&#x52A8;&#x753B;&#xFF0C;&#x89C6;&#x9891;&#xFF0C;&#x97F3;&#x9891;&#x7B49;&#xFF0C;&#x5E76;&#x4E14;&#x5177;&#x6709;&#x5927;&#x91CF;&#x7684;&#x591A;&#x6E90;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7BA1;&#x7406;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x4F20;&#x9012;&#x548C;&#x5229;&#x7528;&#x7684;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x7684;&#x6846;&#x67B6;&#x88AB;&#x79F0;&#x4E3A;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x6709;&#x4E09;&#x7C7B;&#xFF0C;&#x5305;&#x62EC;&#x9759;&#x6001;&#x5A92;&#x4F53;&#xFF0C;&#x52A8;&#x6001;&#x5A92;&#x4F53;&#x548C;&#x7EF4;&#x5EA6;&#x5A92;&#x4F53;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5A92;&#x4F53;&#x6570;&#x636E; -</b>&#x8868;&#x793A;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5A92;&#x4F53;&#x683C;&#x5F0F;&#x6570;&#x636E; -</b>&#x5173;&#x4E8E;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x7ECF;&#x8FC7;&#x91C7;&#x96C6;&#xFF0C;&#x5904;&#x7406;&#x548C;&#x7F16;&#x7801;&#x9636;&#x6BB5;&#x540E;&#x7684;&#x683C;&#x5F0F;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x91C7;&#x6837;&#x7387;&#xFF0C;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x7F16;&#x7801;&#x65B9;&#x6848;&#x7B49;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5A92;&#x4F53;&#x5173;&#x952E;&#x5B57;&#x6570;&#x636E; -</b>&#x4E0E;&#x6570;&#x636E;&#x751F;&#x6210;&#x76F8;&#x5173;&#x7684;&#x5173;&#x952E;&#x5B57;&#x63CF;&#x8FF0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x5185;&#x5BB9;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x793A;&#x4F8B;&#xFF1A;&#x65E5;&#x671F;&#xFF0C;&#x65F6;&#x95F4;&#x548C;&#x5F55;&#x97F3;&#x5730;&#x70B9;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5A92;&#x4F53;&#x7279;&#x5F81;&#x6570;&#x636E; -</b>&#x4F9D;&#x8D56;&#x4E8E;&#x5185;&#x5BB9;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#x989C;&#x8272;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x7EB9;&#x7406;&#x7684;&#x79CD;&#x7C7B;&#x548C;&#x6570;&#x636E;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x4E0D;&#x540C;&#x5F62;&#x72B6;&#x3002;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x7279;&#x5F81;&#x7684;&#x591A;&#x5A92;&#x4F53;&#x5E94;&#x7528;&#x7C7B;&#x578B;&#x5305;&#x62EC;&#xFF1A;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5B58;&#x50A8;&#x5E93;&#x5E94;&#x7528;&#x7A0B;&#x5E8F; -</b>&#x5B58;&#x50A8;&#x7528;&#x4E8E;&#x68C0;&#x7D22;&#x76EE;&#x7684;&#x7684;&#x5927;&#x91CF;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x5143;&#x6570;&#x636E;&#xFF08;&#x5A92;&#x4F53;&#x683C;&#x5F0F;&#x65E5;&#x671F;&#xFF0C;&#x5A92;&#x4F53;&#x5173;&#x952E;&#x5B57;&#x6570;&#x636E;&#xFF0C;&#x5A92;&#x4F53;&#x7279;&#x5F81;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x536B;&#x661F;&#x56FE;&#x50CF;&#x7684;&#x5B58;&#x50A8;&#x5E93;&#xFF0C;&#x5DE5;&#x7A0B;&#x56FE;&#xFF0C;&#x653E;&#x5C04;&#x5B66;&#x626B;&#x63CF;&#x56FE;&#x50CF;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x6F14;&#x793A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F; -</b>&#x5B83;&#x4EEC;&#x6D89;&#x53CA;&#x53D7;&#x65F6;&#x95F4;&#x9650;&#x5236;&#x7684;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x7684;&#x4F20;&#x9001;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6700;&#x4F73;&#x89C2;&#x770B;&#x6216;&#x6536;&#x542C;&#x8981;&#x6C42;DBMS&#x4EE5;&#x7279;&#x5B9A;&#x901F;&#x7387;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x4F9B;&#x9AD8;&#x4E8E;&#x7279;&#x5B9A;&#x9608;&#x503C;&#x7684;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x91CC;&#x6570;&#x636E;&#x5728;&#x4EA4;&#x4ED8;&#x65F6;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x793A;&#x4F8B;&#xFF1A;&#x6CE8;&#x91CA;&#x89C6;&#x9891;&#x548C;&#x97F3;&#x9891;&#x6570;&#x636E;&#xFF0C;&#x5B9E;&#x65F6;&#x7F16;&#x8F91;&#x5206;&#x6790;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x4F7F;&#x7528;&#x591A;&#x5A92;&#x4F53;&#x4FE1;&#x606F;&#x7684;&#x534F;&#x4F5C;&#x5DE5;&#x4F5C; -</b>&#x5B83;&#x6D89;&#x53CA;&#x901A;&#x8FC7;&#x5408;&#x5E76;&#x56FE;&#x7EB8;&#xFF0C;&#x66F4;&#x6539;&#x901A;&#x77E5;&#x6765;&#x6267;&#x884C;&#x590D;&#x6742;&#x4EFB;&#x52A1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x793A;&#x4F8B;&#xFF1A;&#x667A;&#x80FD;&#x533B;&#x7597;&#x7F51;&#x7EDC;&#x3002;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x4ECD;&#x9762;&#x4E34;&#x8BB8;&#x591A;&#x6311;&#x6218;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x662F;&#xFF1A;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5EFA;&#x6A21; -</b>&#x5728;&#x8FD9;&#x4E00;&#x9886;&#x57DF;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x6539;&#x8FDB;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x4FE1;&#x606F;&#x68C0;&#x7D22;&#x6280;&#x672F;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6587;&#x4EF6;&#x6784;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x9886;&#x57DF;&#xFF0C;&#x503C;&#x5F97;&#x7279;&#x522B;&#x8003;&#x8651;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x8BBE;&#x8BA1; -</b>&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x903B;&#x8F91;&#x548C;&#x7269;&#x7406;&#x8BBE;&#x8BA1;&#x5C1A;&#x672A;&#x5F97;&#x5230;&#x5145;&#x5206;&#x89E3;&#x51B3;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x7EA7;&#x522B;&#x7684;&#x6027;&#x80FD;&#x548C;&#x8C03;&#x4F18;&#x95EE;&#x9898;&#x90FD;&#x8981;&#x590D;&#x6742;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5305;&#x542B;JPEG&#xFF0C;GIF&#xFF0C;PNG&#xFF0C;MPEG&#x7B49;&#x5404;&#x79CD;&#x683C;&#x5F0F;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x4ECE;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x8F6C;&#x6362;&#x4E3A;&#x53E6;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5B58;&#x50A8; -</b>&#x5728;&#x4EFB;&#x4F55;&#x6807;&#x51C6;&#x78C1;&#x76D8;&#x4E0A;&#x5B58;&#x50A8;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x5B58;&#x5728;&#x8868;&#x793A;&#xFF0C;&#x538B;&#x7F29;&#xFF0C;&#x6620;&#x5C04;&#x5230;&#x8BBE;&#x5907;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#xFF0C;&#x5728;&#x8F93;&#x5165; - &#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x671F;&#x95F4;&#x5B58;&#x6863;&#x548C;&#x7F13;&#x51B2;&#x7684;&#x95EE;&#x9898;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;DBMS&#x4E2D;&#xFF0C;&#x201C;BLOB&#x201D;&#xFF08;&#x4E8C;&#x8FDB;&#x5236;&#x5927;&#x5BF9;&#x8C61;&#xFF09;&#x5DE5;&#x5177;&#x5141;&#x8BB8;&#x5B58;&#x50A8;&#x548C;&#x68C0;&#x7D22;&#x65E0;&#x7C7B;&#x578B;&#x4F4D;&#x56FE;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x6027;&#x80FD; -</b>&#x5BF9;&#x4E8E;&#x6D89;&#x53CA;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x6216;&#x97F3;&#x9891; - &#x89C6;&#x9891;&#x540C;&#x6B65;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x7269;&#x7406;&#x9650;&#x5236;&#x5360;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5E76;&#x884C;&#x5904;&#x7406;&#x7684;&#x4F7F;&#x7528;&#x53EF;&#x4EE5;&#x7F13;&#x89E3;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x5C1A;&#x672A;&#x5B8C;&#x5168;&#x5F00;&#x53D1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x8FD8;&#x6D88;&#x8017;&#x5927;&#x91CF;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x548C;&#x5E26;&#x5BBD;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x67E5;&#x8BE2;&#x548C;&#x68C0;&#x7D22; -</b>&#x5BF9;&#x4E8E;&#x56FE;&#x50CF;&#xFF0C;&#x89C6;&#x9891;&#x7B49;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x7684;&#x97F3;&#x9891;&#x6253;&#x5F00;&#x4E86;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x9AD8;&#x6548;&#x7684;&#x67E5;&#x8BE2;&#x5236;&#x5B9A;&#xFF0C;&#x67E5;&#x8BE2;&#x6267;&#x884C;&#x548C;&#x4F18;&#x5316;&#x7B49;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#x3002;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5E94;&#x7528;&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9886;&#x57DF;&#x662F;&#xFF1A;</b></span> </p><br><!-- post_top_responsive --><br><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x6587;&#x4EF6;&#x548C;&#x8BB0;&#x5F55;&#x7BA1;&#x7406;&#xFF1A;</b>&#x4FDD;&#x5B58;&#x8BE6;&#x7EC6;&#x8BB0;&#x5F55;&#x548C;&#x5404;&#x79CD;&#x6587;&#x4EF6;&#x7684;&#x884C;&#x4E1A;&#x548C;&#x4F01;&#x4E1A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x793A;&#x4F8B;&#xFF1A;&#x4FDD;&#x9669;&#x7D22;&#x8D54;&#x8BB0;&#x5F55;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x77E5;&#x8BC6;&#x4F20;&#x64AD;&#xFF1A;</b>&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x5728;&#x63D0;&#x4F9B;&#x591A;&#x79CD;&#x8D44;&#x6E90;&#x65B9;&#x9762;&#x662F;&#x77E5;&#x8BC6;&#x4F20;&#x64AD;&#x7684;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x5DE5;&#x5177;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x793A;&#x4F8B;&#xFF1A;&#x7535;&#x5B50;&#x4E66;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x6559;&#x80B2;&#x548C;&#x57F9;&#x8BAD;&#xFF1A;</b>&#x8BA1;&#x7B97;&#x673A;&#x8F85;&#x52A9;&#x5B66;&#x4E60;&#x6750;&#x6599;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x591A;&#x5A92;&#x4F53;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x662F;&#x5F53;&#x4ECA;&#x975E;&#x5E38;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x5B66;&#x4E60;&#x8D44;&#x6E90;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x793A;&#x4F8B;&#xFF1A;&#x6570;&#x5B57;&#x56FE;&#x4E66;&#x9986;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8425;&#x9500;&#xFF0C;&#x5E7F;&#x544A;&#xFF0C;&#x96F6;&#x552E;&#xFF0C;&#x5A31;&#x4E50;&#x548C;&#x65C5;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x793A;&#x4F8B;&#xFF1A;&#x865A;&#x62DF;&#x57CE;&#x5E02;&#x4E4B;&#x65C5;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5B9E;&#x65F6;&#x63A7;&#x5236;&#x548C;&#x76D1;&#x63A7;&#xFF1A;</b>&#x7ED3;&#x5408;&#x4E3B;&#x52A8;&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#xFF0C;&#x591A;&#x5A92;&#x4F53;&#x4FE1;&#x606F;&#x663E;&#x793A;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x6709;&#x6548;&#x5730;&#x76D1;&#x63A7;&#x590D;&#x6742;&#x4EFB;&#x52A1;&#x793A;&#x4F8B;&#xFF1A;&#x5236;&#x9020;&#x8FD0;&#x884C;&#x63A7;&#x5236;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x53C2;&#x8003; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://en.wikipedia.org/wiki/Multimedia_database" target="_blank">&#x591A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x5E93; - &#x7EF4;&#x57FA;&#x767E;&#x79D1;</a></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://www.amazon.in/Fundamentals-Database-Systems-Ramez-Elmasri/dp/0136086209" target="_blank">&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x57FA;&#x7840;</a></span> </p><br><!-- post_bottom_responsive --><br><br><!-- .entry-meta --></div></body></html>