<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x4F55;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x50A8;&#x5BC6;&#x7801;&#xFF1F;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5927;&#x591A;&#x6570;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8981;&#x6C42;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x8BE2;&#x95EE;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x6765;&#x9A8C;&#x8BC1;&#x81EA;&#x5DF1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x4EEC;&#x5C06;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x51ED;&#x636E;&#x4E0E;&#x5B58;&#x50A8;&#x5728;&#x5176;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x5982;&#x679C;&#x51ED;&#x636E;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x6388;&#x4E88;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x542C;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#xFF01;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7AD9;&#x5B58;&#x50A8;&#x60A8;&#x7684;&#x5BC6;&#x7801;&#x7684;&#x6570;&#x636E;&#x5E93;&#x53D7;&#x5230;&#x635F;&#x5BB3;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x4E86;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x50A8;&#x5BC6;&#x7801;&#x7684;&#x5404;&#x79CD;&#x6280;&#x672F;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6839;&#x636E;<a href="https://nakedsecurity.sophos.com/2013/04/23/users-same-password-most-websites/" target="_blank">&#x88F8;&#x4F53;&#x5B89;&#x5168;&#x6027;</a> &#xFF0C;55&#xFF05;&#x7684;&#x7F51;&#x7EDC;&#x7528;&#x6237;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x7F51;&#x7AD9;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5BC6;&#x7801;&#xFF01;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x7EAF;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x5BC6;&#x7801;&#x7684;&#x7F51;&#x7AD9;&#x906D;&#x5230;&#x5165;&#x4FB5;&#xFF0C;&#x9ED1;&#x5BA2;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x8BE5;&#x7F51;&#x7AD9;&#x4E0A;&#x7684;&#x5E10;&#x6237;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x60A8;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x5BC6;&#x7801;&#x7684;&#x6240;&#x6709;&#x793E;&#x4EA4;&#x5A92;&#x4F53;&#xFF0C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x8BBA;&#x575B;&#x7B49;&#x5E10;&#x6237;&#xFF01;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x597D;&#x5427;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4E00;&#x5B9A;&#x60F3;&#x77E5;&#x9053;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x66B4;&#x9732;&#x7ED9;&#x9ED1;&#x5BA2;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9ED1;&#x5BA2;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9519;&#x8BEF;&#xFF01;&#xFF01;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6709;&#x8BB8;&#x591A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4F7F;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x68C0;&#x7D22;&#x5BC6;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x5BF9;&#x4E8E;&#x9ED1;&#x5BA2;&#x6765;&#x8BF4;&#x53D8;&#x5F97;&#x9EBB;&#x70E6;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E5F;&#x503E;&#x5411;&#x4E8E;&#x5FFD;&#x7565;&#x57FA;&#x672C;&#x51C6;&#x5219;&#x5E76;&#x4EE5;&#x660E;&#x6587;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x5BC6;&#x7801;&#x3002;&#x6709;&#x8D85;&#x8FC7;30&#xFF05;&#x7684;&#x7F51;&#x7AD9;&#x4EE5;&#x7EAF;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x60A8;&#x7684;&#x5BC6;&#x7801;&#xFF08;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x77E5;&#x540D;&#x7F51;&#x7AD9;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x7F51;&#x7AD9;&#x4EE5;&#x660E;&#x6587;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x60A8;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x60A8;&#x9009;&#x62E9;&#x591A;&#x4E48;&#x5F3A;&#x5927;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x60A8;&#x90FD;&#x4E0D;&#x5B89;&#x5168;&#xFF01;</span> <br><br> <strong><br></strong> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong><em>&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x50A8;&#x7EAF;&#x6587;&#x672C;&#x5BC6;&#x7801;&#x662F;&#x4E00;&#x79CD;&#x7F6A;&#x8FC7;&#x3002;</em></strong></span> <strong><br></strong> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x7EAF;&#x6587;&#x672C;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x52A0;&#x5BC6;&#x5BC6;&#x7801;&#x7136;&#x540E;&#x5B58;&#x50A8;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x7CDF;&#x7CD5;&#x7684;&#x4E3B;&#x610F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x52A0;&#x5BC6;&#x51FD;&#x6570;&#x63D0;&#x4F9B;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x5BF9;&#x4E00;&#x6620;&#x5C04;&#xFF0C;&#x5B83;&#x4EEC;&#x59CB;&#x7EC8;&#x662F;&#x53EF;&#x9006;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x9ED1;&#x5BA2;&#x83B7;&#x5F97;&#x5BC6;&#x94A5;&#xFF0C;&#x4ED6;&#x5C06;&#x80FD;&#x591F;&#x89E3;&#x5BC6;&#x5BC6;&#x7801;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x5355;&#x5411;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6563;&#x5217;&#x51FD;&#x6570;&#x5728;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x4E4B;&#x95F4;&#x63D0;&#x4F9B;&#x591A;&#x5BF9;&#x6620;&#x5C04;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x53EF;&#x80FD;&#x53CD;&#x8F6C;&#x8F93;&#x51FA;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x826F;&#x597D;&#x7684;&#x52A0;&#x5BC6;&#x6563;&#x5217;&#x51FD;&#x6570;&#x5177;&#x6709;&#x8F83;&#x5C11;&#x6570;&#x91CF;&#x7684;<a href="https://en.wikipedia.org/wiki/Collision_(computer_science)" target="_blank">&#x78B0;&#x649E;</a> &#xFF08;&#x5373;&#xFF0C;&#x5BF9;&#x4E8E;&#x51FD;&#x6570;&#x7684;&#x4E0D;&#x540C;&#x8F93;&#x5165;&#x503C;&#xFF0C;&#x96BE;&#x4EE5;&#x83B7;&#x5F97;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x51FA;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;<a href="https://en.wikipedia.org/wiki/Pigeonhole_principle" target="_blank">&#x9E3D;&#x5B50;&#x539F;&#x5219;&#xFF0C;</a>&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x907F;&#x514D;&#x78B0;&#x649E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#x4E8E;&#x6563;&#x5217;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x6563;&#x5217;&#x51FD;&#x6570;&#x5C06;&#x751F;&#x6210;&#x552F;&#x4E00;&#x8F93;&#x51FA;&#xFF0C;&#x5373;&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x83B7;&#x5F97;&#x76F8;&#x540C;&#x7684;&#x6563;&#x5217;&#x503C;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x4E9B;&#x6D41;&#x884C;&#x7684;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x662F;<a href="https://en.wikipedia.org/wiki/MD5" target="_blank">MD5</a>&#x548C;<a href="https://en.wikipedia.org/wiki/SHA-1" target="_blank">SHA1</a> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x50A8;&#x7EAF;&#x6587;&#x672C;&#x5BC6;&#x7801;&#xFF0C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5B58;&#x50A8;&#x5BC6;&#x7801;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x4ECE;&#x54C8;&#x5E0C;&#x4E2D;&#x83B7;&#x53D6;&#x5B9E;&#x9645;&#x5BC6;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x51ED;&#x636E;&#xFF1F;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5BF9;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x5BC6;&#x7801;&#x5E94;&#x7528;&#x76F8;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x4E0E;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x54C8;&#x5E0C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x54C8;&#x5E0C;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x7528;&#x6237;&#x88AB;&#x8BA4;&#x8BC1;&#xFF08;&#x56E0;&#x4E3A;&#x76F8;&#x540C;&#x8F93;&#x5165;&#x7684;&#x54C8;&#x5E0C;&#x5C06;&#x7ED9;&#x51FA;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x51FA;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x6570;&#x636E;&#x5E93;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x4ED6;&#x5C06;&#x53EA;&#x80FD;&#x67E5;&#x770B;&#x6563;&#x5217;&#x8F93;&#x51FA;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x9645;&#x5BC6;&#x7801;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong><em>&#x4F7F;&#x7528;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x6BD4;&#x5B58;&#x50A8;&#x7EAF;&#x6587;&#x672C;&#x5BC6;&#x7801;&#x66F4;&#x597D;</em> &#x3002;</strong></span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9ED1;&#x5BA2;&#x662F;&#x806A;&#x660E;&#x4EBA;&#xFF0C;&#x4E00;&#x65E6;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6B63;&#x5728;&#x5B58;&#x50A8;&#x54C8;&#x5E0C;&#x5BC6;&#x7801;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x9884;&#x5148;&#x8BA1;&#x7B97;&#x4E86;&#x5927;&#x91CF;&#x5355;&#x8BCD;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF08;&#x6765;&#x81EA;&#x6D41;&#x884C;&#x7684;&#x5355;&#x8BCD;&#x5217;&#x8868;&#x6216;&#x5B57;&#x5178;&#x5355;&#x8BCD;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4ED6;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x8868;&#x548C;&#x76F8;&#x5E94;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B64;&#x8868;&#x79F0;&#x4E3A;<a href="https://en.wikipedia.org/wiki/Rainbow_table" target="_blank">&#x5F69;&#x8679;&#x8868;</a> &#xFF0C;&#x53EF;&#x5728;&#x7EBF;&#x83B7;&#x53D6;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B64;&#x8868;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x83B7;&#x53D6;&#x7684;&#x54C8;&#x5E0C;&#x6765;&#x53CD;&#x5411;&#x67E5;&#x627E;&#x5B9E;&#x9645;&#x5BC6;&#x7801;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x62E5;&#x6709;&#x4E00;&#x4E2A;<strong>&#x5F3A;&#x5BC6;&#x7801;</strong>&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5BC6;&#x7801;&#x51FA;&#x73B0;&#x5728;&#x5355;&#x8BCD;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4F1A;&#x964D;&#x4F4E;&#x3002;</span> </p><p><img src="../../../imgs/db/98c24e6ea4d10dee10341c83454b6d25.jpg" alt="&#x5BC6;&#x7801;&#x5F69;&#x8679;&#x8868;" class="alignnone size-full wp-image-170780"></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7B80;&#x5355;&#x5730;&#x5B58;&#x50A8;&#x5BC6;&#x7801;&#x7684;&#x54C8;&#x5E0C;&#x5C31;&#x4E0D;&#x518D;&#x6709;&#x7528;&#x4E86;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x968F;&#x7740;GPU&#x548C;CUDA&#xFF0C;OpenCL&#x5E93;&#x7684;&#x5F15;&#x5165;&#xFF0C;&#x5904;&#x7406;&#x80FD;&#x529B;&#x6025;&#x5267;&#x589E;&#x52A0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5FEB;&#x901F;GPU&#x53EF;&#x5728;&#x4E00;&#x79D2;&#x5185;&#x4EA7;&#x751F;&#x6570;&#x767E;&#x4E07;&#x4E2A;MD5 / SHA1&#x54C8;&#x5E0C;&#x503C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x9ED1;&#x5BA2;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x5404;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x7EC4;&#x5408;&#x6765;&#x8F7B;&#x677E;&#x751F;&#x6210;&#x5927;&#x91CF;&#x54C8;&#x5E0C;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4E0E;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x4EE5;&#x63D0;&#x53D6;&#x5B9E;&#x9645;&#x5BC6;&#x7801;&#x3002;</span> <br></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5373;&#x4F7F;&#x662F;&#x6563;&#x5217;&#x5BC6;&#x7801;&#x4E5F;&#x4E0D;&#x5B89;&#x5168;&#xFF01;</strong></span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x60CA;&#x8BB6;&#x5417;&#xFF1F;</strong></span> <strong><br></strong> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E0D;&#x8981;&#x5931;&#x53BB;&#x5E0C;&#x671B;&#xFF01;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x4E00;&#x4E9B;&#x63AA;&#x65BD;&#x6765;&#x9632;&#x6B62;&#x5BC6;&#x7801;&#x8FDC;&#x79BB;&#x9ED1;&#x5BA2;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x76D0;&#x6765;&#x4F7F;&#x5BC6;&#x7801;&#x53D8;&#x5F97;&#x7F8E;&#x5473;&#xFF01;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#xFF0C;&#x5BF9;......</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://en.wikipedia.org/wiki/Salt_(cryptography)" target="_blank">&#x52A0;&#x76D0;</a> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> salt&#x662F;&#x968F;&#x673A;&#x6570;&#x636E;&#xFF0C;&#x5728;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#x53D1;&#x9001;&#x4E4B;&#x524D;&#x4E0E;&#x60A8;&#x7684;&#x5BC6;&#x7801;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x4F8B;&#x5982;</strong> &#xFF1A;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x60A8;&#x7684;&#x5BC6;&#x7801;&#x662F;<em>abc</em>&#x4E14;salt&#x662F;<em>&#xFF01;ZaP0&#xFF03;8</em> &#xFF0C;&#x5219;<strong><em>hashFunction&#xFF08;&apos;abc&#xFF01;ZaP0&#xFF03;8&apos;&#xFF09;&#x7684;&#x7ED3;&#x679C;</em></strong>&#x5C06;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x800C;&#x4E0D;&#x662F;<strong><em>hashFunction&#xFF08;&apos;abc&apos;&#xFF09;&#x4E2D;</em></strong> &#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#x5F69;&#x8679;&#x8868;&#x653B;&#x51FB;&#x73B0;&#x5728;&#x4E0D;&#x4F1A;&#x6709;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x5F69;&#x8679;&#x8868;&#x5305;&#x542B;<em>&apos;abc&#xFF01;ZaP0&#xFF03;8&apos;&#x7684;</em>&#x6563;&#x5217;&#x7684;&#x6982;&#x7387;<em>&#x5F88;&#x5C0F;</em> &#xFF08;&#x56E0;&#x4E3A;&#x901A;&#x5E38;&#x5F69;&#x8679;&#x8868;&#x662F;&#x7531;&#x5E38;&#x7528;&#x8BCD;&#xFF0C;&#x5B57;&#x5178;&#x8BCD;&#x7B49;&#x6784;&#x6210;&#x7684;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> Salt&#x4E0D;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x53EA;&#x5B58;&#x5728;&#x4E8E;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x83B7;&#x53D6;&#x5BF9;&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x6BD4;&#x83B7;&#x53D6;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x8981;&#x56F0;&#x96BE;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E0A;&#x8FF0;&#x814C;&#x5236;&#x65B9;&#x6CD5;&#x662F;&#x9759;&#x6001;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6211;&#x4EEC;&#x4E3A;&#x6240;&#x6709;&#x5BC6;&#x7801;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x76D0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8981;&#x5BF9;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#xFF0C;&#x9996;&#x5148;&#x5C06;&#x56FA;&#x5B9A;salt&#x8FDE;&#x63A5;&#x5230;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x8F93;&#x5165;&#xFF08;&#x5BC6;&#x7801;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x503C;&#x4F20;&#x9012;&#x7ED9;&#x6563;&#x5217;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4E0E;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x503C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4ECD;&#x7136;&#x5BB9;&#x6613;&#x53D7;&#x5230;&#x66B4;&#x529B;&#x653B;&#x51FB;&#xFF0C;&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x9759;&#x6001;&#x76D0;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FDE;&#x63A5;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x4E2D;&#x7684;&#x76D0;&#x6765;&#x4F7F;&#x7528;&#x65E7;&#x7684;&#x653B;&#x51FB;&#x65B9;&#x6CD5;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x76D0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x901A;&#x8FC7;&#x52A0;&#x5BC6;&#x5F3A;&#x968F;&#x673A;&#x5B57;&#x7B26;&#x4E32;&#x751F;&#x6210;&#x5668;&#x751F;&#x6210;&#x65B0;&#x7684;&#x76D0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x5BC6;&#x7801;&#x4E0E;&#x968F;&#x673A;&#x751F;&#x6210;&#x7684;&#x76D0;&#x4EE5;&#x53CA;&#x9759;&#x6001;&#x76D0;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FDE;&#x63A5;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#x4F20;&#x9012;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x83B7;&#x5F97;&#x7684;&#x7ED3;&#x679C;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x52A8;&#x6001;&#x76D0;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x8981;&#x5BF9;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x83B7;&#x53D6;&#x8BE5;&#x7528;&#x6237;&#x7684;&#x52A8;&#x6001;salt&#x7684;&#x503C;&#xFF0C;&#x5B83;&#x5C06;&#x4E0E;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x8F93;&#x5165;&#x548C;&#x9759;&#x6001;salt&#x8FDE;&#x63A5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5C06;&#x7ED3;&#x679C;&#x4E0E;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x54C8;&#x5E0C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x906D;&#x5230;&#x7834;&#x574F;&#xFF0C;&#x9ED1;&#x5BA2;&#x4E0D;&#x4EC5;&#x4F1A;&#x83B7;&#x5F97;&#x60A8;&#x7684;&#x5BC6;&#x7801;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x8FD8;&#x4F1A;&#x83B7;&#x5F97;&#x4F7F;&#x7528;&#x7684;&#x52A8;&#x6001;&#x76D0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053;&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x6709;&#x52A8;&#x6001;&#x76D0;&#xFF0C;&#x52A8;&#x6001;&#x76D0;&#x6BD4;&#x9759;&#x6001;&#x76D0;&#x6709;&#x4EC0;&#x4E48;&#x4F18;&#x52BF;&#xFF1F;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5373;&#x4F7F;&#x653B;&#x51FB;&#x8005;&#x5177;&#x6709;&#x52A8;&#x6001;&#x76D0;&#xFF0C;&#x4ED6;&#x4E5F;&#x9700;&#x8981;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF08;&#x6216;&#x5F69;&#x8679;&#x8868;&#xFF09;&#xFF08;&#x6839;&#x636E;&#x52A8;&#x6001;&#x76D0;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x6BD4;&#x4E3A;&#x6240;&#x6709;&#x7528;&#x6237;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8868;&#x8981;&#x6602;&#x8D35;&#x5F97;&#x591A;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E0A;&#x8FF0;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x51CF;&#x7F13;&#x9ED1;&#x5BA2;&#x7684;&#x901F;&#x5EA6;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;<em>bcrypt</em>&#x548C;<em>scrypt</em>&#x7B49;&#x7B97;&#x6CD5;&#x4EE3;&#x66FF;MD5 / SHA1&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> Bcrypt&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;Blowfish&#x7684;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x8981;&#x6C42;&#x60A8;&#x6307;&#x5B9A;&#x6210;&#x672C;/&#x5DE5;&#x4F5C;&#x56E0;&#x7D20;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5DE5;&#x4F5C;&#x56E0;&#x7D20;&#x4F7F;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x53D8;&#x6162;&#xFF0C;&#x56E0;&#x6B64;&#x751F;&#x6210;&#x6563;&#x5217;&#x8868;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x589E;&#x52A0;&#x591A;&#x500D;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://nakedsecurity.sophos.com/2013/11/20/serious-security-how-to-store-your-users-passwords-safely/" target="_blank">https://nakedsecurity.sophos.com/2013/11/20/serious-security-how-to-store-your-users-passwords-safely/</a></span> </p><br><!-- post_bottom_responsive --><br><br><!-- .entry-meta --></div></body></html>