<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/os/37.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x7EA7;&#x53CD;&#x9988;&#x961F;&#x5217;&#x8C03;&#x5EA6;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x5148;&#x51B3;&#x6761;&#x4EF6; -</b> <a href="https://www.geeksforgeeks.org/gate-notes-operating-system-process-scheduling/" target="_blank">CPU&#x8C03;&#x5EA6;</a> &#xFF0C; <a href="https://www.geeksforgeeks.org/operating-system-multilevel-queue-scheduling/" target="_blank">&#x591A;&#x7EA7;&#x961F;&#x5217;&#x8C03;&#x5EA6;</a></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B64;&#x8C03;&#x5EA6;&#x7C7B;&#x4F3C;&#x4E8E;&#x591A;&#x7EA7;&#x961F;&#x5217;&#xFF08;MLQ&#xFF09;&#x8C03;&#x5EA6;&#xFF0C;&#x4F46;&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x5728;&#x961F;&#x5217;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x591A;&#x7EA7;&#x53CD;&#x9988;&#x961F;&#x5217;&#x8C03;&#x5EA6;&#xFF08;MLFQ&#xFF09;</b>&#x4E0D;&#x65AD;&#x5206;&#x6790;&#x8FDB;&#x7A0B;&#x7684;&#x884C;&#x4E3A;&#xFF08;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF09;&#x5E76;&#x6839;&#x636E;&#x5176;&#x66F4;&#x6539;&#x5176;&#x4F18;&#x5148;&#x7EA7;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x8868;&#x548C;&#x8BF4;&#x660E;&#x4EE5;&#x6B63;&#x786E;&#x7406;&#x89E3;&#x5B83;&#x3002;</span> <br><img src="../../../imgs/os/8757862b4e3ec9862808f0379f901e49.jpg" alt="" width="300" height="269" class="aligncenter size-medium wp-image-234378"><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x961F;&#x5217;1&#x548C;2&#x5206;&#x522B;&#x9075;&#x5FAA;&#x5FAA;&#x73AF;&#xFF0C;&#x65F6;&#x95F4;&#x5206;&#x91CF;&#x4E3A;4&#x548C;8&#xFF0C;&#x961F;&#x5217;3&#x8DDF;&#x968F;FCFS&#x3002;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x4E86;MFQS&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0; - </span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x8FDB;&#x7A0B;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x8FDB;&#x5165;&#x961F;&#x5217;1&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x961F;&#x5217;1&#x4E2D;&#xFF0C;&#x8FDB;&#x7A0B;&#x6267;&#x884C;4&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x5728;&#x8FD9;4&#x4E2A;&#x5355;&#x5143;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x5728;&#x8FD9;4&#x4E2A;&#x5355;&#x5143;&#x4E2D;&#x4E3A;CPU&#x8FDB;&#x884C;I / O&#x64CD;&#x4F5C;&#xFF0C;&#x5219;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x518D;&#x6B21;&#x8FDB;&#x5165;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x800C;&#x4E0D;&#x662F;&#x518D;&#x6B21;&#x8FDB;&#x5165;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x5728;&#x961F;&#x5217;1&#x4E2D;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x961F;&#x5217;1&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#x672A;&#x5728;4&#x5355;&#x5143;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x5219;&#x5176;&#x4F18;&#x5148;&#x7EA7;&#x964D;&#x4F4E;&#x5E76;&#x8F6C;&#x79FB;&#x5230;&#x961F;&#x5217;2&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BF9;&#x4E8E;&#x961F;&#x5217;2&#x8FDB;&#x7A0B;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x70B9;2&#x548C;3&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x662F;&#x65F6;&#x95F4;&#x91CF;&#x662F;8&#x4E2A;&#x5355;&#x4F4D;&#x3002;&#x5728;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x6CA1;&#x6709;&#x5728;&#x65F6;&#x95F4;&#x91CF;&#x4E0A;&#x5B8C;&#x6210;&#x800C;&#x4E0D;&#x662F;&#x5B83;&#x88AB;&#x8F6C;&#x79FB;&#x5230;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#x961F;&#x5217;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x8FDB;&#x7A0B;&#x4EE5;FCFS&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F18;&#x5148;&#x7EA7;&#x8F83;&#x4F4E;&#x7684;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#x53EA;&#x6709;&#x5728;&#x4F18;&#x5148;&#x7EA7;&#x8F83;&#x9AD8;&#x7684;&#x961F;&#x5217;&#x4E3A;&#x7A7A;&#x65F6;&#x624D;&#x80FD;&#x6267;&#x884C;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x8F83;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#x961F;&#x5217;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x88AB;&#x5230;&#x8FBE;&#x8F83;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x961F;&#x5217;&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#x65AD;&#x3002;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x597D;&#x5427;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x5B9E;&#x73B0;&#x53EF;&#x80FD;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4F8B;&#x5982;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x4E5F;&#x53EF;&#x4EE5;&#x9075;&#x5FAA;&#x5FAA;&#x73AF;&#x8C03;&#x5EA6;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x4E0A;&#x8FF0;&#x5B9E;&#x73B0;&#x4E2D;&#x7684;&#x95EE;&#x9898; -</strong>&#x7531;&#x4E8E;&#x4E00;&#x4E9B;&#x77ED;&#x8FDB;&#x7A0B;&#x5360;&#x7528;&#x4E86;&#x6240;&#x6709;CPU&#x65F6;&#x95F4;&#xFF0C;&#x4F18;&#x5148;&#x7EA7;&#x8F83;&#x4F4E;&#x7684;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x906D;&#x53D7;&#x9965;&#x997F;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x89E3;&#x51B3;&#x65B9;&#x6848; -</strong>&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x662F;&#x5728;&#x5B9A;&#x671F;&#x95F4;&#x9694;&#x540E;&#x63D0;&#x5347;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x5168;&#x90E8;&#x653E;&#x5728;&#x6700;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x961F;&#x5217;&#x4E2D;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x7684;&#x8C03;&#x5EA6;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#xFF1F;</strong></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x6BD4;&#x591A;&#x7EA7;&#x961F;&#x5217;&#x8C03;&#x5EA6;&#x66F4;&#x7075;&#x6D3B;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3A;&#x4E86;&#x4F18;&#x5316;&#x5468;&#x8F6C;&#x65F6;&#x95F4;&#xFF0C;&#x9700;&#x8981;&#x50CF;SJF&#x8FD9;&#x6837;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x6D41;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x6765;&#x5B89;&#x6392;&#x5B83;&#x4EEC;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#x4E8B;&#x5148;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x8FC7;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> MFQS&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x91CF;&#x7A0B;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x5176;&#x4F18;&#x5148;&#x7EA7;&#xFF08;&#x5982;&#x679C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6F2B;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#xFF09;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x4ECE;&#x8FC7;&#x7A0B;&#x7684;&#x8FC7;&#x53BB;&#x884C;&#x4E3A;&#x4E2D;&#x5B66;&#x4E60;&#xFF0C;&#x7136;&#x540E;&#x9884;&#x6D4B;&#x5176;&#x672A;&#x6765;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x5C1D;&#x8BD5;&#x8FD0;&#x884C;&#x66F4;&#x77ED;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4ECE;&#x800C;&#x4F18;&#x5316;&#x5468;&#x8F6C;&#x65F6;&#x95F4;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> MFQS&#x8FD8;&#x7F29;&#x77ED;&#x4E86;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x793A;&#x4F8B; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8003;&#x8651;&#x5177;&#x6709;CPU&#x7ED1;&#x5B9A;&#x8FC7;&#x7A0B;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x9700;&#x8981;40&#x79D2;&#x7684;&#x7A81;&#x53D1;&#x65F6;&#x95F4;&#x3002;&#x4F7F;&#x7528;&#x591A;&#x7EA7;&#x53CD;&#x9988;&#x961F;&#x5217;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x5E76;&#x4E14;&#x961F;&#x5217;&#x65F6;&#x95F4;&#x91CF;&#x5B50;&#x4E3A;&#x201C;2&#x201D;&#x79D2;&#x5E76;&#x4E14;&#x5728;&#x6BCF;&#x4E2A;&#x7EA7;&#x522B;&#x4E2D;&#x5B83;&#x589E;&#x52A0;&#x201C;5&#x201D;&#x79D2;&#x3002;&#x90A3;&#x4E48;&#x8FDB;&#x7A0B;&#x5C06;&#x88AB;&#x4E2D;&#x65AD;&#x591A;&#x5C11;&#x6B21;&#x4EE5;&#x53CA;&#x8FDB;&#x7A0B;&#x5C06;&#x7EC8;&#x6B62;&#x6267;&#x884C;&#x7684;&#x961F;&#x5217;&#xFF1F;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x65B9;&#x6848; - </strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FDB;&#x7A0B;P&#x9700;&#x8981;40&#x79D2;&#x624D;&#x80FD;&#x6267;&#x884C;&#x603B;&#x8BA1;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x961F;&#x5217;1&#x4E2D;&#xFF0C;&#x5B83;&#x6267;&#x884C;2&#x79D2;&#x949F;&#x7136;&#x540E;&#x4E2D;&#x65AD;&#x5E76;&#x8F6C;&#x79FB;&#x5230;&#x961F;&#x5217;2&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x961F;&#x5217;2&#x4E2D;&#xFF0C;&#x5B83;&#x6267;&#x884C;7&#x79D2;&#x949F;&#x7136;&#x540E;&#x4E2D;&#x65AD;&#x5E76;&#x8F6C;&#x79FB;&#x5230;&#x961F;&#x5217;3&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x961F;&#x5217;3&#x4E2D;&#xFF0C;&#x5B83;&#x6267;&#x884C;12&#x79D2;&#x7136;&#x540E;&#x4E2D;&#x65AD;&#x5E76;&#x8F6C;&#x79FB;&#x5230;&#x961F;&#x5217;4&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x961F;&#x5217;4&#x4E2D;&#xFF0C;&#x5B83;&#x6267;&#x884C;17&#x79D2;&#x7136;&#x540E;&#x4E2D;&#x65AD;&#x5E76;&#x8F6C;&#x79FB;&#x5230;&#x961F;&#x5217;5&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x961F;&#x5217;5&#x4E2D;&#xFF0C;&#x5B83;&#x6267;&#x884C;2&#x79D2;&#x949F;&#x7136;&#x540E;&#x5B8C;&#x6210;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x88AB;&#x4E2D;&#x65AD;4&#x6B21;&#x5E76;&#x5728;&#x961F;&#x5217;5&#x4E0A;&#x5B8C;&#x6210;&#x3002;</span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>