<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/os/39.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x5904;&#x7406;&#x5668;&#x8C03;&#x5EA6;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x591A;&#x5904;&#x7406;&#x5668;&#x8C03;&#x5EA6;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<b>&#x591A;&#x4E2A;CPU</b> &#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;<b>&#x8D1F;&#x8F7D;&#x5206;&#x914D;</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x800C;&#xFF0C;&#x4E0E;&#x5355;&#x5904;&#x7406;&#x5668;&#x8C03;&#x5EA6;&#x76F8;&#x6BD4;&#xFF0C;&#x591A;&#x5904;&#x7406;&#x5668;&#x8C03;&#x5EA6;&#x66F4;<b>&#x590D;&#x6742;</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x591A;&#x5904;&#x7406;&#x5668;&#x8C03;&#x5EA6;&#x4E2D;&#xFF0C;&#x5B58;&#x5728;&#x5904;&#x7406;&#x5668;&#x76F8;&#x540C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5373;HOMOGENEOUS&#xFF0C;&#x5C31;&#x5176;&#x529F;&#x80FD;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x53EF;&#x7528;&#x7684;&#x5904;&#x7406;&#x5668;&#x6765;&#x8FD0;&#x884C;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x8FDB;&#x7A0B;&#x3002;</span> </p><h3 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x5904;&#x7406;&#x5668;&#x8C03;&#x5EA6;&#x7684;&#x65B9;&#x6CD5; - </span> </h3><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x6240;&#x6709;&#x8C03;&#x5EA6;&#x51B3;&#x7B56;&#x548C;I / O&#x5904;&#x7406;&#x7531;&#x79F0;&#x4E3A;<b>&#x4E3B;&#x670D;&#x52A1;&#x5668;</b>&#x7684;&#x5355;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x4EC5;&#x6267;&#x884C;<b>&#x7528;&#x6237;&#x4EE3;&#x7801;</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x6570;&#x636E;&#x5171;&#x4EAB;&#x7684;&#x9700;&#x8981;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6574;&#x4E2A;&#x573A;&#x666F;&#x79F0;&#x4E3A;<b>&#x975E;&#x5BF9;&#x79F0;&#x591A;&#x5904;&#x7406;</b> &#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;<b>&#x5BF9;&#x79F0;&#x591A;&#x5904;&#x7406;</b> &#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x90FD;&#x662F;<b>&#x81EA;&#x8C03;&#x5EA6;&#x7684;</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x516C;&#x5171;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x53EF;&#x4EE5;&#x5177;&#x6709;&#x5176;&#x81EA;&#x5DF1;&#x7684;&#x4E13;&#x7528;&#x961F;&#x5217;&#x4EE5;&#x7528;&#x4E8E;&#x5C31;&#x7EEA;&#x8FDB;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x8FC7;&#x4F7F;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x7684;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x68C0;&#x67E5;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x5E76;&#x9009;&#x62E9;&#x8981;&#x6267;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#x3002;</span> </p><h3 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5904;&#x7406;&#x5668;&#x4EB2;&#x548C;&#x529B; - </span> </h3><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5904;&#x7406;&#x5668;&#x5173;&#x8054;&#x6027;&#x610F;&#x5473;&#x7740;&#x8FDB;&#x7A0B;&#x4E0E;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x5904;&#x7406;&#x5668;&#x5177;&#x6709;<b>&#x4EB2;&#x7F18;&#x5173;&#x7CFB;</b> &#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x8FDB;&#x7A0B;&#x5728;&#x7279;&#x5B9A;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5BF9;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5B58;&#x50A8;&#x5668;&#x6709;&#x67D0;&#x4E9B;&#x5F71;&#x54CD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BE5;&#x8FDB;&#x7A0B;&#x6700;&#x8FD1;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x636E;&#x586B;&#x5145;&#x5904;&#x7406;&#x5668;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x5E38;&#x5728;&#x9AD8;&#x901F;&#x7F13;&#x51B2;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x6EE1;&#x8DB3;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x8FDE;&#x7EED;&#x5B58;&#x50A8;&#x5668;&#x8BBF;&#x95EE;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x8FC1;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x4F7F;&#x7B2C;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x51B2;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x65E0;&#x6548;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x91CD;&#x65B0;&#x586B;&#x5145;&#x7B2C;&#x4E8C;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x548C;&#x91CD;&#x65B0;&#x586B;&#x5145;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x5927;&#x591A;&#x6570;SMP&#xFF08;&#x5BF9;&#x79F0;&#x591A;&#x5904;&#x7406;&#xFF09;&#x7CFB;&#x7EDF;&#x90FD;&#x8BD5;&#x56FE;&#x907F;&#x514D;&#x5C06;&#x8FDB;&#x7A0B;&#x4ECE;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x8FC1;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x4F7F;&#x8FDB;&#x7A0B;&#x5728;&#x540C;&#x4E00;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;<b>PROCESSOR AFFINITY</b> &#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x5668;&#x5173;&#x8054;&#xFF1A;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x8F6F;&#x4EB2;&#x548C;&#x6027; -</b>&#x5F53;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x5C1D;&#x8BD5;&#x4F7F;&#x8FDB;&#x7A0B;&#x5728;&#x540C;&#x4E00;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x4F46;&#x4E0D;&#x4FDD;&#x8BC1;&#x5C06;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x7684;&#x7B56;&#x7565;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x79F0;&#x4E3A;&#x8F6F;&#x5173;&#x8054;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x786C;&#x4EB2;&#x548C;&#x6027; -</b>&#x67D0;&#x4E9B;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;Linux&#xFF09;&#x4E5F;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x652F;&#x6301;Hard Affinity&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x5141;&#x8BB8;&#x8FDB;&#x7A0B;&#x5728;&#x5904;&#x7406;&#x5668;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x8FC1;&#x79FB;&#x3002;</span> </li></ol><h3 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8D1F;&#x8F7D;&#x5747;&#x8861; -</span> </h3><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x662F;&#x4F7F;<b>&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;</b>&#x5747;&#x5300;<b>&#x5206;&#x5E03;</b>&#x5728;SMP&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x7684;<b>&#x73B0;&#x8C61;</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53EA;&#x6709;&#x5728;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x6709;&#x8FDB;&#x7A0B;&#x961F;&#x5217;&#x4E14;&#x6709;&#x8D44;&#x683C;&#x6267;&#x884C;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x624D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x5904;&#x7406;&#x5668;&#x53D8;&#x4E3A;&#x7A7A;&#x95F2;&#xFF0C;&#x5B83;&#x7ACB;&#x5373;&#x4ECE;&#x516C;&#x5171;&#x8FD0;&#x884C;&#x961F;&#x5217;&#x4E2D;&#x63D0;&#x53D6;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;SMP&#xFF08;&#x5BF9;&#x79F0;&#x591A;&#x5904;&#x7406;&#xFF09;&#x4E0A;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4FDD;&#x6301;&#x6240;&#x6709;&#x5904;&#x7406;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x4EE5;&#x5145;&#x5206;&#x5229;&#x7528;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x5426;&#x5219;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x5C06;&#x5904;&#x4E8E;&#x7A7A;&#x95F2;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x5177;&#x6709;&#x9AD8;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x4EE5;&#x53CA;&#x7B49;&#x5F85;&#x5904;&#x7406;&#x5668;&#x7684;&#x5904;&#x7406;&#x5668;&#x5217;&#x8868;&#x3002;&#x4E2D;&#x592E;&#x5904;&#x7406;&#x5668;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x6709;&#x4E24;&#x79CD;&#x5E38;&#x89C4;&#x65B9;&#x6CD5;&#xFF1A;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x63A8;&#x9001;&#x8FC1;&#x79FB; -</b>&#x5728;&#x63A8;&#x9001;&#x8FC1;&#x79FB;&#x4E2D;&#xFF0C;&#x4EFB;&#x52A1;&#x4F1A;&#x5B9A;&#x671F;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x7684;&#x8D1F;&#x8F7D;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x4E0D;&#x5E73;&#x8861;&#xFF0C;&#x5219;&#x901A;&#x8FC7;&#x5C06;&#x8FDB;&#x7A0B;&#x4ECE;&#x8FC7;&#x8F7D;&#x8F6C;&#x79FB;&#x5230;&#x7A7A;&#x95F2;&#x6216;&#x4E0D;&#x592A;&#x7E41;&#x5FD9;&#x7684;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5747;&#x5300;&#x5206;&#x914D;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x7684;&#x8D1F;&#x8F7D;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x62C9;&#x8FC1;&#x79FB; -</b>&#x5F53;&#x7A7A;&#x95F2;&#x5904;&#x7406;&#x5668;&#x4ECE;&#x7E41;&#x5FD9;&#x7684;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x62C9;&#x51FA;&#x7B49;&#x5F85;&#x4EFB;&#x52A1;&#x4EE5;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x62C9;&#x8FC1;&#x79FB;&#x3002;</span> </li></ol><h3 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x6838;&#x5904;&#x7406;&#x5668; - </span> </h3><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x4E2D;&#xFF0C; <b>&#x591A;&#x4E2A;&#x5904;&#x7406;&#x5668;</b>&#x6838;&#x5FC3;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x7269;&#x7406;&#x82AF;&#x7247;&#x4E0A;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6BCF;&#x4E2A;&#x6838;&#x5FC3;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x96C6;&#xFF0C;&#x7528;&#x4E8E;&#x7EF4;&#x62A4;&#x5176;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x663E;&#x793A;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7269;&#x7406;&#x5904;&#x7406;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F7F;&#x7528;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x7684;<b>SMP&#x7CFB;&#x7EDF;</b>&#x6BD4;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7269;&#x7406;&#x82AF;&#x7247;&#x7684;&#x7CFB;&#x7EDF;&#x66F4;&#x5FEB;&#xFF0C;&#x8017;&#x7535;<b>&#x66F4;&#x5C11;</b> &#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x800C;&#xFF0C;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x53EF;&#x80FD;<b>&#x4F7F;</b>&#x8C03;&#x5EA6;&#x95EE;&#x9898;<b>&#x590D;&#x6742;&#x5316;</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x5904;&#x7406;&#x5668;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x7B49;&#x5F85;&#x6570;&#x636E;&#x53D8;&#x5F97;&#x53EF;&#x7528;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x79F0;&#x4E3A;<b>MEMORY STALL</b> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x7531;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#x800C;&#x53D1;&#x751F;&#xFF0C;&#x4F8B;&#x5982;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x672A;&#x547D;&#x4E2D;&#xFF0C;&#x5176;&#x6B63;&#x5728;&#x8BBF;&#x95EE;&#x4E0D;&#x5728;&#x9AD8;&#x901F;&#x7F13;&#x51B2;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x53EF;&#x4EE5;&#x82B1;&#x8D39;&#x9AD8;&#x8FBE;50&#xFF05;&#x7684;&#x65F6;&#x95F4;&#x7B49;&#x5F85;&#x6570;&#x636E;&#x4ECE;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x83B7;&#x5F97;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x8FD1;&#x7684;&#x786C;&#x4EF6;&#x8BBE;&#x8BA1;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x5904;&#x7406;&#x5668;&#x5185;&#x6838;&#xFF0C;&#x5176;&#x4E2D;&#x4E3A;&#x6BCF;&#x4E2A;&#x5185;&#x6838;&#x5206;&#x914D;&#x4E86;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x4E2A;&#x786C;&#x4EF6;&#x7EBF;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x7B49;&#x5F85;&#x5185;&#x5B58;&#x65F6;&#x505C;&#x6B62;&#xFF0C;&#x5219;&#x5185;&#x6838;&#x53EF;&#x4EE5;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x591A;&#x7EBF;&#x7A0B;&#x5904;&#x7406;&#x5668;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x7C97;&#x7C92;</b>&#x5EA6;&#x591A;<b>&#x7EBF;&#x7A0B; -</b>&#x5728;&#x7C97;&#x7C92;&#x5EA6;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x5728;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x53D1;&#x751F;&#x8BF8;&#x5982;&#x5185;&#x5B58;&#x505C;&#x987F;&#x4E4B;&#x7C7B;&#x7684;&#x957F;&#x5EF6;&#x8FDF;&#x4E8B;&#x4EF6;&#xFF0C;&#x7531;&#x4E8E;&#x957F;&#x5EF6;&#x8FDF;&#x4E8B;&#x4EF6;&#x5F15;&#x8D77;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x5FC5;&#x987B;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4EE5;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x7684;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A;&#x5FC5;&#x987B;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5F00;&#x59CB;&#x5728;&#x5904;&#x7406;&#x5668;&#x6838;&#x5FC3;&#x4E0A;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x7EC8;&#x6B62;&#x6307;&#x4EE4;&#x6D41;&#x6C34;&#x7EBF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x65E6;&#x8FD9;&#x4E2A;&#x65B0;&#x7EBF;&#x7A0B;&#x5F00;&#x59CB;&#x6267;&#x884C;&#xFF0C;&#x5B83;&#x5C31;&#x5F00;&#x59CB;&#x7528;&#x5B83;&#x7684;&#x6307;&#x4EE4;&#x586B;&#x5145;&#x7BA1;&#x9053;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7EC6;&#x7C92;&#x5EA6;<b>&#x591A;&#x7EBF;&#x7A0B; -</b>&#x8FD9;&#x79CD;&#x591A;&#x7EBF;&#x7A0B;&#x4E3B;&#x8981;&#x5728;&#x6307;&#x4EE4;&#x5468;&#x671F;&#x7684;&#x8FB9;&#x754C;&#x5904;&#x4EE5;&#x66F4;&#x7CBE;&#x7EC6;&#x7684;&#x7EA7;&#x522B;&#x5728;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7EC6;&#x7C92;&#x5EA6;&#x7CFB;&#x7EDF;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5305;&#x62EC;&#x7528;&#x4E8E;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x56E0;&#x6B64;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x7684;&#x6210;&#x672C;&#x5F88;&#x5C0F;&#x3002;</span> </li></ol><h3 class="sigil_not_in_toc"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x865A;&#x62DF;&#x5316;&#x548C;&#x7EBF;&#x7A0B; - </span> </h3><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;<b>&#x591A;&#x5904;&#x7406;&#x5668;</b>&#x8C03;&#x5EA6;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x5355;&#x4E2A;CPU&#x7CFB;&#x7EDF;&#x4E5F;&#x50CF;&#x591A;&#x5904;&#x7406;&#x5668;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#x5DE5;&#x4F5C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x5177;&#x6709;&#x865A;&#x62DF;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x865A;&#x62DF;&#x5316;&#x5411;&#x7CFB;&#x7EDF;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x865A;&#x62DF;CPU&#xFF0C;&#x7136;&#x540E;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x95F4;&#x8C03;&#x5EA6;&#x7269;&#x7406;CPU&#x7684;&#x4F7F;&#x7528;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5927;&#x591A;&#x6570;&#x865A;&#x62DF;&#x5316;&#x73AF;&#x5883;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x673A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x8BB8;&#x591A;&#x5BA2;&#x6237;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3B;&#x673A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x548C;&#x7BA1;&#x7406;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x90FD;&#x5B89;&#x88C5;&#x4E86;&#x5BA2;&#x6237;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x5728;&#x8BE5;&#x5BA2;&#x6237;&#x673A;&#x5185;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x53EF;&#x4EE5;&#x4E3A;&#x7279;&#x5B9A;&#x7528;&#x4F8B;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x7528;&#x6237;&#x5206;&#x914D;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5305;&#x62EC;&#x5206;&#x65F6;&#x6216;&#x751A;&#x81F3;&#x771F;&#x5B9E; - &#x65F6;&#x95F4;&#x64CD;&#x4F5C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4EFB;&#x4F55;&#x5728;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x627F;&#x62C5;&#x4E00;&#x5B9A;&#x8FDB;&#x5C55;&#x7684;&#x5BA2;&#x6237;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x90FD;&#x4F1A;&#x53D7;&#x5230;&#x865A;&#x62DF;&#x5316;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x65F6;&#x95F4;&#x5171;&#x4EAB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5C1D;&#x8BD5;&#x4E3A;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x7247;&#x5206;&#x914D;100&#x6BEB;&#x79D2;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x5408;&#x7406;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7ED9;&#x5B9A;&#x7684;100&#x6BEB;&#x79D2;&#x65F6;&#x95F4;&#x7247;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8D85;&#x8FC7;100&#x6BEB;&#x79D2;&#x7684;&#x865A;&#x62DF;CPU&#x65F6;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6839;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x7E41;&#x5FD9;&#x7A0B;&#x5EA6;&#xFF0C;&#x65F6;&#x95F4;&#x7247;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E00;&#x79D2;&#x6216;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x767B;&#x5F55;&#x5230;&#x8BE5;&#x865A;&#x62DF;&#x673A;&#x7684;&#x7528;&#x6237;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x975E;&#x5E38;&#x77ED;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x79CD;&#x8C03;&#x5EA6;&#x5206;&#x5C42;&#x7684;&#x51C0;&#x6548;&#x679C;&#x662F;&#xFF0C;&#x5404;&#x4E2A;&#x865A;&#x62DF;&#x5316;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EA;&#x63A5;&#x6536;&#x4E00;&#x90E8;&#x5206;&#x53EF;&#x7528;&#x7684;CPU&#x5468;&#x671F;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x5B83;&#x4EEC;&#x6B63;&#x5728;&#x63A5;&#x6536;&#x6240;&#x6709;&#x5468;&#x671F;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x8C03;&#x5EA6;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5468;&#x671F;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x6BCF;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x7684;&#x65F6;&#x949F;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9A;&#x65F6;&#x5668;&#x4E0D;&#x518D;&#x89E6;&#x53D1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E13;&#x7528;CPU&#x4E0A;&#x7684;&#x65F6;&#x949F;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C; <b>&#x865A;&#x62DF;&#x5316;</b>&#x53EF;&#x4EE5;&#x64A4;&#x6D88;&#x865A;&#x62DF;&#x673A;&#x5185;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x826F;&#x597D;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x5DE5;&#x4F5C;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <b>&#x53C2;&#x8003; - </b></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://www.amazon.in/Operating-System-Principles-Silberschatz/dp/8126509627" rel="noopener" target="_blank">&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x539F;&#x5219; - &#x9AD8;&#x5C14;&#x6587;</a></span> </p><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><hr><hr><!-- .entry-meta --></div></body></html>