<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/os/76.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF08;RPC&#xFF09;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF08;RPC&#xFF09;</strong>&#x662F;&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x6784;&#x5EFA;<strong>&#x57FA;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF; - &#x670D;&#x52A1;&#x5668;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</strong>&#x7684;&#x5F3A;&#x5927;&#x6280;&#x672F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x57FA;&#x4E8E;&#x6269;&#x5C55;&#x4F20;&#x7EDF;&#x7684;&#x672C;&#x5730;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x88AB;<strong>&#x8C03;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x4E0D;&#x9700;&#x8981;&#x5B58;&#x5728;&#x4E8E;&#x4E0E;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x76F8;&#x540C;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;</strong> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F4D;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5B83;&#x4EEC;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong><u>&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x65F6;&#xFF1A;</u></strong></span> </p><p><img src="../../../imgs/os/ad62e9e24ee8790ce311c3ea5d62aac1.jpg" alt="" width="500" height="353" class="alignnone size-full wp-image-198340"></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>1.</strong>&#x8C03;&#x7528;&#x73AF;&#x5883;&#x88AB;&#x6682;&#x505C;&#xFF0C;&#x8FC7;&#x7A0B;&#x53C2;&#x6570;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x5230;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x5E76;&#x5728;&#x90A3;&#x91CC;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>2.</strong>&#x5F53;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x5E76;&#x4EA7;&#x751F;&#x7ED3;&#x679C;&#x65F6;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x5C06;&#x88AB;&#x4F20;&#x9001;&#x56DE;&#x8C03;&#x7528;&#x73AF;&#x5883;&#xFF0C;&#x5176;&#x4E2D;&#x6267;&#x884C;&#x6062;&#x590D;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4ECE;&#x5E38;&#x89C4;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#x4E00;&#x6837;&#x3002;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6CE8;&#x610F;&#xFF1A;RPC</strong>&#x7279;&#x522B;&#x9002;&#x7528;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF; - &#x670D;&#x52A1;&#x5668;<strong>&#xFF08;&#x4F8B;&#x5982;&#x67E5;&#x8BE2; - &#x54CD;&#x5E94;&#xFF09;</strong>&#x4EA4;&#x4E92;&#xFF0C;&#x5176;&#x4E2D;&#x63A7;&#x5236;&#x6D41;<strong>&#x5728;&#x8C03;&#x7528;&#x8005;&#x548C;&#x88AB;&#x8C03;&#x7528;&#x8005;&#x4E4B;&#x95F4;&#x4EA4;&#x66FF;</strong> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x8BB2;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x4F1A;&#x540C;&#x65F6;&#x6267;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x76F8;&#x53CD;&#xFF0C;&#x6267;&#x884C;&#x7684;&#x7EBF;&#x7A0B;&#x4ECE;&#x8C03;&#x7528;&#x8005;&#x8DF3;&#x8F6C;&#x5230;&#x88AB;&#x8C03;&#x7528;&#x8005;&#x7136;&#x540E;&#x518D;&#x8FD4;&#x56DE;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <u><strong>RPC&#x7684;&#x5DE5;&#x4F5C;</strong></u></span> </p><p><img src="../../../imgs/os/ba4eb35c6a78dc7e0385f95d38804c54.jpg" alt="" width="500" height="388" class="alignnone size-full wp-image-198375"></p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5728;RPC&#x671F;&#x95F4;&#x6267;&#x884C;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#xFF1A;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>1.</strong>&#x5BA2;&#x6237;&#x7AEF;&#x8C03;&#x7528;<strong>&#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x6839;&#x8FC7;&#x7A0B;</strong> &#xFF0C;&#x4EE5;&#x901A;&#x5E38;&#x7684;&#x65B9;&#x5F0F;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x6839;&#x4F4D;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x5185;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>2.</strong>&#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x6839;&#x5C06;&#x53C2;&#x6570;<strong>&#x7F16;&#x7EC4;&#xFF08;&#x6253;&#x5305;&#xFF09;</strong>&#x5230;&#x6D88;&#x606F;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7F16;&#x7EC4;&#x5305;&#x62EC;&#x5C06;&#x53C2;&#x6570;&#x7684;&#x8868;&#x793A;&#x8F6C;&#x6362;&#x4E3A;&#x6807;&#x51C6;&#x683C;&#x5F0F;&#xFF0C;&#x5E76;&#x5C06;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x590D;&#x5236;&#x5230;&#x6D88;&#x606F;&#x4E2D;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>3.</strong>&#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x6839;&#x5C06;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7ED9;&#x4F20;&#x8F93;&#x5C42;&#xFF0C;&#x4F20;&#x8F93;&#x5C42;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x5230;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x8BA1;&#x7B97;&#x673A;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>4.</strong>&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x4F20;&#x8F93;&#x5C42;&#x5C06;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x6839;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x6839;&#x5BF9;&#x53C2;&#x6570;&#x8FDB;&#x884C;<strong>&#x89E3;&#x7EC4;&#xFF08;&#x89E3;&#x5305;&#xFF09;</strong>&#x5E76;&#x4F7F;&#x7528;&#x5E38;&#x89C4;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x673A;&#x5236;&#x8C03;&#x7528;&#x6240;&#x9700;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4F8B;&#x7A0B;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>5.</strong>&#x5F53;&#x670D;&#x52A1;&#x5668;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x6839;<strong>&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x8FC7;&#x6B63;&#x5E38;&#x7684;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#xFF09;</strong> &#xFF0C;&#x5B83;&#x5C06;&#x8FD4;&#x56DE;&#x503C;&#x7F16;&#x7EC4;&#x4E3A;&#x6D88;&#x606F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x540E;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x6839;&#x5C06;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7ED9;&#x4F20;&#x8F93;&#x5C42;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>6.</strong>&#x4F20;&#x8F93;&#x5C42;&#x5C06;&#x7ED3;&#x679C;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x56DE;&#x5BA2;&#x6237;&#x7AEF;&#x4F20;&#x8F93;&#x5C42;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4F20;&#x8F93;&#x5C42;&#x5C06;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x56DE;&#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x6839;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>7.</strong>&#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x6839;&#x89E3;&#x7EC4;&#x8FD4;&#x56DE;&#x53C2;&#x6570;&#xFF0C;&#x6267;&#x884C;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <u><strong>RPC&#x95EE;&#x9898;</strong></u></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5FC5;&#x987B;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF1A;</strong></span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>1. RPC&#x8FD0;&#x884C;&#x65F6;&#xFF1A;</strong> RPC&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x7A0B;&#x5E93;&#x548C;&#x4E00;&#x7EC4;&#x670D;&#x52A1;&#xFF0C;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x6784;&#x6210;RPC&#x673A;&#x5236;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;RPC&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x7684;&#x4EE3;&#x7801;&#x5904;&#x7406;<strong>&#x7ED1;&#x5B9A;&#xFF0C;&#x901A;&#x8FC7;&#x9002;&#x5F53;&#x7684;&#x534F;&#x8BAE;&#x5EFA;&#x7ACB;&#x901A;&#x4FE1;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x8C03;&#x7528;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x5904;&#x7406;&#x901A;&#x4FE1;&#x9519;&#x8BEF;&#x3002;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>2.&#x5B58;&#x6839;&#xFF1A;&#x5B58;&#x6839;</strong>&#x7684;&#x529F;&#x80FD;&#x662F;&#x4E3A;<strong>&#x7A0B;&#x5E8F;&#x5458;&#x7F16;&#x5199;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x63D0;&#x4F9B;&#x900F;&#x660E;&#x6027;</strong> &#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5728;&#x5BA2;&#x6237;&#x7AEF;</strong> &#xFF0C;&#x5B58;&#x6839;&#x5904;&#x7406;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x672C;&#x5730;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x7F16;&#x7EC4;&#x548C;&#x89E3;&#x7EC4;&#x6570;&#x636E;&#xFF0C;&#x8C03;&#x7528;RPC&#x8FD0;&#x884C;&#x65F6;&#x534F;&#x8BAE;&#xFF0C;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#xFF0C;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x7ED1;&#x5B9A;&#x6B65;&#x9AA4;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;</strong> &#xFF0C;&#x5B58;&#x6839;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x6267;&#x884C;&#x7684;&#x672C;&#x5730;&#x7BA1;&#x7406;&#x5668;&#x8FC7;&#x7A0B;&#x4E4B;&#x95F4;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x7684;&#x63A5;&#x53E3;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>3.&#x7ED1;&#x5B9A;&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x547C;&#x53EB;&#x8005;&#x4EE5;&#x53CA;&#x670D;&#x52A1;&#x6240;&#x5728;&#x7684;&#x4F4D;&#x7F6E;&#xFF1F;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6700;&#x7075;&#x6D3B;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#xFF0C;&#x5E76;&#x5728;&#x9996;&#x6B21;&#x521B;&#x5EFA;RPC&#x65F6;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x67E5;&#x627E;&#x670D;&#x52A1;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x6839;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x8054;&#x7CFB;&#x540D;&#x79F0;&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x786E;&#x5B9A;&#x670D;&#x52A1;&#x5668;&#x6240;&#x5728;&#x7684;&#x4F20;&#x8F93;&#x5730;&#x5740;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7ED1;&#x5B9A;&#x5305;&#x62EC;&#x4E24;&#x90E8;&#x5206;&#xFF1A;</strong></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <u>&#x547D;&#x540D;&#xFF1A;</u></span> </li><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x547D;&#x540D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x63A5;&#x53E3;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7279;&#x5B9A;&#x670D;&#x52A1;&#xFF0C;&#x63CF;&#x8FF0;&#x5176;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x6570;&#x91CF;</strong> &#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x7684;&#x76EE;&#x7684;&#x4E0E;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x7C7B;&#x4F3C;&#x3002;</span> </p><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <u>&#x5B9A;&#x4F4D;&#xFF1A;</u></span> </li><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x67E5;&#x627E;&#x670D;&#x52A1;&#x5668;&#x5B9E;&#x9645;&#x9A7B;&#x7559;&#x7684;&#x4F20;&#x8F93;&#x5730;&#x5740;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x4E86;&#x670D;&#x52A1;&#x7684;&#x4F20;&#x8F93;&#x5730;&#x5740;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;</span> </p></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5177;&#x6709;&#x670D;&#x52A1;<strong>&#x7684;&#x670D;&#x52A1;&#x5668;</strong>&#x4E3A;&#x5176;&#x63D0;&#x4F9B;&#x5BFC;&#x51FA;&#x63A5;&#x53E3;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5BFC;&#x51FA;&#x63A5;&#x53E3;&#x4F1A;&#x5C06;&#x5176;&#x6CE8;&#x518C;&#x5230;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x5BA2;&#x6237;&#x7AEF;</strong>&#x5FC5;&#x987B;&#x5148;&#x5BFC;&#x5165;&#xFF08;&#x5BFC;&#x51FA;&#xFF09;&#x63A5;&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x5F00;&#x59CB;&#x901A;&#x4FE1;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <u><strong>&#x4F18;&#x70B9;</strong></u></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>1.</strong> RPC&#x63D0;&#x4F9B;<strong>ABSTRACTION&#xFF0C;</strong>&#x5373;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7684;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x6027;&#x8D28;&#x5BF9;&#x7528;&#x6237;&#x662F;&#x9690;&#x85CF;&#x7684;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>2.</strong> RPC&#x7ECF;&#x5E38;&#x7701;&#x7565;&#x8BB8;&#x591A;&#x534F;&#x8BAE;&#x5C42;&#x4EE5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5373;&#x4F7F;&#x5F88;&#x5C0F;&#x7684;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x7ECF;&#x5E38;&#x8C03;&#x7528;RPC&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>3.</strong> RPC&#x5141;&#x8BB8;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5728;&#x672C;&#x5730;&#x73AF;&#x5883;&#x4E2D;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>4.</strong>&#x4F7F;&#x7528;RPC&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x91CD;&#x5199;/&#x91CD;&#x65B0;&#x5F00;&#x53D1;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>5.</strong> RPC&#x652F;&#x6301;&#x7684;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x548C;&#x9762;&#x5411;&#x7EBF;&#x7A0B;&#x7684;&#x6A21;&#x578B;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>Refrences&#xFF1A;</strong></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://web.cs.wpi.edu/~cs4514/b98/week8-rpc/week8-rpc.html">https://web.cs.wpi.edu/~cs4514/b98/week8-rpc/week8-rpc.html</a></span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <a href="https://users.cs.cf.ac.uk/Dave.Marshall/C/node33.html">https://users.cs.cf.ac.uk/Dave.Marshall/C/node33.html</a></span> </li></ul><br><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>