<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-x-mtfrom-en"><head><meta http-equiv="X-Translated-By" content="Google"><link href="https://apachecn.github.io/geeksforgeeks-zh/docs/en/os/84.html" hreflang="en" rel="alternate machine-translated-from"><title></title><link href="../../../styles/ebook.css" type="text/css" rel="stylesheet"></head><body><header class="entry-header"><h1 class="entry-title"> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x865A;&#x62DF;&#x5185;&#x5B58;</span> </h1></header><!-- .entry-header --><div class="entry-content"><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x865A;&#x62DF;&#x5185;&#x5B58;&#x662F;&#x4E00;&#x79CD;&#x5B58;&#x50A8;&#x5206;&#x914D;&#x65B9;&#x6848;&#xFF0C;&#x5176;&#x4E2D;&#x8F85;&#x52A9;&#x5185;&#x5B58;&#x53EF;&#x4EE5;&#x88AB;&#x5BFB;&#x5740;&#xFF0C;&#x5C31;&#x50CF;&#x5B83;&#x662F;&#x4E3B;&#x5185;&#x5B58;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4E00;&#x6837;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7A0B;&#x5E8F;&#x53EF;&#x7528;&#x4E8E;&#x5F15;&#x7528;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x5730;&#x5740;&#x4E0E;&#x5B58;&#x50A8;&#x5668;&#x7CFB;&#x7EDF;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x7269;&#x7406;&#x5B58;&#x50A8;&#x7AD9;&#x70B9;&#x7684;&#x5730;&#x5740;&#x4E0D;&#x540C;&#xFF0C;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x7684;&#x5730;&#x5740;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x4E3A;&#x76F8;&#x5E94;&#x7684;&#x673A;&#x5668;&#x5730;&#x5740;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x865A;&#x62DF;&#x5B58;&#x50A8;&#x7684;&#x5927;&#x5C0F;&#x53D7;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x5BFB;&#x5740;&#x65B9;&#x6848;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x8F85;&#x52A9;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x6570;&#x91CF;&#x4E0D;&#x662F;&#x7531;&#x4E3B;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x7684;&#x5B9E;&#x9645;&#x6570;&#x91CF;&#x53EF;&#x7528;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x4F7F;&#x7528;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x5B9E;&#x73B0;&#x7684;&#x6280;&#x672F;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x5C06;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF08;&#x79F0;&#x4E3A;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF09;&#x6620;&#x5C04;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;</span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5B58;&#x5F15;&#x7528;&#x90FD;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x52A8;&#x6001;&#x8F6C;&#x6362;&#x4E3A;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x903B;&#x8F91;&#x5730;&#x5740;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x5C06;&#x8FDB;&#x7A0B;&#x4EA4;&#x6362;&#x8FDB;&#x51FA;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x5360;&#x7528;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x53EF;&#x4EE5;&#x5C06;&#x5904;&#x7406;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x7247;&#x6BB5;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x7247;&#x6BB5;&#x5728;&#x6267;&#x884C;&#x671F;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x8FDE;&#x7EED;&#x5730;&#x4F4D;&#x4E8E;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x52A8;&#x6001;&#x8FD0;&#x884C;&#x65F6;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x548C;&#x9875;&#x9762;&#x6216;&#x6BB5;&#x8868;&#x7684;&#x4F7F;&#x7528;&#x7684;&#x7EC4;&#x5408;&#x5141;&#x8BB8;&#x8FD9;&#x6837;&#x505A;&#x3002;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x5B58;&#x5728;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#xFF0C;&#x5219;&#x5728;&#x6267;&#x884C;&#x671F;&#x95F4;&#x4E0D;&#x5FC5;&#x5C06;&#x6240;&#x6709;&#x9875;&#x9762;&#x6216;&#x6BB5;&#x5B58;&#x5728;&#x4E8E;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9700;&#x8981;&#x65F6;&#x9700;&#x8981;&#x5C06;&#x6240;&#x9700;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x865A;&#x62DF;&#x5185;&#x5B58;&#x4F7F;&#x7528;Demand Paging&#x6216;Demand Segmentation&#x5B9E;&#x73B0;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x9700;&#x6C42;&#x5BFB;&#x547C;&#xFF1A;</strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6309;&#x9700;&#x5C06;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x8FC7;&#x7A0B;&#xFF08;&#x6BCF;&#x5F53;&#x53D1;&#x751F;&#x9875;&#x9762;&#x9519;&#x8BEF;&#x65F6;&#xFF09;&#x79F0;&#x4E3A;&#x8BF7;&#x6C42;&#x5206;&#x9875;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BE5;&#x8FC7;&#x7A0B;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#xFF1A;</span> <br> <a href="https://cdncontribute.geeksforgeeks.org/wp-content/uploads/VirtualDiagram-1.png"><img src="../../../imgs/os/0ab00db00cf531184f2fb9919ea52dc5.jpg" alt="virtual_mem" class="alignnone size-full wp-image-31014"></a> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;CPU&#x5C1D;&#x8BD5;&#x5F15;&#x7528;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x5F53;&#x524D;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5219;&#x4F1A;&#x751F;&#x6210;&#x6307;&#x793A;&#x5B58;&#x50A8;&#x5668;&#x8BBF;&#x95EE;&#x6545;&#x969C;&#x7684;&#x4E2D;&#x65AD;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C06;&#x4E2D;&#x65AD;&#x7684;&#x8FDB;&#x7A0B;&#x7F6E;&#x4E8E;&#x963B;&#x585E;&#x72B6;&#x6001;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3A;&#x4E86;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x5C06;&#x6240;&#x9700;&#x7684;&#x9875;&#x9762;&#x5E26;&#x5165;&#x5185;&#x5B58;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C06;&#x5728;&#x903B;&#x8F91;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x641C;&#x7D22;&#x6240;&#x9700;&#x7684;&#x9875;&#x9762;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6240;&#x9700;&#x9875;&#x9762;&#x5C06;&#x4ECE;&#x903B;&#x8F91;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x5E26;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9875;&#x9762;&#x66FF;&#x6362;&#x7B97;&#x6CD5;&#x7528;&#x4E8E;&#x66FF;&#x6362;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x9875;&#x9762;&#x7684;&#x51B3;&#x7B56;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9875;&#x9762;&#x8868;&#x5C06;&#x76F8;&#x5E94;&#x66F4;&#x65B0;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4FE1;&#x53F7;&#x5C06;&#x88AB;&#x53D1;&#x9001;&#x5230;CPU&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x5C06;&#x4F7F;&#x8FDB;&#x7A0B;&#x8FD4;&#x56DE;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x5F53;&#x53D1;&#x751F;&#x9875;&#x9762;&#x9519;&#x8BEF;&#x65F6;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x90FD;&#x4F1A;&#x9075;&#x5FAA;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#xFF0C;&#x5E76;&#x5C06;&#x6240;&#x9700;&#x9875;&#x9762;&#x5E26;&#x5165;&#x5185;&#x5B58;&#x3002;</span> </p><br><!-- post_top_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="4501693235" data-ad-format="auto"></ins><br><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x4F18;&#x70B9; &#xFF1A;</strong></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x53EF;&#x4EE5;&#x7EF4;&#x62A4;&#x66F4;&#x591A;&#x8FDB;&#x7A0B;&#xFF1A;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53EA;&#x4F1A;&#x52A0;&#x8F7D;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x8FDB;&#x7A0B;&#x7684;&#x67D0;&#x4E9B;&#x9875;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x6709;&#x66F4;&#x591A;&#x8FDB;&#x7A0B;&#x7684;&#x7A7A;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x5BFC;&#x81F4;&#x5904;&#x7406;&#x5668;&#x7684;&#x66F4;&#x6709;&#x6548;&#x5229;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x66F4;&#x53EF;&#x80FD;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x5904;&#x7406;&#x4E2D;&#x7684;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x5C06;&#x5904;&#x4E8E;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x6BD4;&#x6240;&#x6709;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x90FD;&#x8981;&#x5927;&#xFF1A;&#x7F16;&#x7A0B;&#x4E2D;&#x6700;&#x57FA;&#x672C;&#x7684;&#x9650;&#x5236;&#x4E4B;&#x4E00;&#x88AB;&#x53D6;&#x6D88;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7531;&#x4E8E;&#x9700;&#x6C42;&#x5206;&#x9875;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5927;&#x4E8E;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> OS&#x672C;&#x8EAB;&#x6839;&#x636E;&#x9700;&#x8981;&#x5728;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x52A0;&#x8F7D;&#x8FDB;&#x7A0B;&#x7684;&#x9875;&#x9762;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B83;&#x901A;&#x8FC7;&#x4E3A;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#x8F83;&#x5C11;&#x7684;&#x53EF;&#x7528;&#xFF08;&#x4E3B;&#xFF09;&#x5185;&#x5B58;&#x6765;&#x5141;&#x8BB8;&#x66F4;&#x9AD8;&#x7684;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7EA7;&#x522B;&#x3002;</span> </li></ul><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x9875;&#x9762;&#x9519;&#x8BEF;&#x670D;&#x52A1;&#x65F6;&#x95F4;&#xFF1A;</strong></span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x670D;&#x52A1;&#x9875;&#x9762;&#x9519;&#x8BEF;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x79F0;&#x4E3A;&#x9875;&#x9762;&#x9519;&#x8BEF;&#x670D;&#x52A1;&#x65F6;&#x95F4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x9875;&#x9762;&#x9519;&#x8BEF;&#x670D;&#x52A1;&#x65F6;&#x95F4;&#x5305;&#x62EC;&#x6267;&#x884C;&#x4E0A;&#x8FF0;&#x6240;&#x6709;&#x516D;&#x4E2A;&#x6B65;&#x9AA4;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x3002;</span> </p><pre> <span class="pre-span" style="direction: ltr; text-align: left">Let Main memory access time is: m</span>
<span class="pre-span" style="direction: ltr; text-align: left">Page fault service time is: s</span>
<span class="pre-span" style="direction: ltr; text-align: left">Page fault rate is : p</span>
<span class="pre-span" style="direction: ltr; text-align: left">Then, Effective memory access time = (p*s) + (1-p)*m</span>
</pre><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x4EA4;&#x6362;&#xFF1A;</strong></span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4EA4;&#x6362;&#x8FDB;&#x7A0B;&#x610F;&#x5473;&#x7740;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x5220;&#x9664;&#x6240;&#x6709;&#x9875;&#x9762;&#xFF0C;&#x6216;&#x8005;&#x6807;&#x8BB0;&#x5B83;&#x4EEC;&#x4EE5;&#x4FBF;&#x901A;&#x8FC7;&#x6B63;&#x5E38;&#x9875;&#x9762;&#x66FF;&#x6362;&#x8FC7;&#x7A0B;&#x5C06;&#x5176;&#x5220;&#x9664;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6302;&#x8D77;&#x8FDB;&#x7A0B;&#x53EF;&#x786E;&#x4FDD;&#x5728;&#x6362;&#x51FA;&#x8FDB;&#x7A0B;&#x65F6;&#x4E0D;&#x53EF;&#x8FD0;&#x884C;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7A0D;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x8FDB;&#x7A0B;&#x4ECE;&#x8F85;&#x52A9;&#x5B58;&#x50A8;&#x5668;&#x4EA4;&#x6362;&#x56DE;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5F53;&#x8FDB;&#x7A0B;&#x5FD9;&#x4E8E;&#x4EA4;&#x6362;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x79F0;&#x4E3A;&#x98A0;&#x7C38;&#x3002;</span> </p><p> <a href="https://cdncontribute.geeksforgeeks.org/wp-content/uploads/VirtualDiagram-2.png"><img src="../../../imgs/os/f01cea0c91a8395f4df59faf4c539c4f.jpg" alt="swaping" class="alignnone size-full wp-image-32437"></a> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6376;&#x6253;&#xFF1A;</strong></span> <br> <a href="https://cdncontribute.geeksforgeeks.org/wp-content/uploads/VirtualDiagram-3.png"><img src="../../../imgs/os/18ef51f5723de7373ceadba0c504645b.jpg" alt="virtual_mem_2" class="alignnone size-full wp-image-31020"></a> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#xFF0C;&#x4EFB;&#x4F55;&#x8FDB;&#x7A0B;&#x4E2D;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x9875;&#x9762;&#x4F4D;&#x4E8E;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5728;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7EF4;&#x62A4;&#x66F4;&#x591A;&#x8FDB;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6B64;&#x5916;&#xFF0C;&#x8282;&#x7701;&#x4E86;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x9875;&#x9762;&#x4E0D;&#x4F1A;&#x6362;&#x5165;&#x548C;&#x6362;&#x51FA;&#x5185;&#x5B58;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x806A;&#x660E;&#x5730;&#x7BA1;&#x7406;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x90FD;&#x5C06;&#x88AB;&#x8FDB;&#x7A0B;&#x9875;&#x9762;&#x5360;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x5904;&#x7406;&#x5668;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E26;&#x5165;&#x4E00;&#x9875;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x629B;&#x51FA;&#x53E6;&#x4E00;&#x9875;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x5B83;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x51E0;&#x4E4E;&#x5FC5;&#x987B;&#x7ACB;&#x5373;&#x518D;&#x6B21;&#x83B7;&#x53D6;&#x8BE5;&#x9875;&#x9762;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x592A;&#x591A;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x79CD;&#x53EB;&#x505A;Thrashing&#x7684;&#x60C5;&#x51B5;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7CFB;&#x7EDF;&#x82B1;&#x8D39;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x4EA4;&#x6362;&#x9875;&#x9762;&#x800C;&#x4E0D;&#x662F;&#x6267;&#x884C;&#x6307;&#x4EE4;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9875;&#x9762;&#x66FF;&#x6362;&#x7B97;&#x6CD5;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5728;&#x7ED9;&#x5B9A;&#x7684;&#x56FE;&#x4E2D;&#xFF0C;&#x591A;&#x70B9;&#x7F16;&#x7A0B;&#x7684;&#x521D;&#x59CB;&#x7A0B;&#x5EA6;&#x8FBE;&#x5230;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x7684;&#x70B9;&#xFF08;lamda&#xFF09;&#xFF0C;CPU&#x5229;&#x7528;&#x7387;&#x975E;&#x5E38;&#x9AD8;&#x5E76;&#x4E14;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x88AB;100&#xFF05;&#x5229;&#x7528;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x591A;&#x7F16;&#x7A0B;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;CPU&#x5229;&#x7528;&#x7387;&#x5C06;&#x6025;&#x5267;&#x4E0B;&#x964D;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x53EA;&#x5728;&#x9875;&#x9762;&#x66FF;&#x6362;&#x4E2D;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x5B8C;&#x6210;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x5C06;&#x589E;&#x52A0;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x79F0;&#x4E3A;&#x98A0;&#x7C38;&#x3002;</span> <br><br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x98A0;&#x7C38;&#x7684;&#x539F;&#x56E0;&#xFF1A;</strong></span> </p><ol><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x9AD8;&#x5EA6;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x5316;</strong> &#xFF1A;&#x5982;&#x679C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#x6570;&#x7EE7;&#x7EED;&#x589E;&#x52A0;&#xFF0C;&#x5219;&#x5206;&#x914D;&#x7ED9;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5E27;&#x6570;&#x5C06;&#x51CF;&#x5C11;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x7528;&#x7684;&#x5E27;&#x6570;&#x8F83;&#x5C11;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x9875;&#x9762;&#x9519;&#x8BEF;&#x5C06;&#x66F4;&#x9891;&#x7E41;&#x5730;&#x53D1;&#x751F;&#xFF0C;&#x5E76;&#x4E14;&#x4EC5;&#x4EC5;&#x4EA4;&#x6362;&#x9875;&#x9762;&#x5C31;&#x4F1A;&#x6D6A;&#x8D39;&#x66F4;&#x591A;&#x7684;CPU&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x5229;&#x7528;&#x7387;&#x5C06;&#x7EE7;&#x7EED;&#x964D;&#x4F4E;&#x3002;</span> <p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x4F8B;&#x5982;&#xFF1A;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8BA9;&#x81EA;&#x7531;&#x5E27;= 400</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6848;&#x4F8B;1</strong> &#xFF1A;&#x6D41;&#x7A0B;&#x6570;= 100</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x7136;&#x540E;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5C06;&#x83B7;&#x5F97;4&#x5E27;&#x3002;</span> </p><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x6848;&#x4F8B;2</strong> &#xFF1A;&#x6D41;&#x7A0B;&#x6570;= 400</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x6BCF;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C06;&#x83B7;&#x5F97;1&#x5E27;&#x3002;</span> <br> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x60C5;&#x51B5;2&#x662F;&#x98A0;&#x7C38;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x968F;&#x7740;&#x5904;&#x7406;&#x7684;&#x6570;&#x91CF;&#x589E;&#x52A0;&#xFF0C;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x7684;&#x5E27;&#x51CF;&#x5C11;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x53EA;&#x9700;&#x4EA4;&#x6362;&#x9875;&#x9762;&#x5C31;&#x4F1A;&#x6D88;&#x8017;CPU&#x65F6;&#x95F4;&#x3002;</span> </p></li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x7F3A;&#x5C11;&#x6846;&#x67B6;</strong> &#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5E27;&#x6570;&#x8F83;&#x5C11;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x8F83;&#x5C11;&#x9875;&#x9762;&#x5C06;&#x80FD;&#x591F;&#x9A7B;&#x7559;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x66F4;&#x9891;&#x7E41;&#x5730;&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x98A0;&#x7C38;&#x3002;</span> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x56E0;&#x6B64;&#xFF0C;&#x5FC5;&#x987B;&#x4E3A;&#x6BCF;&#x4E2A;&#x8FC7;&#x7A0B;&#x5206;&#x914D;&#x8DB3;&#x591F;&#x6570;&#x91CF;&#x7684;&#x5E27;&#x4EE5;&#x9632;&#x6B62;&#x98A0;&#x7C38;&#x3002;</span> </li></ol><p> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()"> <strong>&#x98A0;&#x7C38;&#x7684;&#x6062;&#x590D;&#xFF1A;</strong></span> </p><ul><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x901A;&#x8FC7;&#x6307;&#x793A;&#x957F;&#x671F;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x5728;&#x9608;&#x503C;&#x4E4B;&#x540E;&#x4E0D;&#x5C06;&#x8FDB;&#x7A0B;&#x7F6E;&#x4E8E;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x7CFB;&#x7EDF;&#x8FDB;&#x5165;&#x98A0;&#x7C38;&#x72B6;&#x6001;&#x3002;</span> </li><li> <span class="notranslate" onmouseover="_tipon(this)" onmouseout="_tipoff()">&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x5728;&#x98A0;&#x7C38;&#xFF0C;&#x90A3;&#x4E48;&#x6307;&#x793A;&#x4E2D;&#x671F;&#x8BA1;&#x5212;&#x6682;&#x505C;&#x67D0;&#x4E9B;&#x8FDB;&#x7A0B;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x98A0;&#x7C38;&#x4E2D;&#x6062;&#x590D;&#x7CFB;&#x7EDF;&#x3002;</span> </li></ul><!-- post_bottom_responsive --><ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-9465609616171866" data-ad-slot="8385097921" data-ad-format="auto"></ins><br><br><!-- .entry-meta --></div></body></html>